[
	{
		"themes": "Formulaire",
		"title": "Chaque élément de formulaire possède-t-il une étiquette visible&nbsp;?",
		"ID": "testID-001",
		"IDorigin": "testID-001",
		"wcag": [
			"3.3.2 A"
		],
		"verifier": "<ul><li>Une étiquette est visuellement présente à proximité de chaque élément de formulaire permettant de les associer visuellement</li><li>ou l'élément de formulaire possède un attribut <code>title</code></li><li>ou l'élément de formulaire est accompagné d'un texte qui devient visible à la prise de focus.</li></ul><p>Et qu'une légende est visible pour les éléments de formulaire regroupés.</p><p>Lorsque l'élément de formulaire n'a pas de libellé visible mais que son rôle est évident (exemple : champ de recherche accompagné d'un bouton en forme de loupe, case à cocher pour sélectionner une ligne dans un tableau de données), c'est une exception et le critère est conforme.</p>",
		"complement": "<strong>Complément&nbsp;</strong><ul><li>La pertinence (<abbr>WCAG</abbr> 2.4.6 Headings and Labels) de l'étiquette et du message d'erreur est à évaluer à la question&nbsp;: https://la-va11ydette.orange.com/?list=wcag-web&lang=fr#headingtestID-002</li><li>Le lien sémantique élément de formulaire et étiquette/message d'erreur (<abbr>WCAG</abbr> 1.3.1 Info and Relationships) est à évaluer à la question https://la-va11ydette.orange.com/?list=wcag-web&lang=fr#headingtestID-new1.3.1</li><li>La présence d'un nom ou d'une description accessible (<abbr>WCAG</abbr>4.1.2 Name, Role, Value) est à évaluer à la question https://la-va11ydette.orange.com/?list=wcag-web&lang=fr#headingtestID-067</li></ul><p>Attention, un <code>placeholder</code> seul ne suffit pas à fournir une étiquette visible. Il doit être accompagné par un texte persistant à proximité de l'élément de formulaire.</p>",
		"group": "Formulaire",
		"moreInfo": "https://a11y-guidelines.orange.com/fr/web/developper/formulaires/#rendre-accessibles-les-champs-de-formulaire",
		"priority": "P0",
		"resultatTest": "nt",
		"goodPractice": false
	},
	{
		"themes": "Formulaire",
		"title": "Un format de données est-il indiqué, si besoin&nbsp;?",
		"ID": "testID-005",
		"IDorigin": "testID-005",
		"wcag": [
			"3.3.2 A"
		],
		"verifier": "<p>Le format de données est présent visuellement, et sa position permet de l'associer à l'élément de formulaire concerné.</p>",
		"complement": "<strong>Attention&nbsp;:</strong>La pertinence (<abbr>WCAG</abbr> 2.4.6 Headings and Labels) du format est à évaluer à la question&nbsp;: https://la-va11ydette.orange.com/?list=wcag-web&lang=fr#headingtestID-002",
		"group": "Formulaire",
		"moreInfo": "https://a11y-guidelines.orange.com/fr/web/developper/formulaires/#rendre-accessibles-les-champs-de-formulaire",
		"priority": "P0",
		"resultatTest": "nt",
		"goodPractice": false
	},
	{
		"themes": "Formulaire",
		"title": "Chaque champ de formulaire a-t-il un nom accessible pertinent&nbsp;?",
		"ID": "testID-067",
		"IDorigin": "testID-067",
		"wcag": [
			"1.3.1 A",
			"4.1.2 A"
		],
		"verifier": "<ul><li>Vérifier que tous les éléments de formulaire ont un nom accessible pertinent, via un des éléments suivants&nbsp;:<ul><li>un attribut <code>aria-labelledby</code> dans le champ</li><li>un attribut <code>aria-label</code> dans l'élément de formulaire</li><li>une balise <code>label</code> avec obligation d'un attribut <code>for</code> référençant l'<code>id</code> du champ</li><li>une balise <code>label</code> incluant l'élément de formulaire (label implicite)</li><li>un attribut <code>title</code> dans la balise <code>input</code> du champ</li></ul><p>Et ce nom accessible est pertinent.</p>",
		"complement": "<h5>Complément d'information</h5><p>Un <code>placeholder</code> seul ne suffit pas à fournir un nom accessible, il doit être accompagné d'une des techniques citées ci-dessus.</p><p>Le lien programmatique entre l'étiquette et l'élément de formulaire (WCAG 1.3.1 Info and Relationships) est à évaluer à la question&nbsp;: https://la-va11ydette.orange.com/?list=wcag-web&lang=fr#headingtestID-new1.3.1.</p><p>L'état de l’élément (WCAG 4.1.2 A Role, Name, Value) est à évaluer à la question&nbsp;: https://la-va11ydette.orange.com/?list=wcag-web&lang=fr#headingtestID-066.</p>",
		"group": "Formulaire",
		"moreInfo": "https://a11y-guidelines.orange.com/fr/web/developper/formulaires/#rendre-accessibles-les-champs-de-formulaire",
		"priority": "P1",
		"resultatTest": "nt",
		"goodPractice": false
	},
	{
		"themes": "Formulaire",
		"title": "Les champs sont-ils regroupés lorsque nécessaire&nbsp;?",
		"ID": "testID-003",
		"IDorigin": "testID-003",
		"wcag": [
			"1.3.1 A"
		],
		"verifier": "<ul><li>Vérifier la présence, si nécessaire, de groupement de type <code>fieldset</code> ou d'un attribut ARIA <code>role='group'</code> ou <code>role='radiogroup'</code> ou <code>optgroup</code> dans un <code>select</code></li><li>Et que chaque groupe possède une légende.</li></ul>",
		"complement": "<strong>Complément&nbsp;: </strong><p>On regroupe uniquement lorsque nécessaire, par exemple&nbsp;:</p><ul><li>afin de distinguer plusieurs champs ayant le même label (rue, code postal, ville pour adresse de facturation et adresse de livraison)</li><li>légende nécessaire pour faire un choix dans une liste de type radio (<code><input type='radio'></code>) ou balises possédant un attribut ARIA <code>role='radio'<code>) ou de type checkbox(<code><input type='checkbox'></code>) ou balises possédant un attribut ARIA <code>role='checkbox'<code></li></ul><p><strong>Attention&nbsp;:</strong>La pertinence (<abbr>WCAG</abbr> 2.4.6 Headings and Labels) de la légende est à évaluer au niveau de la question&nbsp;: https://la-va11ydette.orange.com/?list=wcag-web&lang=fr#headingtestID-002",
		"group": "Formulaire",
		"moreInfo": "https://a11y-guidelines.orange.com/fr/web/developper/formulaires/#rendre-accessibles-les-champs-de-formulaire",
		"priority": "P3",
		"resultatTest": "nt",
		"goodPractice": false
	},
	{
		"themes": "Formulaire",
		"title": "Chaque étiquette et légende de champ est-elle pertinente&nbsp;?",
		"ID": "testID-002",
		"IDorigin": "testID-002",
		"wcag": [
			"2.4.6 AA"
		],
		"verifier": "<p>L'étiquette de chaque élément de formulaire doit être pertinente :</p><ul><li>Si un format de donnée est indiqué, bérifier sa pertinence</li><li>Si des éléments de formulaires sont regroupés, vérifier également que la légende est pertinente.</li><li>Si l'élément de formulaire à un nom accessible, vérifier aussi sa pertinence</li><li>Si l'élément de formulaire est obligatoire, vérifier la pertinence de la mention.</li></ul>",
		"complement": "<strong>complément&nbsp;:</strong><p>Ce test concerne la pertinence de l'étiquette visible et non celle du nom accessible de l'élément de formulaire.</p>",
		"exception": "<p>La présence d'une étiquette ou d'une légende visible n'est pas obligatoire (exemple&nbsp;: un champ de recherche unique avec un bouton en forme de loupe). Dans ce cas c'est une exception et le critère est conforme.</p>",
		"group": "Formulaire",
		"moreInfo": "https://a11y-guidelines.orange.com/fr/web/developper/formulaires/#rendre-accessibles-les-champs-de-formulaire",
		"priority": "P0",
		"resultatTest": "nt",
		"goodPractice": false
	},
	{
		"themes": "Formulaire",
		"title": "Les éléments de formulaire obligatoires sont-ils identifiables&nbsp;?",
		"ID": "testID-004",
		"IDorigin": "testID-004",
		"wcag": [
			"3.3.2 A"
		],
		"verifier": "<ul><li>Un texte  ou un élément graphique (astérisque, image ou autre symbole) doit être présent pour indiquer qu'un élément de formulaire est obligatoire.</li><li>Un texte doit expliciter l'élément graphique signalant un élément de formulaire obligatoire. Dans le code source, ce texte doit apparaitre avant la première utilisation.</li></ul>",
		"complement": "<strong>Attention&nbsp;:</strong>La pertinence (<abbr>WCAG</abbr> 2.4.6 Headings and Labels) de la mention obligatoire est à évaluer au niveau de la question&nbsp;: https://la-va11ydette.orange.com/?list=wcag-web&lang=fr#headingtestID-002 ",
		"exception": "<p>Le critère est non-applicable si le caractère obligatoire d'un champ est évident (exemple&nbsp;: champ de recherche, inscription à une newsletter, identifiant / mot de passe). Dans ce cas l'élément visuel est facultatif.</p><p>Le critère est également applicable si la majorité des champs d'un formulaire est obligatoire, à l'exception de quelques champs optionnels. Il est alors possible d'identifier visuellement les champs optionnels.</p>",
		"group": "Formulaire",
		"moreInfo": "https://a11y-guidelines.orange.com/fr/web/developper/formulaires/#rendre-accessibles-les-champs-de-formulaire",
		"priority": "P1",
		"resultatTest": "nt",
		"goodPractice": false
	},
	{
		"themes": "Formulaire",
		"title": "Un attribut <code>autocomplete</code> est-il présent pour les champs de saisie destinés à contenir des informations sur l'utilisateur&nbsp;?",
		"ID": "testID-012",
		"IDorigin": "testID-012",
		"wcag": [
			"1.3.5 AA"
		],
		"verifier": "<ul><li>pour les champs de saisie destinés à contenir une information sur l'utilisateur (nom, adresse…), vérifier la présence de l'attribut <code>autocomplete</code></li><li>la valeur indiquée pour l'attribut <code>autocomplete</code> est pertinente (<a href='https://www.w3.org/TR/WCAG22/#input-purposes' target='_blank' aria-label='liste exhaustive des valeurs autorisées (nouvelle fenêtre)'>liste exhaustive des valeurs autorisées</a>) au regard du type d'information attendue</li></ul>",
		"group": "Formulaire",
		"moreInfo": "https://a11y-guidelines.orange.com/fr/web/developper/formulaires/#rendre-accessibles-les-champs-de-formulaire",
		"priority": "P3",
		"resultatTest": "nt",
		"goodPractice": false
	},
	{
		"themes": "Formulaire",
		"title": "Les champs en erreur sont-ils identifiables et l'erreur est-elle décrite sous forme de texte&nbsp;?",
		"ID": "testID-006",
		"IDorigin": "testID-006",
		"wcag": [
			"3.3.1 A"
		],
		"verifier": "Vérifier qu'un message d'erreur sous forme de texte visible est présent et qu'on identifie spécifiquement chaque champ en erreur.",
		"exception": "Le critère est non-applicable si cela constitue une risque potentiel de sécurité.",
		"complement": "<p>Ce critère n'impose aucune méthode particulière d'affichage des erreurs. Selon la situation, il peut être plus judicieux d'indiquer toutes les erreurs au début ou avant un formulaire. Dans d'autres cas, il peut être plus judicieux d'afficher les erreurs directement, avec des messages d'erreur à côté des champs concernés. Les erreurs peuvent également être répertoriées dans une alerte ou une boîte de dialogue.</p><p><strong>Attention&nbsp;:</strong>La pertinence (<abbr>WCAG</abbr> 3.3.3 Error suggestion) du texte de l'erreur est à évaluer au niveau de la question&nbsp;: https://la-va11ydette.orange.com/?list=wcag-web&lang=fr#headingtestID-007 </p>",
		"group": "Formulaire",
		"moreInfo": "https://a11y-guidelines.orange.com/fr/web/developper/formulaires/#detecter-identifier-les-erreurs-et-suggerer-des-corrections",
		"priority": "P1",
		"resultatTest": "nt",
		"goodPractice": false
	},
	{
		"themes": "Formulaire",
		"title": "Les messages d'erreur et les suggestions sont-ils explicites&nbsp;?",
		"ID": "testID-007",
		"IDorigin": "testID-007",
		"wcag": [
			"3.3.1 A"
		],
		"verifier": "<ul><li>Vérifier que les messages d'erreur énoncent clairement la nature de l'erreur (exemple&nbsp;: champ téléphone obligatoire, format de l'email invalide…).</li><li> Et que, si besoin, les suggestions de correction aident à la correction des erreurs.</li>",
		"exception": "Le critère est non applicable lorsqu'il est impossible de faire une suggestion ou que l'on ne peut donner de suggestion pour des raisons de sécurité ou parce qu'il s'agit d'une fonctionnalité essentielle.",
		"group": "Formulaire",
		"moreInfo": "https://a11y-guidelines.orange.com/fr/web/developper/formulaires/#detecter-identifier-les-erreurs-et-suggerer-des-corrections",
		"priority": "P2",
		"resultatTest": "nt",
		"goodPractice": false
	},
	{
		"themes": "Formulaire",
		"title": "Si une même information est demandée plusieurs fois à l'utilisateur dans un même processus ou session, sa saisie manuelle n'est pas requise plus d'une fois ?",
		"ID": "testID-079",
		"IDorigin": "testID-079",
		"wcag": [
			"3.3.7 A"
		],
		"verifier": "<p>Dans un formulaire et au cours d'un même processus ou session, un système de remplissage automatique des informations déjà fournies doit être proposé à l'utilisateur pour restituer une information préalablement saisie. L'autocomplétion du navigateur n'est pas jugé suffisante.</p><p>Le critère est également conforme pour les exceptions suivantes :</p><ul><li>Une activité (exemple : jeu de mémoire) où saisir à nouveau une information est essentiel</li><li>Des informations de sécurité comme la double saisie d'un mot de passe créé par l'utilisateur</li><li>Des informations préalablement renseignées qui ne sont plus valides</li></ul>",
		"complement":"<h5>Complément d'information</h5><p>Exemples de mécanismes valides : alimentation automatique, choix dans un sélecteur déroulant, copier-coller depuis une zone, case à cocher pour reprendre des données préalablement saisies (adresse de facturation égale adresse de livraison)</p>",
		"group": "Formulaire",
		"moreInfo": "",
		"priority": "P3",
		"resultatTest": "nt",
		"wcag22": true,
		"goodPractice": false
	},
	{
		"themes": "Formulaire",
		"title": "L'utilisateur peut-il s'authentifier avec un nom d'utilisateur et un mot de passe sans utiliser de test s'appuyant sur des fonctions cognitives&nbsp;?",
		"ID": "testID-086",
		"IDorigin": "testID-086",
		"wcag": [
			"3.3.8 AA",
			"3.3.9 AAA"
		],
		"verifier": "<p>Vérifier qu'aucune étape d'un processus d'authentification par un nom d'utilisateur et un mot de passe ne repose sur un test cognitif, sauf si cette étape fournit :</p><ul><li>une autre méthode d'authentification</li><li>une aide pour l'utilisateur</li><li>un test cognitif qui consiste à reconnaitre des objets (images, vidéo, audio)</li><li>un test cognitif qui consiste à identifier le contenu personnel non textuel (images, vidéo, audio) que l'utilisateur a fourni préalablement au site Web</li></ul><p>La mémorisation d'un nom utilisateur et d'un mot de passe étant un test cognitif, il faut pour satisfaire le critère que la fonction de copier-coller soit autorisée sur ces champs ou que le nom d'utilisateur et le mot de passe soient remplis automatiquement (exemple : gestionnaire de mot de passe).</p>",
		"complement": "<h5>Complément d'information</h5><p>Un test cognitif est une tâche qui oblige l'utilisateur à mémoriser, manipuler ou transcrire des informations.</p><p>Dans le processus d'authentification, ne pas utiliser de méthode basée sur :</p><ul><li>la reconnaissance d'objets</li><li>l'identification d'un contenu personnel non textuel (images, vidéo, audio) préalablement fourni au site web par l'utilisateur.</li></ul><p>Dans le cas d'un mot de passe masqué, offrir la possibilité d'afficher en clair les caractères saisis.</p>",
		"group": "Formulaire",
		"moreInfo": "https://a11y-guidelines.orange.com/fr/web/designer/formulaires/#authentification-accessible",
		"priority": "P0",
		"resultatTest": "nt",
		"wcag22": true,
		"goodPractice": false
	},
	{
		"themes": "Formulaire",
		"title": "L'utilisateur peut-il s'authentifier avec un système à double facteur (2FA) sans utiliser de test s'appuyant sur des fonctions cognitives&nbsp;?",
		"ID": "testID-087",
		"IDorigin": "testID-087",
		"wcag": [
			"3.3.8 AA",
			"3.3.9 AAA"
		],
		"verifier": "<p>Vérifier qu'aucune étape d'un processus d'authentification avec un système à double facteur (2FA) ne repose sur un test cognitif sauf si cette étape permet au choix :</p><ul><li>à l'utilisateur :<ul><li>de coller le code de vérification</li><li>de brancher une clé USB où il lui suffit d'appuyer sur un bouton pour entrer un jeton valable pendant une durée limitée</li><li>de scanner un QR code par une application présente sur son appareil pour confirmer son identité</li><li>de recevoir une notification sur son appareil qui lui permet de confirmer son identité (par exemple, par un code PIN défini par l'utilisateur, une empreinte digitale, une reconnaissance faciale)</li></ul></li><li>à un agent utilisateur de renseigner automatiquement le code de vérification</li></ul><p>Le processus d'authentification proposé répond au critère 3.3.8 ou 3.3.9, c'est-à-dire qu'il ne repose pas sur un test cognitif (ex : mémoriser ou saisir un identifiant et mot de passe qui doivent être recopiés sans erreur, reproduire un schéma gestuel sur un écran tactile, résoudre une énigme)</p>",
		"complement": "<h5>Complément d'information</h5><p>Un test cognitif est une tâche qui oblige l'utilisateur à mémoriser, manipuler ou transcrire des informations.</p><p>Dans le processus d'authentification, ne pas utiliser de méthode basée sur :</p><ul><li>la reconnaissance d'objets</li><li>l'identification d'un contenu personnel non textuel (images, vidéo, audio) préalablement fourni au site web par l'utilisateur.</li></ul><p>Dans le cas d'un mot de passe masqué, offrir la possibilité d'afficher en clair les caractères saisis.</p>",
		"group": "Formulaire",
		"moreInfo": "https://a11y-guidelines.orange.com/fr/web/designer/formulaires/#authentification-accessible",
		"priority": "P0",
		"resultatTest": "nt",
		"wcag22": true,
		"goodPractice": false
	},
	{
		"themes": "Formulaire",
		"title": "Lorsque l'authentification inclut un CAPTCHA, une alternative qui ne repose pas sur un test cognitif est-elle proposée&nbsp;?",
		"ID": "testID-088",
		"IDorigin": "testID-088",
		"wcag": [
			"3.3.8 AA",
			"3.3.9 AAA"
		],
		"verifier": "<p>Vérifier que lorsqu'un parcours d'authentification inclut un CAPTCHA, une méthode alternative qui ne repose pas sur un test cognitif (retenir, recopier un mot, reconnaitre une image donnée par le site web) est proposée. Note : la reconnaissance d'objets ou l'identification d'un contenu personnel non textuel est tolérée.</p><ul><li>S'il s'agit d'une authentification à double facteur qui se fait par la reconnaissance d'un contenu personnel non textuel, les conditions de sécurité doivent permettre d'éviter à une tierce personne de deviner quelle est l'image à reconnaitre.</li><li>Dans le cas où l'utilisateur est obligé de transcrire du texte (ex : création pour la première fois d'un mot de passe qui sera ensuite enregistré dans un logiciel de gestion de mot de passe), la possibilité de montrer les caractères saisis doit être proposée.</li></ul>",
		"complement": "<h5>Complément d'information</h5><p>Un test cognitif est une tâche qui oblige l'utilisateur à mémoriser, manipuler ou transcrire des informations.</p><p>Dans le processus d'authentification, ne pas utiliser de méthode basée sur :</p><ul><li>la reconnaissance d'objets</li><li>l'identification d'un contenu personnel non textuel (images, vidéo, audio) préalablement fourni au site web par l'utilisateur.</li></ul><p>Dans le cas d'un mot de passe masqué, offrir la possibilité d'afficher en clair les caractères saisis.</p>",
		"group": "Formulaire",
		"moreInfo": "https://a11y-guidelines.orange.com/fr/web/designer/formulaires/#authentification-accessible",
		"priority": "P0",
		"resultatTest": "nt",
		"wcag22": true,
		"goodPractice": false
	},
	{
		"themes": "Formulaire",
		"title": "Pour chaque formulaire sensible, l'utilisateur a-t-il le contrôle de ses données&nbsp;?",
		"ID": "testID-009",
		"IDorigin": "testID-009",
		"wcag": [
			"3.3.4 AA"
		],
		"verifier": "<p>Pour les formulaires avec&nbsp;:<ul><li>modification ou suppression de données propres à l'utilisateur</li><li>transmission de réponse à un test ou un examen</li><li>conséquences financières (achat en ligne) ou juridiques (validation de conditions générales d'utilisation)</li></ul></p><p>Vérifier qu'une de ces conditions est vraie&nsp;: <ul><li>La soumission de données est réversible</li><li>Les données saisies par l'utilisateur sont vérifiées afin de détecter d'éventuelles erreurs de saisie et l'utilisateur a la possibilité de les corriger</li><li>Un mécanisme est disponible pour vérifier, confirmer et corriger les informations avant de finaliser la soumission (par exemple, la validation est explicite avec une case à cocher).</li></ul></p>",
		"group": "Formulaire",
		"moreInfo": "https://a11y-guidelines.orange.com/fr/web/developper/formulaires/#detecter-identifier-les-erreurs-et-suggerer-des-corrections",
		"priority": "P2",
		"resultatTest": "nt",
		"goodPractice": false
	},
	{
		"themes": "Formulaire",
		"title": "L'élément de formulaire est-il lié programmatiquement à son étiquette et, si présent, au message d'erreur&nbsp;?",
		"ID": "testID-new1.3.1",
		"IDorigin": "testID-new1.3.1",
		"wcag": [
			"1.3.1 AA"
		],
		"verifier": "<p>Vérifier que&nbsp;:<ul><li>le <code>label</code> possède un attribut <code>for</code> référençant l'<code>id</code> de l'élément de formulaire à associer</li><li>le <code>label</code> est implicite</li><li>l'étiquette visible est référencée par un attribut <code>aria-labelledby</code> porté par l'élément de formulaire</li><li>Le nom accessible est donné par un attribut title.</li></ul></p><p>Le format de données et/ou la mention obligatoire peuvent être liés via un attribut <code>aria-describedby</code>.</p><p>Pour les messages d'erreurs, vérifier que&nbsp;:<ul><li>l'élément de formulaire référence, via <code>aria-labelledby</code> ou <code>aria-describedby</code>, l'<code>id</code> du/des message(s) d'erreur.</li><li>Si le message d'erreur est ajouté dans le <code>label</code> celui-ci doit aussi être lié à l'élément de formulaire.</li></p>",
"exception": "Le critère est non applicable lorsqu'il est impossible de faire une suggestion ou que l'on ne peut donner de suggestion pour des raisons de sécurité ou parce que c'est une fonctionnalité essentielle.",
		"group": "Formulaire",
		"moreInfo": "https://a11y-guidelines.orange.com/fr/web/developper/formulaires/#detecter-identifier-les-erreurs-et-suggerer-des-corrections",
		"priority": "P3",
		"resultatTest": "nt",
		"goodPractice": false
	},
	{
		"themes": "Formulaire",
		"title": "Les éléments de formulaire obligatoires sont-ils programmatiquement identifiables&nbsp;?",
		"ID": "testID-new",
		"IDorigin": "testID-new",
		"wcag": [
			"1.3.1 A"
		],
		"verifier": "<p>Vérifier que l'une des techniques suivantes est utilisée&nbsp;:<ul><li>L'étiquette de l'lément de formulaire mentionne l'aspect obligatoire directement dans le nom ou la description accessible</li><li>Présence de l'attribut <code>required</code> ou <code>aria-required='true'.</code></li></ul></p>",
		"exception": "Le critère est non-applicable si le caractère obligatoire d'un champ est évident et pour lequel l'identification programmatique devient donc facultative (ex: champ de recherche, inscription à une newsletter, identifiant / mot de passe).",
		"group": "Formulaire",
		"moreInfo": "https://a11y-guidelines.orange.com/fr/web/developper/formulaires/#rendre-accessibles-les-champs-de-formulaire",
		"priority": "P1",
		"resultatTest": "nt",
		"goodPractice": false
	},
	{
		"themes": "Contenu textuel",
		"title": "Le titre de la page est-il pertinent&nbsp;?",
		"ID": "testID-017",
		"IDorigin": "testID-017",
		"wcag": [
			"2.4.2 A"
		],
		"verifier": "<ul><li>vérifier que le titre de page est renseigné,</li><li>vérifier que le titre de page est unique et qu'il permet à l'utilisateur de comprendre le contexte de la page.</li><li>vérifier que, lorsque le contexte de la page est modifié asynchroniquement (sans recharger la page&nbsp;: résultats de recherche, validation ou erreur de formulaire, modification dynamique du contenu…), l'utilisateur est notifié par modification du titre</li></ul>",
		"moreInfo": "https://a11y-guidelines.orange.com/fr/web/developper/contenu-textuel/#donner-un-titre-aux-pages",
		"priority": "P1",
		"resultatTest": "nt",
		"goodPractice": false
	},
	{
		"themes": "Contenu textuel",
		"title": "L'information est-elle structurée par l'utilisation appropriée de titres de niveaux&nbsp;?",
		"ID": "testID-010",
		"IDorigin": "testID-010",
		"wcag": [
			"1.3.1 A"
		],
		"verifier": "<ul><li>vérifier que les éléments qui ressemblent visuellement à des titres sont bien balisés comme tels (<code>hn</code>, <code>role='heading'</code>)</li><li>vérifier que les niveaux de titres sont hiérarchisés de manière logique (sans obligation stricte d'un seul saut de niveau de titre)</li></ul>",
		"moreInfo": "https://a11y-guidelines.orange.com/fr/web/developper/contenu-textuel/#donner-des-titres-aux-rubriques",
		"exception":"Le critère est non-applicable si aucun titre n'est présent.",
		"priority": "P1",
		"resultatTest": "nt",
		"goodPractice": false
	},
	{
		"themes": "Contenu textuel",
		"title": "L'information est-elle structurée par l'utilisation de titres pertinents&nbsp;?",
		"ID": "testID-083",
		"IDorigin": "testID-083",
		"wcag": [
			"2.4.6 AA"
		],
		"verifier": "<ul><li>Les titres de niveaux doivent être pertinents et aider à comprendre le contenu de la page.</li><li>Les titres doivent décrire précisément la section de contenu qu'ils présentent.</li></ul>",
		"moreInfo": "https://a11y-guidelines.orange.com/fr/web/developper/contenu-textuel/#donner-des-titres-aux-rubriques",
		"exception":"Le critère est non-applicable si aucun titre n'est présent.",
		"priority": "P1",
		"resultatTest": "nt",
		"goodPractice": false
	},
	{
		"themes": "Contenu textuel",
		"title": "Des titres de niveaux sont-ils présents pour organiser le contenu&nbsp;?",
		"ID": "testID-084",
		"IDorigin": "testID-084",
		"wcag": [
			"2.4.10 AAA"
		],
		"verifier": "<p>Toutes les sections de la page doivent avoir un titre qui les présentes.</p>",
		"moreInfo": "https://a11y-guidelines.orange.com/fr/web/developper/contenu-textuel/#donner-des-titres-aux-rubriques",
		"priority": "P1",
		"resultatTest": "nt",
		"goodPractice": true
	},
	{
		"themes": "Contenu textuel",
		"title": "Le contenu est-il structuré sémantiquement&nbsp;?",
		"ID": "testID-068",
		"IDorigin": "testID-068",
		"wcag": [
			"1.3.1 A"
		],
		"verifier": "<ul><li>du contenu n'est pas isolé sans être entouré d'une balise sémantique (notamment p) pour en comprendre le sens ou sa relation au reste de la structure du document</li><li>les citations longues (paragraphe) sont balisées avec des <code>blockquote</code></li><li>les citations courtes sont balisées avec des <code>q</code>.</li><li>les informations présentées visuellement sous forme de liste sont codées en tant que liste HTML</li><li>les listes d'items non-ordonnés sont balisées avec des <code>ul</code> / <code>li</code></li><li>les listes d'items ordonnés sont balisées avec des <code>ol</code> / <code>li</code></li><li>les listes de définitions sont balisées avec des <code>dl</code> / <code>dt</code> / <code>dd</code></li><li>lien (<code>&lt;a&gt;</code>), pour tout changement de contexte via chargement d'une nouvelle URL</li><li>bouton (<code>&lt;button&gt;</code>, <code>&lt;input type='button/submit'&gt;</code>), pour tout déclenchement d'action,  validation ou sélection</li></ul><p>Attention&nbsp;: les <code>role</code> ARIA peuvent modifier la sémantique des balises HTML et pas l'interactivité, vérifier qu'ils sont utilisés de manière accessible</p>",
		"moreInfo": "https://a11y-guidelines.orange.com/fr/web/developper/contenu-textuel/#respecter-la-semantique-html",
		"priority": "P2",
		"resultatTest": "nt",
		"goodPractice": false
	},
	{
		"themes": "Contenu textuel",
		"title": "La langue principale est-elle définie et correspond-elle à la langue principale du document&nbsp;?",
		"ID": "testID-021",
		"IDorigin": "testID-021",
		"wcag": [
			"3.1.1 A"
		],
		"verifier": "<ul><li>vérifier la présence d'un attribut <code>lang</code> (attention l'attribut <code>xml:lang</code> ne permet pas de valider le test)</li><li>la valeur de l'attribut <code>lang</code> doit correspondre à la langue principale de la page</li></ul>",
		"moreInfo": "https://a11y-guidelines.orange.com/fr/web/developper/contenu-textuel/#indiquer-la-langue-principale-et-les-changements-de-langue",
		"priority": "P3",
		"resultatTest": "nt",
		"goodPractice": false
	},
	{
		"themes": "Contenu textuel",
		"title": "Les changements de langues sont-ils indiqués&nbsp;?",
		"ID": "testID-022",
		"IDorigin": "testID-022",
		"wcag": [
			"3.1.2 AA"
		],
		"verifier": "<p>Vérifier qu'un attribut <code>lang</code> est renseigné pour les mots et expressions en langue étrangère.</p><p>Pour les mots ou expressions en langue étrangère passés dans l'usage courant (exemples&nbsp;: newsletter, week-end) ou les noms propres (exemples&nbsp;: Google, Apple...), il n'est pas nécessaire d'indiquer de changement de langue.</p>",
		"moreInfo": "https://a11y-guidelines.orange.com/fr/web/developper/contenu-textuel/#indiquer-la-langue-principale-et-les-changements-de-langue",
		"priority": "P3",
		"resultatTest": "nt",
		"goodPractice": false
	},
	{
		"themes": "Contenu textuel",
		"title": "Les tableaux sont-ils correctement structurés&nbsp;?",
		"ID": "testID-023",
		"IDorigin": "testID-023",
		"wcag": [
			"1.3.1 A"
		],
		"verifier": "<p>Si le tableau est un tableau de présentation, enlever toute balise ou attribut à valeur sémantique de tableau (<code>caption, summary, th, scope, headers</code>…) et mettre un attribut <code>role='presentation'</code> dans la balise <code>table</code> et donc ce tableau devient non applicable pour ce critère.</p><p>Si le tableau est un tableau de données&nbsp;:</p><ol><li>Si un titre de tableau est présent, vérifier que celui-ci est lié de manière programmatique au tableau par l'une des techniques ci-dessous&nbsp; <br>* Attention&nbsp;: en complément la technique doit être validée par un test fonctionnel sur le ou les environnements (navigateur / aide technique) pris en compte dans l'audit.<ul><li>Balise <code>caption</code></li><li><code>aria-label</code> sur l'élément table *</li><li><code>aria-labelledby</code> sur l'élément pointant vers l'<code>id</code> du titre *</li><li>Title sur l'élément table *</li></ul></li><li>Si un titre de tableau est présent, vérifier que celui-ci est pertinent <ul><li>Le titre n'est pas vide</li><li>Le titre permet de comprendre la nature des données présentées dans le tableau</li></ul></li><li>Si un résumé de tableau est présent, vérifier que celui-ci est lié de manière programmatique par l'une des techniques ci-dessous&nbsp;:<ul><li><strong>HTML5</strong>&nbsp;: présence d'un résumé, si nécessaire en masquage accessible ou <code>display:none</code>, lié au tableau via un <code>aria-describedby</code></li><li><strong>Version antérieure&nbsp;:</strong> résumé présent dans un attribut <code>summary</code></li></ul></li><li>Si un résumé est présent, vérifier que celui-ci est&nbsp;: <ul><li>pertinent</li><li>différent du titre</li></ul></li><li>Les entêtes <code>th</code> ne doivent pas être vides</li><li><strong>Tableau à simple entête</strong> (une ligne, ou une colonne d'entête uniquement), vérifier la présence d'entêtes (<code>th</code>)</li><li><strong>Tableau à double entêtes</strong> (une ligne et une colonne d'entête)&nbsp;:<ul><li>Pour chaque <code>th</code> vérifier la présence d'un attribut <code>scope='col'</code> pour les entêtes de colonnes,</li><li>et la présence d'un <code>scope='row'</code> pour les entêtes de lignes</li></ul></li><li><strong>Tableaux complexes</strong> (entêtes multiples et irrégulières), vérifier la présence d'entêtes <code>th</code> et / ou d'attributs <code>id</code> et <code>headers</code></li></ol>",
		"moreInfo": "https://a11y-guidelines.orange.com/fr/web/developper/contenu-textuel/#structurer-les-tableaux-de-donnees",
		"priority": "P2",
		"resultatTest": "nt",
		"goodPractice": false
	},
	{
		"themes": "Contenu non-textuel",
		"title": "Les images possèdent-elles un texte de remplacement pertinent&nbsp;?",
		"ID": "testID-013",
		"IDorigin": "testID-013",
		"wcag": [
			"1.1.1 A"
		],
		"verifier": "<ul><li>vérifier le nom accessible des <code>img</code>, <code>area</code>, <code>canvas</code>, <code>input</code> et <code>object type='image'</code>, <code>SVG</code>, <code>role='img'</code></li><li>vérifier que le nom accessible n'est pas défini par le <code>title</code></li><li>pour les images décoratives, vérifier que l'attribut <code>alt</code> est vide ou nul, ou que l'image porte un <code>role='presentation'</code> ou <code>'none'</code> ou encore un attribut <code>aria-hidden='true'</code></li><li>vérifier pour les images complexes qu'une alternative est fournie par un contenu adjacent</li><li>vérifier qu'il n'existe pas d'image portant de l'information intégré en CSS (<code>background-image</code>) </li><li>vérifier pour les contenus audios et videos qu'une alternative est fournie par un contenu adjacent</li></ul>",
		"moreInfo": "https://a11y-guidelines.orange.com/fr/web/developper/contenu-non-textuel/#fournir-un-equivalent-textuel-pour-les-images-et-les-cadres",
		"priority": "P0",
		"resultatTest": "nt",
		"goodPractice": false
	},
	{
		"themes": "Contenu non-textuel",
		"title": "Aucune image ne présente du texte qui pourrait être mis en forme via CSS&nbsp;?",
		"ID": "testID-062",
		"IDorigin": "testID-062",
		"wcag": [
			"1.4.5 AA"
		],
		"verifier": "<p>Vérifier que des images (<code>img</code>, <code>input</code> / <code>object type='image'</code>, <code>embed</code>, <code>canvas</code>) ne sont pas utilisées pour présenter du texte.</p><p>Le critère est conforme pour les exceptions suivantes :</p><ul><li>SVG (vrai texte)</li><li>cas particuliers (ex&nbsp;: logo, CAPTCHA, dénomination commerciale)</li><li>l'élément est nécessaire</li><li>l'image est visuellement modifiable par l'utilisateur</li></ul>",
		"exception": "Non applicable si aucune image ne contient de texte",
		"moreInfo": "https://a11y-guidelines.orange.com/fr/web/developper/contenu-non-textuel/#fournir-un-equivalent-textuel-pour-les-images-et-les-cadres",
		"priority": "P3",
		"resultatTest": "nt",
		"goodPractice": false
	},
	{
		"themes": "Contenu non-textuel",
		"title": "Chaque image CAPTCHA a-t-elle une alternative&nbsp;?",
		"ID": "testID-014",
		"IDorigin": "testID-014",
		"wcag": [
			"1.1.1 A"
		],
		"verifier": "<p>Vérifier que le nom accessible de chaque image CAPTCHA communique l'objectif de l'image et non son contenu (ex&nbsp;: «&nbsp;CAPTCHA (image anti-spam)&nbsp;» ).</p>",
		"group": "Captcha",
		"moreInfo": "https://a11y-guidelines.orange.com/fr/web/developper/contenu-non-textuel/#eviter-les-captcha",
		"priority": "P2",
		"resultatTest": "nt",
		"goodPractice": false
	},
	{
		"themes": "Contenu non-textuel",
		"title": "Si un CAPTCHA est utilisé, une alternative est-elle prévue pour les utilisateurs malvoyants, non-voyants et malentendants&nbsp;?",
		"ID": "testID-015",
		"IDorigin": "testID-015",
		"wcag": [
			"1.1.1 A"
		],
		"verifier": "<p>Vérifier que pour tout CAPTCHA uniquement visuel ou sonore, une alternative ci-dessous est proposée en complément&nbsp;: </p><ul><li>CAPTCHA audio et visuel</li><li>des tests logiques (question dont la réponse est évidente, test mathématique simple…)</li><li>il existe une autre solution d'accès à la fonctionnalité sécurisée par le CAPTCHA</li></ul>",
		"group": "Captcha",
		"moreInfo": "https://a11y-guidelines.orange.com/fr/web/developper/contenu-non-textuel/#eviter-les-captcha",
		"priority": "P2",
		"resultatTest": "nt",
		"goodPractice": false
	},
	{
		"themes": "Contenu non-textuel",
		"title": "Chaque contenu cryptique (art ASCII, émoticône, syntaxe cryptique) possède-t-il une alternative pertinente&nbsp;?",
		"ID": "testID-016",
		"IDorigin": "testID-016",
		"wcag": [
			"1.1.1 A"
		],
		"verifier": "<ul><li>vérifier qu'une alternative est fournie sous forme de texte <br>exemples&nbsp;: <ul><li>utilisation d'une balise <code>abbr</code> avec l'attribut <code>title</code></li><li>utilisation d'un contenu adjacent </li></ul></li><li>vérifier que l'alternative est pertinente</li></ul>",
		"moreInfo": "https://a11y-guidelines.orange.com/fr/web/developper/contenu-non-textuel/#fournir-un-equivalent-textuel-pour-les-images-et-les-cadres",
		"priority": "P3",
		"resultatTest": "nt",
		"goodPractice": false
	},
	{
		"themes": "Contenu non-textuel",
		"title": "Chaque cadre a-t-il un titre pertinent&nbsp;?",
		"ID": "testID-065",
		"IDorigin": "testID-065",
		"wcag": [
			"4.1.2 A"
		],
		"verifier": "<p>Vérifier que la valeur des attributs <code>title</code> décrit le contenu ou la fonction de <code>iframe</code> ou <code>frame</code>.</p>",
		"exception": "Critère non-applicable pour les cas suivants :<ul><li>Une <code>frame</code> ou <code>iframe</code> non-informative masquée convenablement n'a pas besoin de <code>title</code>.</li><li>Un <code>title</code> n'est pas requis si le contenu de l'<code>iframe</code> n'est pas distinct du contenu environnant et n'a pas d'élément tabulable à l'intérieur, et qu'on a ajouté <code>tabindex='- 1'</code> sur l'<code>iframe</code> afin qu'il ne reçoive pas le focus.</li></ul>",
		"moreInfo": "https://a11y-guidelines.orange.com/fr/web/developper/contenu-non-textuel/#fournir-un-equivalent-textuel-pour-les-images-et-les-cadres",
		"priority": "P3",
		"resultatTest": "nt",
		"goodPractice": false
	},
	{
		"themes": "Couleurs et contrastes",
		"title": "Le contraste entre la couleur du texte et la couleur de son arrière-plan est-il suffisamment élevé (hors cas particuliers)&nbsp;?",
		"ID": "testID-024",
		"IDorigin": "testID-024",
		"wcag": [
			"1.4.3 AA"
		],
		"verifier": "<ul><li>vérifier que le contraste est suffisant pour comprendre l'information portée par tous les textes et les textes sous forme d'images.<ul><li><strong>Pour texte standard&nbsp;:</strong> <ul><li>Taille inférieure à <code>24 px CSS</code>&nbsp;: contraste de 4,5:1</li><li>Taille supérieure ou égale à <code>24 px CSS</code>&nbsp;: contraste de 3:1</li></ul></li><li><strong>Pour les textes gras</strong> <ul><li>Taille inférieure à <code>18,5 px CSS</code>&nbsp;: contraste de 4,5:1</li><li>Taille supérieure ou égale à <code>18,5 px CSS</code>&nbsp;: contraste de 3:1</li></ul></li></ul></li><li>vérifier que les liens non-soulignés ont un rapport de contraste suffisant avec le texte environnant</li><li>vérifier que le rapport de contraste est suffisant au survol de la souris et au focus</li></ul>",
		"exception":"Le critère n'est pas applicable pour les logos, les éléments textuels purement décoratifs ou les textes d'éléments inactifs.",
		"moreInfo": "https://a11y-guidelines.orange.com/fr/web/developper/couleurs-et-contrastes/#assurer-un-contraste-suffisant-entre-les-couleurs-de-premier-plan-et-de-fond",
		"priority": "P1",
		"resultatTest": "nt",
		"goodPractice": false
	},
	{
		"themes": "Couleurs et contrastes",
		"title": "Pour chaque texte dont la couleur est définie par la propriété CSS <code>color</code>, la propriété <code>background-color</code> est-elle également renseignée et inversement&nbsp; ?",
		"ID": "testID-025",
		"IDorigin": "testID-025",
		"wcag": [
			"1.4.3 AA"
		],
		"verifier": "<ul><li>Si la couleur du texte est redéfinie (<code>color</code>), la couleur du fond doit l'être également (<code>background-color</code>).</li><li>Si la couleur du fond est redéfinie (<code>background-color</code>), la couleur du texte doit l'être également (<code>color</code>).</li><li>Si une image de fond est utilisée pour un élément contenant du texte (<code>background-image</code>), la couleur du fond doit être définie (<code>background-color</code>).</li></ul>",
		"complement": "<h5>Complément d'information</h5><ul><li>Ces propriétés peuvent être appliquées directement sur un élément ou héritées d'un parent.</li><li> Pour tester, le plus simple est de modifier les couleurs par défaut de votre navigateur. Dans Firefox, aller dans \"Paramètres > Langue et apparence > Couleurs\", ouvrir \"Gérer les couleurs...\" et dans \"Texte et arrière-plan\", personnaliser les couleurs \"Texte\" et \"Arrière-plan\" afin de bien les identifier, puis décocher \"Utiliser les couleurs systèmes\". Si, dans le page, une seule de ces couleurs apparait sans que l'autre n'apparaisse dans un même élément, le test est non conforme</li><li>Dans le cas d'un texte sur une image de fond déclarée en \"background-image\", il est possible de vérifier en utilisant l'extension Web Developer puis dans le menu \"Images\" > \"Hide background images\", repérer les textes dont le fond a disparu et vérifier qu'ils sont lisibles et suffisamment contrastés.</li></ul>",
		"moreInfo": "",
		"priority": "P2",
		"resultatTest": "nt",
		"goodPractice": false
	},
	{
		"themes": "Couleurs et contrastes",
		"title": "Les couleurs utilisées dans les composants d'interface ou les éléments graphiques porteurs d'informations sont-elles suffisamment contrastées&nbsp;?",
		"ID": "testID-026",
		"IDorigin": "testID-026",
		"wcag": [
			"1.4.11 AA"
		],
		"verifier": "<p>Vérifier que les graphiques, les icônes et les composants interactifs graphiques ont un contraste minimum de 3:1 pour transmettre l'information.</p>",
		"exception": "Le critère n'est pas applicable pour les cas suivants:<ul><li>les logos</li><li>si un texte, comme un label ou un tableau de données, apporte la même information que l'icône ou le graphique</li><li>si le manque de contraste de l'image n'empêche pas la compréhension du contenu ou de sa fonction</li><li>le manque de contraste est nécessaire pour convoyer l'information</li><li>le composant est inactif</li><li>l'affichage par défaut de l'agent utilisateur n'est pas modifié</li></ul>",
		"moreInfo": "https://a11y-guidelines.orange.com/fr/web/developper/couleurs-et-contrastes/#assurer-un-contraste-suffisant-entre-les-couleurs-de-premier-plan-et-de-fond",
		"priority": "P1",
		"resultatTest": "nt",
		"goodPractice": false
	},
	{
		"themes": "Couleurs et contrastes",
		"title": "L'information est-elle également transmise à l'utilisateur par un autre moyen que par la couleur&nbsp;?",
		"ID": "testID-027",
		"IDorigin": "testID-027",
		"wcag": [
			"1.4.1 A"
		],
		"verifier": "<p>Vérifier que la couleur n'est pas le seul moyen de convoyer une information&nbsp;:</p><ul><li>l'information peut également être obtenue par un texte</li><li>au moins un autre moyen visuel est disponible pour obtenir la même information (exemples&nbsp;: des icônes qui utilisent des couleurs, mais également des formes différentes)</li><li>les couleurs portant l'information sont bien différenciées selon leur teinte et leur luminosité (i.e le contraste entre les couleurs doit être supérieur à 3:1). Par exemple : vert clair et rouge foncé</li></ul><p>Cas particuliers des liens non soulignés dans du texte&nbsp;:</p><ul><li>le lien doit avoir un contraste de 3:1 avec le texte environnant</li> <li>et un indicateur, ne reposant pas sur la couleur, doit permettre de le distinguer lors de la prise de focus et au survol de la souris (exemple&nbsp;: souligné)</li></ul>",
		"exception":"Le critère est non-applicable pour les cas suivants :<ul><li>Les liens dont la nature est explicite, exemple des liens présent dans les zones de navigation (en-têtes et pieds de page, menu ou liste de liens…)</li><li>Si aucune information n'est portée par de la couleur</li></ul>",
		"moreInfo": "https://a11y-guidelines.orange.com/fr/web/developper/couleurs-et-contrastes/#ne-pas-utiliser-la-couleur-ou-linformation-sensorielle-comme-seule-source-dinformation",
		"priority": "P2",
		"resultatTest": "nt",
		"goodPractice": false
	},
	{
		"themes": "Couleurs et contrastes",
		"title": "L'information est-elle également transmise à l'utilisateur par un autre moyen qu'une caractéristique sensorielle&nbsp;?",
		"ID": "testID-051",
		"IDorigin": "testID-051",
		"wcag": [
			"1.3.3 A"
		],
		"verifier": "<p>Vérifier que l'information transmise par une caractéristique sensorielle (forme, taille, position, orientation, son) peut également être obtenue par un texte, une alternative ou un message explicite.</p><p><strong>Exemples de non-conformités&nbsp;:</strong></p><ul> <li>identification d'une information uniquement par sa position&nbsp;: \" pour aller à la page suivante appuyez sur le bouton à droite \", ou \" choisissez un des liens affichés au-dessus de l'image pour en savoir plus \"</li> <li>identification d'une information uniquement par sa forme visuelle ou un symbole graphique&nbsp;: \" Appuyez sur le bouton rond pour quitter \"</li></ul>",
		"exception":"Le critère est non-applicable si aucune information n'est portée par le son, l'orientation, la taille, la forme ou la position",
		"moreInfo": "https://a11y-guidelines.orange.com/fr/web/developper/couleurs-et-contrastes/#ne-pas-utiliser-la-couleur-ou-linformation-sensorielle-comme-seule-source-dinformation",
		"priority": "P2",
		"resultatTest": "nt",
		"goodPractice": false
	},
	{
		"themes": "Navigation générale",
		"title": "Le nom accessible des composants d'interface contient-il au minimum le libellé visible à l'écran&nbsp;?",
		"ID": "testID-011",
		"IDorigin": "testID-011",
		"wcag": [
			"2.5.3 A"
		],
		"verifier": "<p>Vérifier que le texte de l'étiquette affichée (le libellé textuel ou le texte de l'image visible à l'écran) est présent dans le nom accessible de ce composant (pour aller plus loin&nbsp;: <a href='https://a11y-guidelines.orange.com/fr/articles/le-nom-accessible-en-html/' target='_blank' title='Le nom accessible en HTML (nouvelle fenêtre)' aria-label='La nom accessible en HTML (nouvelle fenêtre)'>Le nom accessible en HTML</a></p>",
		"complement": "<p>Exemple&nbsp;: pour un lien «&nbsp;démarrer&nbsp;», mettre un <code>aria-label</code> «&nbsp;démarrer la lecture&nbsp;», mais pas «&nbsp;lancer la lecture&nbsp;»</p>",
		"exception":"Le critère est non-applicable si aucun composant d'interface n'a de libellé texte visible (exemple : icônes sans texte)",
		"moreInfo": "https://a11y-guidelines.orange.com/fr/web/developper/navigation-generale/#rendre-les-intitules-des-liens-et-des-boutons-accessibles",
		"priority": "P3",
		"resultatTest": "nt",
		"goodPractice": false
	},
	{
		"themes": "Navigation générale",
		"title": "Chaque libellé de lien est-il explicite, au minimum dans son contexte&nbsp;?",
		"ID": "testID-028",
		"IDorigin": "testID-028",
		"wcag": [
			"2.4.4 A"
		],
		"verifier": "<p>L'utilisateur doit savoir s'il souhaite suivre un lien avec, si besoin, le contexte pour en comprendre la destination.</p><ul><li>vérifier qu'il n'y a pas de libellés identiques pointant vers des destinations différentes</li><li>vérifier qu'il est possible de déterminer la destination d'un lien uniquement à partir de son nom accessible</li><li>si aucun des points précédents n'est respecté, vérifier que la cible d'un lien est au moins compréhensible grâce à son contexte.</li></ul>",
		"exception": "Le critère est non-applicable si le lien est ambigu pour tout utilisateur ou le contexte de la page ne permet pas de comprendre la destination du lien.",
		"complement": "<h5>Comment déterminer le contexte de lien&nbsp;: </h5><p>Le contexte du lien représente les informations supplémentaires qui permettent de comprendre son intitulé. Vérifier que ces informations supplémentaires sont positionnées soit&nbsp;:</p><ul><li>dans la même phrase</li><li>dans le même paragraphe (<code>p</code>)</li><li>dans le même élément de liste (<code>li</code>)</li><li>dans la même cellule de tableau (<code>td</code>)</li><li>dans la cellule d'entête du tableau (<code>th</code>), associée à la cellule du lien (<code>td</code>)</li></ul>",
		"moreInfo": "https://a11y-guidelines.orange.com/fr/web/developper/navigation-generale/#rendre-les-intitules-des-liens-et-des-boutons-accessibles",
		"priority": "P3",
		"resultatTest": "nt",
		"goodPractice": false
	},
	{
		"themes": "Navigation générale",
		"title": "Chaque libellé de lien est-il explicite hors contexte&nbsp;?",
		"ID": "testID-070",
		"IDorigin": "testID-070",
		"wcag": [
			"2.4.9 AAA"
		],
		"verifier": "<p>L'utilisateur doit pouvoir comprendre la destination des liens même sortis de leur contexte.</p><ul><li>vérifier qu'il est possible de déterminer l'action ou la destination d'un lien, uniquement à partir de son nom accessible</li><li>vérifier qu'il n'y a pas de libellés identiques pointant vers des destinations différentes</li></ul>",
		"exception": "Le critère est non-applicable si le lien est ambigu pour tout utilisateur ou le contexte de la page ne permet pas de comprendre la destination du lien",
		"complement": "",
		"moreInfo": "https://a11y-guidelines.orange.com/fr/web/developper/navigation-generale/#rendre-les-intitules-des-liens-et-des-boutons-accessibles",
		"priority": "",
		"resultatTest": "nt",
		"goodPractice": true
	},
	{
		"themes": "Navigation générale",
		"title": "Chaque libellé de lien permettant d'ouvrir/télécharger un document est-il compréhensible ?",
		"ID": "testID-071",
		"IDorigin": "testID-071",
		"wcag": [],
		"verifier": "<p>L'utilisateur doit avoir l'information si un lien permet d'ouvrir ou de télécharger un document (pdf, traitement de texte, vidéo, audio…)</p><p>Chaque lien permettant de télécharger un fichier doit être accompagné d'informations relatives à sa consultation.</p><p>Vérifier que le libellé du lien contient&nbsp;:</p><ul><li>le nom/titre du document</li><li>le type de document&nbsp;: pdf, texte, mp3…</li><li>si besoin la langue du document</li><li>le poids du document</li></ul>",
		"complement": "",
		"moreInfo": "https://a11y-guidelines.orange.com/fr/web/developper/navigation-generale/#rendre-les-intitules-des-liens-et-des-boutons-accessibles",
		"priority": "",
		"resultatTest": "nt",
		"goodPractice": true
	},
	{
		"themes": "Navigation générale",
		"title": "Un utilisateur est-il prévenu de l'ouverture d'une nouvelle fenêtre ? ",
		"ID": "testID-072",
		"IDorigin": "testID-072",
		"wcag": [],
		"verifier": "<p>Vérifier que l'ouverture d'une nouvelle fenêtre est mentionnée aux utilisateurs, au choix&nbsp;:</p><ul><li>intitulé du lien incluant la mention « nouvelle fenêtre »</li><li>présence d'un indice visuel (title, icône dans l'intitulé…) et de la mention « nouvelle fenêtre » dans le nom accessible.</li></ul>",
		"complement": "<p>Si possible, éviter de mettre un attribut <code>title</code> incluant la mention \"nouvelle fenêtre\" du fait de sa faible robustesse parmi les aides techniques.</p>",
		"moreInfo": "https://a11y-guidelines.orange.com/fr/web/developper/navigation-generale/#prevenir-lutilisateur-de-louverture-dune-nouvelle-fenetre",
		"priority": "",
		"resultatTest": "nt",
		"goodPractice": true
	},
	{
		"themes": "Navigation générale",
		"title": "Chaque libellé de bouton est-il présent et pertinent&nbsp;?",
		"ID": "testID-069",
		"IDorigin": "testID-069",
		"wcag": [
			"2.4.6 AA"
		],
		"verifier": "<p>L'utilisateur doit connaitre la fonction d'un bouton grâce à son intitulé. Vérifier que l'action portée par le nom accessible de chaque bouton est pertinente.</p><p>En cas d'absence de nom accessible, penser à invalider le critère <a href=#headingtestID-066>4.1.2 A \"Les composants d'interfaces (natifs ou personnalisés) sont-ils interprétés par les technologies d'assistance ?</a></p>",
		"moreInfo": "https://a11y-guidelines.orange.com/fr/web/developper/navigation-generale/#rendre-les-intitules-des-liens-et-des-boutons-accessibles",
		"priority": "P1",
		"resultatTest": "nt",
		"goodPractice": false
	},
	{
		"themes": "Navigation générale",
		"title": "Un mécanisme pour naviguer au sein de la page est-il présent&nbsp;?",
		"ID": "testID-029",
		"IDorigin": "testID-029",
		"wcag": [
			"2.4.1 A"
		],
		"verifier": "<p>Si un des mécanismes ci-dessous est jugé nécessaire à la navigation, mais absent de la page, le test est alors non-conforme&nbsp;:</p><ul><li>des titres de niveaux</li><li>des liens d'évitement, présents en début de page et permettant d'accéder aux principales zones de contenu</li><li>des <span lang=\"en\">landmarks</span>, utilisés pour structurer le document (<code>header</code>, <code>main</code>…)</li><li>des liens de sauts de bloc présents au sein du contenu</li></ul>",
		"moreInfo": "https://a11y-guidelines.orange.com/fr/web/developper/navigation-generale/#fournir-des-liens-devitement",
		"priority": "P3",
		"resultatTest": "nt",
		"goodPractice": false
	},
	{
		"themes": "Navigation générale",
		"title": "La structure sémantique globale est-elle cohérente ? ",
		"ID": "testID-073",
		"IDorigin": "testID-073",
		"wcag": [],
		"verifier": "<ul><li>vérifier que chaque région de la page possède une sémantique pertinente à travers des balises de structures HTML5 au minimum <code>header</code>, <code>main</code>, <code>footer</code> (ou leur équivalent sous forme de roles ARIA&nbsp;: <code>role=banner</code>, <code>role=main</code>, <code>role=complementary</code>).</li><li>vérifier que le contenu principal est inclus dans une balise main</li><li>vérifier que le contenu de la page est inclus au minimum dans une balise structure</li></ul>",
		"complement": "",
		"moreInfo": "https://a11y-guidelines.orange.com/fr/web/exemples-de-composants/landmarks-aria/#main-content",
		"priority": "",
		"resultatTest": "nt",
		"goodPractice": true
	},
	{
		"themes": "Navigation générale",
		"title": "Des liens d'évitement sont-ils présents ? ",
		"ID": "testID-074",
		"IDorigin": "testID-074",
		"wcag": [],
		"verifier": "<p>Vérifier la présence de liens d'évitement (en haut de page) si nécessaire.</p>",
		"complement": "<p>Les principales raisons de la mise en place de liens d'évitements&nbsp;:</p><ul><li>la page est longue</li><li>la navigation contient beaucoup de lien</li><li>le contenu contient beaucoup de liens (plusieurs menus de navigation, pieds de page faisant office de plan de site…)</li><li>la page est découpée en nombreuses parties distinctes (portail, tableau de bord…)</li></ul>",
		"moreInfo": "https://a11y-guidelines.orange.com/fr/articles/liens-evitement/",
		"priority": "",
		"resultatTest": "nt",
		"goodPractice": true
	},
	{
		"themes": "Navigation générale",
		"title": "Les contenus apparaissant à la prise de focus ou au survol d'un composant d'interfaces (ex&nbsp;: <span lang=\"en\">tooltip</span>) sont-ils contrôlables par l'utilisateur&nbsp;?",
		"ID": "testID-030",
		"IDorigin": "testID-030",
		"wcag": [
			"1.4.13 AA"
		],
		"verifier": "<p>Le contenu apparaissant au focus ou survol&nbsp;:</p><ul><li>doit pouvoir être masqué sans déplacer le focus ou le pointeur de la souris</li><li>doit pouvoir être survolé à la souris (sans entraîner sa disparition)</li><li>doit rester affiché tant que l'utilisateur ne déclenche pas sa fermeture (en déplaçant la souris, le focus, touche <kbd>Échap.</kbd>…) et tant que ce contenu reste valide</li></ul>",
		"exception": "Le critère est non-applicable dans les cas suivants :<ul><li>les contenus additionnels contrôlés par l'agent utilisateur, par exemple&nbsp;: infobulle générée par l'utilisation d'un attribut <code>title</code>.</li><li>les contenus additionnels ne masquant pas de contenu informatif</li></ul>",
		"moreInfo": "https://a11y-guidelines.orange.com/fr/web/developper/navigation-generale/#sassurer-que-lutilisateur-garde-le-controle-lors-des-interactions",
		"priority": "P2",
		"resultatTest": "nt",
		"goodPractice": false
	},
	{
		"themes": "Navigation générale",
		"title": "Les limites de temps sont-elles contrôlables par l'utilisateur&nbsp;?",
		"ID": "testID-031",
		"IDorigin": "testID-031",
		"wcag": [
			"2.2.1 A"
		],
		"verifier": "<p>Vérifier qu'une des conditions ci-dessous est respectée&nbsp;:</p><ul><li>possibilité de supprimer la limite de temps</li><li>possibilité d'augmenter jusqu'à 10 fois minimum le temps par défaut</li><li>l'utilisateur est prévenu au minimum 20 secondes avant la fin et peut augmenter la durée simplement</li><li>la limite de temps est supérieure à 20 heures.</li></ul>",
		"exception": "Le critère est non-applicable dans les cas suivants :<ul><li>l'exception du temps réel&nbsp;: la limite de temps est une partie constitutive d'un évènement en temps réel (exemple : une enchère) et aucune alternative n'est possible&nbsp;;</li><li>l'exception de la limite essentielle&nbsp;: la limite de temps est essentielle et l'étendre invaliderait alors l'activité&nbsp;;</li></ul>",
		"moreInfo": "https://a11y-guidelines.orange.com/fr/web/developper/navigation-generale/#sassurer-que-lutilisateur-garde-le-controle-lors-des-interactions",
		"priority": "P2",
		"resultatTest": "nt",
		"goodPractice": false
	},
	{
		"themes": "Navigation générale",
		"title": "L'utilisateur a-t-il le contrôle des changements de contexte à la prise de focus au clavier ou au survol souris ?",
		"ID": "testID-032",
		"IDorigin": "testID-032",
		"wcag": [
			"3.2.1 A"
		],
		"verifier": "<p>Lors de l'utilisation de tout composant interactif, vérifier l'absence de changement de contexte lors de la prise de focus ou au survol souris d'un élément. Il s'agit de s'assurer que ce type d'interaction à des résultats prédictibles (comportement classique, attendu par l'utilisateur).</p>", 
		"exception": "Le critère est non applicable si, à la prise de focus, le contexte ne change pas. Par exemple, l'apparition d'un menu ou encore la modification visuelle lors du survol d'un lien ne sont pas des changements de contexte.",
		"complement": "<h5>Changement de contexte</h5><p>Changement majeur dans le contenu de la page Web qui, lorsqu'il est effectué à l'insu de l'utilisateur, peut désorienter.</p><p>Les changements de contexte incluent les changements&nbsp;:</p><ul><li>d'agent utilisateur (ouverture d'une application depuis le navigateur)</li><li>de <span lang=\"en\">viewport</span> (autre partie de la page affichée, ouverture d'une nouvelle fenêtre)</li><li>de focus (déplacement du focus)</li><li>de contenu qui modifie le sens de la page Web</li></ul>",
		"moreInfo": "https://a11y-guidelines.orange.com/fr/web/developper/navigation-generale/#sassurer-que-lutilisateur-garde-le-controle-lors-des-interactions",
		"priority": "P2",
		"resultatTest": "nt",
		"goodPractice": false
	},
	{
		"themes": "Navigation générale",
		"title": "L'utilisateur a-t-il le contrôle des changements de contexte lors d'une modification de paramètre&nbsp;?",
		"ID": "testID-061",
		"IDorigin": "testID-061",
		"wcag": [
			"3.2.2 A"
		],
		"verifier": "<p>Vérifier l'absence de changement de contexte, sans avertissement préalable de l'utilisateur, lors de la modification de paramètre de tout composant interactif.</p><p>La modification d'un paramètre peut être, par exemple, cocher une case, la saisie de contenu dans un champ de texte, la sélection d'une option dans un contrôle de formulaire, tout cela doit avoir des résultats prédictibles (comportement classique, attendu par l'utilisateur)</p><p>Le changement de contexte est conforme si&nbsp;:</p><ul><li>l'action est initiée par un bouton ou un lien explicite</li><li>l'utilisateur est averti par un texte avant son déclenchement</li></ul>",
		"complement": "<h5>Changement de contexte</h5><p>Changement majeur dans le contenu de la page Web qui, lorsqu'il est effectué à l'insu de l'utilisateur, peut désorienter.</p><p>Les changements de contexte incluent les changements&nbsp;:</p><ul><li>d'agent utilisateur (ouverture d'une application depuis le navigateur)</li><li>de <span lang=\"en\">viewport</span> (autre partie de la page affichée, ouverture d'une nouvelle fenêtre)</li><li>de focus (déplacement du focus)</li><li>de contenu qui modifie le sens de la page Web</li></ul><p>L'activation d'un lien ou d'un bouton n'est pas une modification de paramètre.</p>",
		"moreInfo": "https://a11y-guidelines.orange.com/fr/web/developper/navigation-generale/#sassurer-que-lutilisateur-garde-le-controle-lors-des-interactions",
		"priority": "P2",
		"resultatTest": "nt",
		"goodPractice": false
	},
	{
		"themes": "Navigation générale",
		"title": "Le site dispose-t-il d'au moins 2 mécanismes de navigation&nbsp;?",
		"ID": "testID-033",
		"IDorigin": "testID-033",
		"wcag": [
			"2.4.5 AA"
		],
		"verifier": "<p>Vérifier qu'au moins 2 des mécanismes listés ci-dessous sont présents sur la page, pour permettre à un utilisateur de se situer au sein d'un site&nbsp;:</p> <ul><li>un menu de navigation principal</li><li>une table des matières</li><li>un plan de site</li><li>un mécanisme de recherche</li></ul>", 
		"exception": "Le critère est non-applicable dans les cas suivants :<ul><li>Le nombre de pages est inférieur à 3 ou 4 et/ou le contenu succinct</li><li>Une page résultat ou étape d'un processus à étapes.</li></ul>",
		"moreInfo": "https://a11y-guidelines.orange.com/fr/web/developper/navigation-generale/#fournir-des-acces-multiples-et-une-localisation",
		"priority": "P3",
		"resultatTest": "nt",
		"goodPractice": false
	},
	{
		"themes": "Navigation générale",
		"title": "Des informations sur l'emplacement de l'utilisateur dans un ensemble de page sont-elles disponibles ? ",
		"ID": "testID-075",
		"IDorigin": "testID-075",
		"wcag": [
			"2.4.8 AAA"
		],
		"verifier": "<p>Vérifier que la position courante de l'utilisateur au sein d'un site est matérialisée visuellement et programmatiquement&nbsp;:</p><ul><li>un système est présent (fil d'Ariane…)</li><li>une indication visuelle est présente (suffisamment contrastée et ne reposant pas que sur la couleur) et accompagnée d'un <a href=\"https://a11y-guidelines.orange.com/fr/articles/utilisation-de-l-attribut-aria-current/#main-content\" target=\"_blank\">attribut `aria-current`</a></li></ul>",
		"moreInfo": "https://a11y-guidelines.orange.com/fr/web/developper/navigation-generale/#fournir-des-acces-multiples-et-une-localisation",
		"priority": "",
		"resultatTest": "nt",
		"goodPractice": true
	},
	{
		"themes": "Navigation générale",
		"title": "Les messages de statuts sont-ils correctement restitués&nbsp;?",
		"ID": "testID-034",
		"IDorigin": "testID-034",
		"wcag": [
			"4.1.3 A"
		],
		"verifier": "<p>Pour tous les messages de status (résultats d'une recherche, une notification, dialogue dans un chatbot, upload d'un fichier, enregistrement produit dans un panier, chargement progressif d'une page (20 articles suivants)…)&nbsp;:</p><ul><li>vérifier qu'un mécanisme reposant sur les rôles ARIA (<code>status</code>, <code>alert</code>, <code>alertdialog</code>…) ou sur les régions dynamiques <code>aria-live</code> est implémenté</li><li>vérifier qu'ils soient restitués de façon pertinente au lecteur d'écran</li></ul>",
		"complement": "<h5>Exemples</h5><ul><li>message qui informe sur le résultat d'une action ou sur l'état de l'application&nbsp;: <code>role='status'</code></li><li>message d'erreur&nbsp;: <code>role='alert'</code></li><li>message qui indique la progression&nbsp;: <code>role='log'</code>, <code>'progressbar'</code> ou <code>'status'</code></li></ul><p>Plus d'information sur <a href=\"https://a11y-guidelines.orange.com/web/aria-status.html#utiliser-abbr-aria-abbr-les-messages-d-tat-de-statut-ou-contextuel \" target=\"_blank\" title=\"Les messages d'état (nouvelle fenêtre)\">les messages d'état</a>.</p>",
		"moreInfo": "https://a11y-guidelines.orange.com/fr/web/developper/navigation-generale/#permettre-de-connaitre-le-resultat-dune-interaction-utilisateur-a-laide-de-messages-contextuels",
		"priority": "P2",
		"resultatTest": "nt",
		"goodPractice": false
	},
	{
		"themes": "Navigation générale",
		"title": "Si un contenu de la page est en mouvement, défile, clignote ou se met à jour, durant plus de 5 secondes et démarrant automatiquement, l'utilisateur a-t-il la possibilité de stopper, mettre en pause, masquer ou modifier sa fréquence de rafraichissement de ce contenu&nbsp;?",
		"ID": "testID-035",
		"IDorigin": "testID-035",
		"wcag": [
			"2.2.2 A"
		],
		"verifier": "<p>Si un contenu d'une partie de la page, démarrant automatiquement et durant plus de 5 secondes, est en mouvement, défile, clignote, il existe un moyen de l'arrêter, le mettre en pause ou le cacher.</p><p>Pour du contenu d'une partie de la page qui se met à jour qui ou est rafraichi automatiquement, il existe un moyen de l'arrêter, le mettre en pause masquer ou jouer sur sa fréquence de mise à jour.</p>",
		"exception": "Le critère est non-applicable si aucun mouvement, défilement, clignotement, mise à jour ou rafraichissement automatique durant plus de 5 secondes et démarrant automatiquement.",
		"moreInfo": "https://a11y-guidelines.orange.com/fr/web/developper/navigation-generale/#permettre-le-controle-des-animations",
		"priority": "P3",
		"resultatTest": "nt",
		"goodPractice": false
	},
	{
		"themes": "Navigation générale",
		"title": "Il n'y a aucun clignotement de plus de 3 flashs par seconde sur une zone égale ou supérieure à <code>21 824 px²</code>",
		"ID": "testID-036",
		"IDorigin": "testID-036",
		"wcag": [
			"2.3.1 A"
		],
		"verifier": "<p>Conforme, si les clignotements flashent moins de 3 fois par seconde ou sur une zone de moins de <code>21 824 px²</code></p>",
		"moreInfo": "https://a11y-guidelines.orange.com/fr/web/developper/navigation-generale/#permettre-le-controle-des-animations",
		"priority": "P2",
		"resultatTest": "nt",
		"goodPractice": false
	},
	{
		"themes": "Navigation générale",
		"title": "Si un mécanisme d'aide est proposé et répété sur plusieurs pages, celui-ci est-il présenté dans le même ordre relatif ?",
		"ID": "testID-085",
		"IDorigin": "testID-085",
		"wcag": [
			"3.2.6 A"
		],
		"verifier": "<p>Pour chaque mode d'affichage ou orientation (portrait/paysage), si un ou plusieurs dispositifs d'aide sont proposés, ceux-ci doivent toujours être localisés au même endroit et dans le même ordre relatif sur toutes les pages.</p><p>Le critère est également conforme dans les cas suivants :</p><ul><li>Un élément n'est pas positionné visuellement au même endroit mais dans le même ordre (selon le code source) par rapport aux autres éléments communs de la page.</li><li>Le repositionnement des éléments d'aide est engendré par un changement d'affichage à l'initiative de l'utilisateur (changement d'orientation, de résolution de la page, activation du zoom, etc.).</li><li>Un élément comme un lien promotionnel ad-hoc, qui n'apparaît que sur une seule page et modifie l'ordre relatif du mécanisme d'aide sur cette seule page, peut être ignoré.</li></ul>",
		"complement": "<h5>Complément d'information</h5><ul><li>Les mécanismes d'aide peuvent être une adresse mail, un numéro de téléphone, un formulaire de contact, un chat, une FAQ, etc.</li><li>Ce critère n'impose pas la présence de mécanismes d'aide. S'ils sont présents, vérifier que leur positionnement relatif est le même sur les différents pages du site ou de l'application.</li><li>Si la structure des pages est modifiée selon les profils d'utilisation (exemple : profil visiteur ou profil connecté), il convient de faire la vérification indépendamment pour chaque profil.</li></ul>",
		"exception": "Le critère n'est pas applicable dans les cas suivants :<ul><li>des pages qui n'auraient rien à voir d'un point de vue visuel et fonctionnel (exemples : sur un site de e-commerce, lors du processus de paiement, le template peut changer et la page de paiement est fonctionnellement et visuellement totalement différente).</li><li>le mécanisme d'aide n'est présent que sur une seule page OU le mécanisme d'aide est absent de la page en cours.</li></ul>",
		"moreInfo": "https://a11y-guidelines.orange.com/fr/web/designer/navigation-generale/#sassurer-que-les-elements-daide-sont-places-dans-le-meme-ordre-relatif-sur-les-pages-qui-les-integrent",
		"priority": "P1",
		"resultatTest": "nt",
        "wcag22": true,
		"goodPractice": false
	},
	{
		"themes": "Navigation clavier",
		"title": "Les fonctionnalités de la page sont-elles utilisables au clavier&nbsp;?",
		"ID": "testID-037",
		"IDorigin": "testID-037",
		"wcag": [
			"2.1.1 A"
		],
		"verifier": "<ul><li>vérifier que les fonctionnalités disponibles à la souris sont également disponibles au clavier</li><li>vérifier que les contenus apparaissant au survol (exemple&nbsp;: <span lang=\"en\">popin</span>, modale, infobulle) apparaissent également au focus</li></ul>", 
		"exception": "Le critère est non applicable pour les cas suivants :<ul><li>les infobulles sont générées par l'agent utilisateur (exemple : les infobulles de l'attribut <code>title</code>)</li><li>la fonction sous-jacente nécessite l'exécution d'un chemin par l'utilisateur et pas seulement des deux points terminaux</li></ul>", 
		"moreInfo": "https://a11y-guidelines.orange.com/fr/web/developper/navigation-clavier/#permettre-dutiliser-les-principales-fonctionnalites-de-lapplication-au-clavier",
		"priority": "P0",
		"resultatTest": "nt",
		"goodPractice": false
	},
	{
		"themes": "Navigation clavier",
		"title": "La page est-elle exempte de pièges clavier&nbsp;?",
		"ID": "testID-038",
		"IDorigin": "testID-038",
		"wcag": [
			"2.1.2 A"
		],
		"verifier": "<p>Vérifier que le focus au clavier ne se retrouve pas bloqué à l'intérieur d'une zone ou d'un composant de la page web.</p>",
		"moreInfo": "https://a11y-guidelines.orange.com/fr/web/developper/navigation-clavier/#rendre-le-parcours-du-focus-sequentiel-et-logique-sans-piege-clavier",
		"priority": "P0",
		"resultatTest": "nt",
		"goodPractice": false
	},
	{
		"themes": "Navigation clavier",
		"title": "Si un raccourci clavier utilisant un seul caractère imprimable est disponible, celui-ci vérifie-t-il l'une des conditions ci-dessous&nbsp;?",
		"ID": "testID-039",
		"IDorigin": "testID-039",
		"wcag": [
			"2.1.4 A"
		],
		"verifier": "<ul><li>le raccourci peut être désactivé par l'utilisateur</li><li>le raccourci est actif uniquement à la prise de focus du composant de l'interface</li><li>le raccourci peut être modifié, avec la possibilité d'ajouter un ou plusieurs caractères non-imprimables (<kbd>Ctrl</kbd>, <kbd>Alt</kbd>…) à la combinaison</li></ul>",
		"exception": "Le critère n'est pas applicable aux raccourcis par <code>accesskey</code> ni aux raccourcis clavier utilisant une touche de modification (touche de caractère non imprimables, exemple : <kbd>Ctrl</kbd>, <kbd>Alt</kbd> ou <kbd>Shift</kbd>).",
		"complement": "<h5>Complément d'information</h5><p>La présence de raccourcis peut être détectée en utilisant ce <a href='https://a11y-guidelines.orange.com/fr/web/outils/methodes-et-outils-de-test/raccourcis-clavier/'>bookmarklet raccourcis clavier</a></p>",
		"moreInfo": "https://a11y-guidelines.orange.com/fr/web/developper/navigation-generale/#sassurer-que-lutilisaateur-garde-le-controle-lors-des-interactions",
		"priority": "P3",
		"resultatTest": "nt",
		"goodPractice": false
	},
	{
		"themes": "Navigation clavier",
		"title": "L'ordre de prise de focus des éléments est-il logique et cohérent&nbsp;?",
		"ID": "testID-040",
		"IDorigin": "testID-040",
		"wcag": [
			"2.4.3 A"
		],
		"verifier": "<p>Vérifier que l'ordre de prise de focus des éléments (boutons, liens, champs de formulaires) est cohérent et logique (souvent équivalent à l'ordre visuel).</p>",
		"moreInfo": "https://a11y-guidelines.orange.com/fr/web/developper/navigation-clavier/#rendre-le-parcours-du-focus-sequentiel-et-logique-sans-piege-clavier",
		"priority": "P3",
		"resultatTest": "nt",
		"goodPractice": false
	},
	{
		"themes": "Navigation clavier",
		"title": "Le focus est-il présent et suffisamment visible ?",
		"ID": "testID-041",
		"IDorigin": "testID-041",
		"wcag": [
			"2.4.7 AA"
		],
		"verifier": "<p>Le focus doit toujours être présent et suffisamment visible sur tous les éléments focusables.</p>",
		"complement": "<h5>Complément d'information</h5><p>Si le focus par défaut du navigateur est désactivé, un focus personnalisé doit être affiché en remplacement.</p>",
		"moreInfo":"https://a11y-guidelines.orange.com/fr/web/developper/navigation-clavier/#rendre-visible-le-focus-en-toute-circonstance",
		"priority": "P2",
		"resultatTest": "nt",
		"goodPractice": false
	},
	{
		"themes": "Navigation clavier",
		"title": "Le composant recevant le focus n'est pas complètement masqué ? ",
		"ID": "testID-081",
		"IDorigin": "testID-081",
		"wcag": [
			"2.4.11 AA"
		],
		"verifier": "<p>Vérifier que le composant recevant le focus n'est pas complètement masqué par du contenu de la page lors de la navigation clavier.</p>",
		"complement": "<h5>Complément d'information</h5><ul><li>Lorsque le contenu d'une interface configurable peut être repositionné par l'utilisateur, seules les positions initiales du contenu déplaçable par l'utilisateur sont prises en compte pour les tests et la conformité à ce critère de réussite.</li><li>Le contenu ouvert par l'utilisateur peut masquer le composant recevant le focus. Si l'utilisateur peut révéler le composant ciblé sans déplacer le focus, le composant avec le focus n'est pas considéré comme masqué en raison du contenu créé par l'auteur.</li><li>Si le composant qui reçoit le focus est recouvert par un autre élément dont l'opacité est inférieure à 100 % alors l'élément qui reçoit le focus n'est pas totalement masqué et le critère est validé.</li></ul>",
		"moreInfo": "https://a11y-guidelines.orange.com/fr/web/developper/navigation-clavier/#rendre-visible-le-focus-en-toute-circonstance",
		"priority": "P2",
		"resultatTest": "nt",
		"wcag22": true,
		"goodPractice": false
	},
	{
		"themes": "Mise en page",
		"title": "Le texte reste-t-il lisible lorsque la taille des caractères est augmentée de 200%&nbsp;?",
		"ID": "testID-042",
		"IDorigin": "testID-042",
		"wcag": [
			"1.4.4 AA"
		],
		"verifier": "<p>Vérifier l'absence de perte d'information (pas de contenus ou de fonctionnalités inutilisables, tronqués ou masqués) suite à l'agrandissement de la taille du texte à 200%.</p><p><em>Note&nbsp:</em> le zoom du texte doit être autorisé sur mobile. Il ne faut pas de présence de balise \"&lt;meta name='viewport'&gt;\" avec&nbsp:</p><ul><li>soit, le paramètre user-scalable='no' </li><li>soit, le paramètre maximum-scale inférieur à 2</li></ul>",
		"moreInfo": "https://a11y-guidelines.orange.com/fr/web/developper/mise-en-page/#utiliser-des-tailles-relatives-et-faire-du-web-adaptatif",
		"priority": "P3",
		"resultatTest": "nt",
		"goodPractice": false
	},
	{
		"themes": "Mise en page",
		"title": "La page est-elle compréhensible et utilisable sans défilement horizontal pour une fenêtre réduite à 320px de large ou sans défilement vertical pour une fenêtre réduite à 256px de haut&nbsp;?",
		"ID": "testID-043",
		"IDorigin": "testID-043",
		"wcag": [
			"1.4.10 AA"
		],
		"verifier": "<p>Vérifier qu'une des conditions ci-dessous est respectée&nbsp;:</p><ul><li>Pour les contenus dont le sens de défilement est vertical : le contenu est présenté sans perte d'informations ni de fonctionnalités dans une fenêtre réduite à 320px de large, sans nécessité de défiler horizontalement</li><li>Pour les contenus dont le sens de défilement est horizontal : le contenu est présenté sans perte d'informations ni de fonctionnalités dans une fenêtre réduite à 256px de haut, sans nécessité de défiler verticalement</li></ul><p>Conforme si une barre de défilement est présente mais que son utilisation n'est pas nécessaire pour accéder au contenu informatif ou utiliser les fonctionnalités de la page.</p>",
		"exception": "Le critère est non-applicable pour des contenus nécessitant les deux dimensions pour être compréhensibles comme des images, cartes, présentations, tableaux de données, jeux….",
		"moreInfo": "https://a11y-guidelines.orange.com/fr/web/developper/mise-en-page/#utiliser-des-tailles-relatives-et-faire-du-web-adaptatif",
		"priority": "P3",
		"resultatTest": "nt",
		"goodPractice": false
	},
	{
		"themes": "Mise en page",
		"title": "Les propriétés d'espacement du texte peuvent-elles être redéfinies par l'utilisateur sans perte de contenu ou de fonctionnalité&nbsp;?",
		"ID": "testID-044",
		"IDorigin": "testID-044",
		"wcag": [
			"1.4.12 AA"
		],
		"verifier": "<ul><li>la hauteur des lignes doit pouvoir être ajustée à 1.5 fois minimum la taille de la police de caractères</li><li>l'espace situé entre deux paragraphes doit pouvoir être ajusté à 2 fois minimum la taille de la police de caractères</li><li>l'espacement entre les lettres doit pouvoir être ajusté à 0.12 fois minimum la taille de la police de caractères</li><li>l'espacement entre les mots doit pouvoir être ajusté à 0.16 fois minimum la taille de la police de caractères</li><li>absence de textes tronqués ou superposés</li></ul>",
		"complement": "<h5>Bookmarklet</h5><p>Pour faciliter le test, vous pouvez utiliser le bookmarklet suivant (à glisser dans votre barre de favoris)&nbsp;: <a href='javascript:(function(){document.querySelector(%27body%27).classList.add(%27text-spacing%27);%20var%20style%20=%20document.createElement(%27style%27),%20styleContent%20=%20document.createTextNode(%27.text-spacing%20*%20{%20line-height:%201.5%20!important;%20letter-spacing:%200.12em%20!important;%20word-spacing:%200.16em%20!important;%20}%20.text-spacing%20p{%20margin-bottom:%202em%20!important;%20}%20%27);%20style.appendChild(styleContent%20);%20var%20caput%20=%20document.getElementsByTagName(%27head%27);%20caput[0].appendChild(style);%20})();'>Espacement du texte</a></p>",
		"moreInfo": "https://a11y-guidelines.orange.com/fr/web/developper/mise-en-page/#permettre-daerer-le-texte",
		"priority": "P3",
		"resultatTest": "nt",
		"goodPractice": false
	},
	{
		"themes": "Mise en page",
		"title": "Le positionnement des éléments communs (mécanismes de navigation, composants, regroupements) est-il cohérent par rapport aux autres pages du site&nbsp;?",
		"ID": "testID-045",
		"IDorigin": "testID-045",
		"wcag": [
			"3.2.3 AA"
		],
		"verifier": "<p>Vérifier que les mécanismes de navigation sont toujours situés au même endroit dans un ensemble de pages (à l'écran et dans le code).</p>",
		"moreInfo": "https://a11y-guidelines.orange.com/fr/web/developper/mise-en-page/#identifier-et-conserver-la-coherence-des-regroupements-et-des-differentes-regions-de-la-page",
		"priority": "P3",
		"resultatTest": "nt",
		"goodPractice": false
	},
	{
		"themes": "Mise en page",
		"title": "Les libellés des composants interactifs sont-ils cohérents par rapport aux autres pages du site&nbsp;?",
		"ID": "testID-046",
		"IDorigin": "testID-046",
		"wcag": [
			"3.2.4 AA"
		],
		"verifier": "<p>Vérifier que les composants qui ont la même fonction sont nommés de manière identique (nom accessible identique, ou au moins verbe d'action commun) d'une page à l'autre et à l'intérieur d'une même page si un composant est répété.</p>",
		"moreInfo": "https://a11y-guidelines.orange.com/fr/web/developper/mise-en-page/#identifier-et-conserver-la-coherence-des-regroupements-et-des-differentes-regions-de-la-page",
		"priority": "P3",
		"resultatTest": "nt",
		"goodPractice": false
	},
	{
		"themes": "Mise en page",
		"title": "Après désactivation du CSS, la page reste-t-elle compréhensible&nbsp;?",
		"ID": "testID-058",
		"IDorigin": "testID-058",
		"wcag": [
			"1.3.2 A"
		],
		"verifier": "<p>Si un ordre de lecture spécifique est obligatoire pour comprendre un contenu de la page&nbsp;:<br/> quand le CSS est désactivé, vérifier que ce contenu lu de façon linéaire reste compréhensible.</p><p><strong>Exemple&nbsp;:</strong> un contenu implémenté sous forme de colonnes en CSS doit être restitué dans le bon ordre sans CSS.</p><p>Si aucun contenu nécessite un ordre de lecture spécifique, alors le critère est non applicable.</p>",
		"complement": "<h5>Compléments d'information</h5><p>L'ordre des contenus dans le code HTML doit rester compréhensible, en général, il suffit qu'il soit identique à l'ordre d'affichage des contenus à l'écran.</p><p>Exemples de contenus à tester&nbsp;:</p><ul><li>Mise en page via ces propriétés CSS&nbsp; <ul><li>les propriétés de positionnement (<code>top</code>, <code>left</code>, <code>float</code>…)</li><li><code>display:\"flex\"</code> ou <code>display:\"grid\"</code></li></ul></li><li>Tableau de mise en forme</li></ul>",
		"moreInfo": "https://a11y-guidelines.orange.com/fr/web/developper/mise-en-page/#separer-le-contenu-de-linteractivite-et-de-la-presentation",
		"priority": "P3",
		"resultatTest": "nt",
		"goodPractice": false
	},
	{
		"themes": "Mise en page",
		"title": "Après désactivation du CSS, le contenu portant de l'information est-il préservé&nbsp;?",
		"ID": "testID-060",
		"IDorigin": "testID-060",
		"wcag": [
			"1.3.1 A"
		],
		"verifier": "<p>Vérifier l'absence de perte d'information</p>",
		"complement": "<h5>Complément d'information</h5><ul><li>Aucune information ne doit être transmise par du contenu généré en CSS (exemples&nbsp;: propriété <code>content</code> des pseudo classes <code>::before</code> / <code>:before</code> et <code>::after</code> / <code>: after</code >, <code>content</code> property, images intégrées en background)</li><li>Le contenu généré par CSS doit présenter uniquement des informations décoratives</li></ul>",
		"moreInfo": "https://a11y-guidelines.orange.com/fr/web/developper/mise-en-page/#separer-le-contenu-de-linteractivite-et-de-la-presentation",
		"priority": "P3",
		"resultatTest": "nt",
		"goodPractice": false
	},
	{
		"themes": "Mise en page",
		"title": "Les changements de sens de lecture sont-ils signalés&nbsp;?",
		"ID": "testID-059",
		"IDorigin": "testID-059",
		"wcag": [
			"1.3.2 A"
		],
		"verifier": "<p>Vérifier que les attributs <code>dir='rtl'</code> ou <code>dir='ltr'</code> sont appliqués lorsque nécessaire.</p>",
		"priority": "P3",
		"resultatTest": "nt",
		"goodPractice": false
	},
	{
		"themes": "Mise en page",
		"title": "Les éléments interactifs ont-ils une surface minimale de 24*24 px CSS ou un espacement suffisant&nbsp;?",
		"ID": "testID-076",
		"IDorigin": "testID-076",
		"wcag": [
			"2.5.8 AA"
		],
		"verifier": "<p>Vérifier que chaque élément interactif respecte la surface minimale de 24*24 px CSS dans toutes les conditions d'affichage (zoom, taille de viewport, etc).</p><p>Le critère est également conforme pour les exceptions suivantes :</p><ul><li>Si l'élément interactif a une surface inférieure à la surface minimale de 24*24 px CSS mais est placé de manière à ce qu'un cercle de 24 px CSS de diamètre centré sur l'élément ne chevauche pas un autre élément interactif ou le cercle d'un élément sous-dimensionné.</li><li>Si la surface de l'élément interactif est inférieure à 24*24 px CSS mais qu'il existe dans la page une alternative conforme permettant de réaliser la même action.</li><li>Si l'élément interactif est intégré dans une phrase ou si sa taille est contrainte par la hauteur de ligne du texte non interactif environnant.</li></ul>",
		"exception":"Critère non applicable si :<ul><li>Le rendu des éléments interactifs est le rendu par défaut de l'agent utilisateur.</li><li>La taille et la position des éléments interactifs sont cruciales pour le contenu (exemple : des repères sur une carte) ou contraintes par une obligation légale. Dans ce cas il est toutefois recommandé de fournir des alternatives lorsque cela est possible.</li></ul>",
		"moreInfo": "https://a11y-guidelines.orange.com/fr/web/developper/mise-en-page/#definir-des-zones-sensibles-de-taille-suffisante",
		"priority": "P2",
		"resultatTest": "nt",
		"wcag22": true,
		"goodPractice": false
	},
	{
		"themes": "Mise en page",
		"title": "Le contenu est-il consultable quelle que soit l'orientation (portrait ou paysage)&nbsp;?",
		"ID": "testID-050",
		"IDorigin": "testID-050",
		"wcag": [
			"1.3.4 AA"
		],
		"verifier": "<p>Vérifier que le contenu et les fonctionnalités sont disponibles dans les deux orientations (pas de perte d'information, pas d'éléments tronqués).</p>",
		"exception" : "Le critère est non-applicable si une orientation est jugée essentielle, exemples :<ul><li>un chèque bancaire</li><li>une application pour du piano</li><li>des diapositives pour un téléviseur ou projecteur…</li></ul>",
		"moreInfo": "https://a11y-guidelines.orange.com/fr/web/developper/mise-en-page/#donner-acces-au-contenu-quelle-que-soit-lorientation-de-lecran",
		"priority": "P3",
		"resultatTest": "nt",
		"goodPractice": false
	},
	{
		"themes": "Tactile et interactions",
		"title": "Les gestes multipoints ou basés sur une trajectoire disposent-ils d'une alternative nécessitant un seul pointeur sans trajectoire&nbsp;?",
		"ID": "testID-047",
		"IDorigin": "testID-047",
		"wcag": [
			"2.5.1 A"
		],
		"verifier": "<p>Vérifier que pour tout geste multipoints (nécessitant plusieurs doigts) et/ou nécessitant des trajectoires gestuelles, une alternative nécessitant un seul pointeur (un seul doigt) et sans trajectoire gestuelle est disponible.</p>",
		"complement": "<h5>Exemple</h5><p><strong>Zoom sur une carte&nbsp;: </strong>Des boutons (+ / -) sont disponibles, en alternative au resserrement à deux doigts.</p>",
		"group": "Tactile",
		"moreInfo": "https://a11y-guidelines.orange.com/fr/web/developper/tactile-et-interactions/#proposer-une-alternative-aux-gestuelles-complexes",
		"priority": "P1",
		"resultatTest": "nt",
		"goodPractice": false
	},
	{
		"themes": "Tactile et interactions",
		"title": "Les erreurs de clic (ou de toucher) peuvent-elles être annulées&nbsp;?",
		"ID": "testID-048",
		"IDorigin": "testID-048",
		"wcag": [
			"2.5.2 A"
		],
		"verifier": "<p>Les actions déclenchées au moyen d'un dispositif de pointage sur un point unique de l'écran doivent pouvoir être annulées&nbsp;:</p><ul><li>vérifier qu'aucune action n'est déclenchée sur un événement <code lang=\"en\">'mousedown'</code> ou <code lang=\"en\">'touchstart'</code> (dès qu'on touche ou qu'on presse un élément) et qu'il soit possible d'annuler en relâchant le pointeur en dehors de l'élément déclencheur.</li><li>si une action est déclenchée lors de l'appui, vérifier que celle-ci est annulée dès le relâchement du pointeur.</li><li>pour des actions complexes (ex&nbsp;: <span lang=\"en\">drag n'drop</span>), vérifier que l'utilisateur peut annuler l'action avant la fin de son exécution à travers une modale de confirmation par exemple</li></ul><p>Le critère est également conforme si l'action initiée par le <code lang=\"en\">'mousedown'</code> ou <code lang=\"en\">'touchstart'</code> est essentielle à l'usage prévu : par exemple l'émulation d'un clavier ou d'un pavé numérique, un piano virtuel.</p>",
		"moreInfo": "https://a11y-guidelines.orange.com/fr/web/developper/tactile-et-interactions/#permettre-dannuler-le-declenchement-des-interactions",
		"priority": "P1",
		"resultatTest": "nt",
		"goodPractice": false
	},
	{
		"themes": "Tactile et interactions",
		"title": "Les actions déclenchées par un mouvement de l'appareil ou un geste de l'utilisateur disposent-elles d'une alternative&nbsp;?",
		"ID": "testID-049",
		"IDorigin": "testID-049",
		"wcag": [
			"2.5.4 A"
		],
		"verifier": "<ul><li>vérifier que ces actions sont également disponibles depuis un composant d'interface (exemple&nbsp;: un bouton)</li><li>vérifier qu'il est possible de désactiver la détection de mouvement</li></ul>",
		"exception": "Le critère n'est pas applicable si le mouvement est essentiel à l'accomplissement de la fonctionnalité (exemple&nbsp;: un podomètre).",
		"group": "Tactile",
		"moreInfo": "https://a11y-guidelines.orange.com/fr/web/developper/tactile-et-interactions/#proposer-une-alternative-aux-gestuelles-complexes",
		"priority": "P1",
		"resultatTest": "nt",
		"goodPractice": false
	},
	{
		"themes": "Tactile et interactions",
		"title": "Les fonctionnalités utilisant l'action de glisser et déposer ont-elles une alternative ?",
		"ID": "testID-080",
		"IDorigin": "testID-080",
		"wcag": [
			"2.5.7 AA"
		],
		"verifier": "<p>Les fonctionnalités de type glisser-déposer, doivent avoir une alternative ne nécessitant pas une dextérité propre à ce type de mouvement (action à pointage unique).</p>",
		"exception": "Le critère est non applicable dans les cas suivants :<ul><li>L'action de glisser/déposer est essentielle (exemple : un jeu de dextérité)</li><li>La fonctionnalité est native et non modifiée</li></ul>",
		"complement":"<h5>Complément d'information</h5><p>Ce critère ne vise que les actions dont seuls les points de départ et d'arrivée sont pris en compte, (exemple : glisser puis déposer un ticket dans un tableau Kanban) et ne tient pas compte des actions \"multi-points\", couvertes dans le critère \"WCAG 2.5.1 - Les gestes multipoints ou basés sur une trajectoire disposent-ils d'une alternative nécessitant un seul pointeur sans trajectoire ?\"</p>",
		"group": "",
		"moreInfo": "https://a11y-guidelines.orange.com/fr/web/developper/tactile-et-interactions/#proposer-une-alternative-aux-gestuelles-complexes",
		"priority": "P2",
		"resultatTest": "nt",
		"wcag22": true,
		"goodPractice": false
	},
	{
		"themes": "Multimédia",
		"title": "Contenu préenregistré seulement audio&nbsp;: une transcription textuelle équivalente au contenu de l'audio est-elle présente&nbsp;?",
		"ID": "testID-052",
		"IDorigin": "testID-052",
		"wcag": [
			"1.2.1 A"
		],
		"verifier": "<p>Vérifier qu'un transcrit complet (texte contenant l'ensemble des informations auditives) est fourni sous forme de texte brut ou HTML.<br>Cette transcription textuelle est alors&nbsp;:</p><ul><li>présente dans la page</li><li>ou disponible via un lien positionné à proximité de la piste audio</li></ul>",
		"group": "Multimédia",
		"moreInfo": "https://a11y-guidelines.orange.com/fr/web/developper/contenu-non-textuel/#rendre-accessible-les-pistes-audio-ou-video",
		"priority": "P2",
		"resultatTest": "nt",
		"goodPractice": false
	},
	{
		"themes": "Multimédia",
		"title": "Vidéo préenregistrée sans audio&nbsp;: une transcription textuelle ou une piste audio équivalente au contenu de la vidéo sont-elles présentes&nbsp;?",
		"ID": "testID-053",
		"IDorigin": "testID-053",
		"wcag": [
			"1.2.1 A"
		],
		"verifier": "<p>Vérifier qu'un transcrit complet (texte contenant l'ensemble des informations visuelles) est fourni sous forme de texte brut ou HTML.<br>Cette transcription textuelle est alors&nbsp;: </p><ul><li>présente dans la page</li><li>ou disponible via un lien positionné à proximité de la vidéo</li><li>ou vérifier la présence d'une piste audio fournissant les informations présentées visuellement</li></ul>",
		"group": "Multimédia",
		"moreInfo": "https://a11y-guidelines.orange.com/fr/web/developper/contenu-non-textuel/#rendre-accessible-les-pistes-audio-ou-video",
		"priority": "P2",
		"resultatTest": "nt",
		"goodPractice": false
	},
	{
		"themes": "Multimédia",
		"title": "Vidéo préenregistrée (avec ou sans audio)&nbsp;: une transcription textuelle ou une audiodescription sont-elles présentes&nbsp;?",
		"ID": "testID-055",
		"IDorigin": "testID-055",
		"wcag": [
			"1.2.3 A"
		],
		"verifier": "<ul><li>vérifier qu'un transcrit complet (texte contenant l'ensemble des informations auditives et visuelles) est fourni sous forme de texte brut ou HTML.<br>Cette transcription textuelle est alors&nbsp;: <ul><li>présente dans la page</li><li>ou disponible via un lien positionné à proximité de la vidéo</li></ul></li><li>ou vérifier que pour toute vidéo, une audiodescription est disponible<ul><li>vérifier que l'audiodescription est correctement synchronisée</li><li>vérifier que l'audiodescription n'entre pas en conflit avec la piste audio de la vidéo (pas de perte d'information)</li><li>vérifier que l'audiodescription est pertinente</li></ul></li></ul>",
		"group": "Multimédia",
		"moreInfo": "https://a11y-guidelines.orange.com/fr/web/developper/contenu-non-textuel/#rendre-accessible-les-pistes-audio-ou-video",
		"priority": "P2",
		"resultatTest": "nt",
		"goodPractice": false
	},
	{
		"themes": "Multimédia",
		"title": "Vidéo préenregistrée (avec ou sans audio)&nbsp;: une audiodescription est-elle présente&nbsp;?",
		"ID": "testID-057",
		"IDorigin": "testID-057",
		"wcag": [
			"1.2.5 AA"
		],
		"verifier": "<ul><li>vérifier que pour toute vidéo, une audiodescription est disponible</li><li>vérifier que l'audiodescription est correctement synchronisée</li><li>vérifier que l'audiodescription n'entre pas en conflit avec la piste audio de la vidéo (pas de perte d'information)</li><li>vérifier que l'audiodescription est pertinente</li></ul>",
		"group": "Multimédia",
		"moreInfo": "https://a11y-guidelines.orange.com/fr/web/developper/contenu-non-textuel/#rendre-accessible-les-pistes-audio-ou-video",
		"priority": "P2",
		"resultatTest": "nt",
		"goodPractice": false
	},
	{
		"themes": "Multimédia",
		"title": "Vidéo préenregistrée avec audio&nbsp;: des sous-titres transcrits sont-ils fournis pour tout le contenu&nbsp;?",
		"ID": "testID-054",
		"IDorigin": "testID-054",
		"wcag": [
			"1.2.2 A"
		],
		"verifier": "<ul><li>vérifier que pour toute vidéo avec audio, des sous-titres sont disponibles</li><li>vérifier que les sous-titres sont pertinents (restitution de toutes les informations nécessaires à la compréhension, comme l'identité des orateurs)</li><li>vérifier que les sous-titres ne masquent pas des informations importantes de la vidéo</li></ul>",
		"group": "Multimédia",
		"moreInfo": "https://a11y-guidelines.orange.com/fr/web/developper/contenu-non-textuel/#rendre-accessible-les-pistes-audio-ou-video",
		"priority": "P2",
		"resultatTest": "nt",
		"goodPractice": false
	},
	{
		"themes": "Multimédia",
		"title": "Vidéo en direct avec audio&nbsp;: des sous-titres transcrits sont-ils fournis pour tout le contenu&nbsp;?",
		"ID": "testID-056",
		"IDorigin": "testID-056",
		"wcag": [
			"1.2.4 AA"
		],
		"verifier": "<ul><li>vérifier que des sous-titres sont disponibles</li><li>vérifier que les sous-titres sont pertinents (restitution de toutes les informations nécessaires à la compréhension, comme l'identité des orateurs)</li></ul>",
		"complement": "<h5>Sous-titres</h5><p>Les sous-titres ne communiquent pas uniquement les dialogues, mais également toutes les autres informations audio nécessaires à la compréhension du contenu (ex&nbsp;: identifications et position des interlocuteurs, effets sonores, musique…).</p>",
		"group": "Multimédia",
		"moreInfo": "https://a11y-guidelines.orange.com/fr/web/developper/contenu-non-textuel/#rendre-accessible-les-pistes-audio-ou-video",
		"priority": "P2",
		"resultatTest": "nt",
		"goodPractice": false
	},
	{
		"themes": "Multimédia",
		"title": "Si du son est lu automatiquement pendant plus de 3 secondes, l'utilisateur dispose-t-il d'un mécanisme pour le contrôler ? ",
		"ID": "testID-063",
		"IDorigin": "testID-063",
		"wcag": [
			"1.4.2 A"
		],
		"verifier": "<p>Il est possible de :</p> <ul><li>mettre en pause ou d'arrêter le son</li><li>régler le volume indépendamment du volume système</li></ul>",
		"complement":"<h5>Complément d'information</h5><p>Le mécanisme doit être facilement atteignable</p>",
		"group": "Multimédia",
		"moreInfo": "https://a11y-guidelines.orange.com/fr/web/developper/contenu-non-textuel/#rendre-accessible-les-pistes-audio-ou-video",
		"priority": "P3",
		"resultatTest": "nt",
		"goodPractice": false
	},
	{
		"themes": "Aides techniques",
		"title": "Les composants d'interfaces (natifs ou personnalisés) sont-ils interprétés par les technologies d'assistance&nbsp;?",
		"ID": "testID-066",
		"IDorigin": "testID-066",
		"wcag": [
			"4.1.2 A"
		],
		"verifier": "<p>Vérifier tous les composants standards (ex&nbsp;: éléments de formulaire) et créés via JavaScript (ex&nbsp;: menu déroulant)&nbsp;: </p><ul><li>chaque composant personnalisé utilise un rôle ARIA approprié (se référer au <span lang=\"en\">design pattern</span> du composant pour valider)</li><li>pour les composants dont l'utilisateur peut changer la valeur ou l'état, ces propriétés peuvent être également définies depuis un outil d'assistance (ex&nbsp;: cocher ou décocher une case à cocher)</li><li>à chaque changement d'état, l'utilisateur est notifié via son outil d'assistance (exemple valide&nbsp;: le lecteur d'écran notifie&nbsp;: «&nbsp;coché&nbsp;» ou «&nbsp;non coché&nbsp;»)</li></ul>",
		"moreInfo": "https://a11y-guidelines.orange.com/fr/web/developper/aides-techniques/#sassurer-que-les-principales-fonctionnalites-sont-utilisables-avec-les-lecteurs-decran",
		"priority": "P2",
		"resultatTest": "nt",
		"goodPractice": false
	}
]
