{
    "testID-001":[
        {
			"title" : "Presence of non-visually labeled fields",
			"detail" : "All form elements must have a visible label.",
			"solution" : "Set up a visible relevant label for each field",
			"technicalSolution" : ""
		}
    ],
    "testID-005":[
        {
			"title" : "A data format is missing",
			"detail" : "A data format is necessary to allow all users to correctly enter informations.",
			"solution" : "Add a data format. This format is programmatically linked to the field.",
			"technicalSolution" : "Apply one of the solutions below: \n - integrate the data format into the label element \nexample: <label for=\"idInput\"> Date DD/MM/YYYY </label>\n - link the format to the field via an attribute aria-describedby \n exemple: <input aria-describedby=\"idDesc\" […]> <p id=\"idDesc\"> Input format: DD/MM/YYYY </p>"
		}
    ],
	"testID-067":[
		{
			"title": "Presence of fields not linked to their labels",
			"detail" : "All label tags must be linked to the corresponding field.",
			"solution": "The label tag must have a for attribute pointing to the id of the corresponding input",
			"technicalSolution": "Examples: \n- <label for=\"idInput\">[…]</label> <input id=\"idInput\" type=\"[…]\">"
			},
			{
			"title": "Presence of unlabeled fields",
			"detail" : "All form elements must have an accessible name.",
			"solution": "Apply one of the solutions below:\n- add a \"label\" element, in masking accessible if necessary, programmatically linked to the field\n- use an aria-labelledby pointing to relevant information to understand the nature of the field \n- addition of an aria-label attribute\n- addition of a title attribute",
			"technicalSolution": "Examples: \n- <label for=\"idInput\">[…]</label> <input id=\"idInput\" type=\"[…]\">\n- < h2 id=\"idHeading\">[…]</h2> <input aria-labelledby=\"idHeading\" type=\"[…]\">\n- <input aria-label=\"[… ]\" type=\"[…]\">\n- <input title=\"[…]\" type=\"[…]\">"
			},{
				"title" : "The data format is not programmatically linked to the field",
				"detail" : "The data format will not be perceived by an assistive technology (example: screen reader) when there is not a explicit link with the field.",
				"solution" : "Add a data format. This format is programmatically linked to the field.",
				"technicalSolution" : "Apply one of the solutions below: \n - integrate the data format into the label element \n example: <label for=\"idInput\"> Date DD/MM/YYYY </label>\n - link the format to the field via an attribute aria-describedby \nexemple: <input aria-describedby=\"idDesc\" […]> <p id=\"idDesc\"> Input format: DD/MM/YYYY </p>"
			}	
	],
	"testID-002": [
		{
			"title" : "Presence of irrelevant field labels",
			"detail" : "All form elements must have a relevant label, allowing to understand the purpose of the field.",
			"solution" : "Complete the text of the label.",
			"technicalSolution" : ""
		}
	],
	"testID-003": [
		{
			"title" : "Presence of non-grouped fields",
			"detail" : "When necessary the fields of same nature must be grouped",
			"solution" : "- apply a \"fieldset\" completed by an element \"legend\" \n - apply a role \"group\" on the parent element encapsulating the fields, and complete with a legend based on an aria-labelledby",
			"technicalSolution" : ""
		}
	],
    "testID-004":[
        {
			"title" : "Mandatory field not visually identifiable",
			"detail" : "The visual identification of the mandatory field is not based only on color.",
			"solution" : "Add visual information not based only on color, example: asterisk, icon…",
			"technicalSolution" : ""
		},
		{
			"title" : "Mandatory field not identifiable programmatically",
			"detail" : "The identification of a mandatory field is not possible for assistive technologies (ex. : screen reader), if it is not given programmatically.",
			"solution" : "Use one of the techniques below: \n - visual information integrated into the label \n- addition of a \"required\" attribute on the input \n - addition of an \"aria-required\" attribute on the input",
			"technicalSolution" : ""
		}
    ],
    "testID-012":[
        {
			"title" : "No autocomplete attribute for fields presenting personal data",
			"detail" : "Any field used to collect specific data on the user must have an \"autocomplete\" attribute.",
			"solution" : "Add an \"autocomplete\" attribute on the input. The value of the autocomplete depends on the nature of the information collected in the field.",
			"technicalSolution" : "examples: autocomplete=\"username\", autocomplete=\"new-password\", autocomplete =\"postal-code\"…"
		}
    ],
    "testID-006":[
        {
			"title" : "Some error messages are not perceived by users",
			"detail" : "Error messages must be perceived by all users, whatever the equipment used",
			"solution" : "Apply one of the following techniques :\n- Error message is displayed before the form.\n- The message displays the list of error fields.\n Focus is positioned on the error message container.\n- Anchors allow users to go to fields on error.\n- Error messages are displayed in field labels.\n- Error messages are not displayed in field labels but a mechanism exists to link fields and errors by a programmatic mean: see aria-describedby or aria-labelledby.",
			"technicalSolution" : ""
		},
		{
			"title" : "Some fields on error are not perceived by users",
			"detail" : "Fields on error must be perceived by all users, whatever the equipment used.",
			"solution" : "Use aria-invalid=\"true\" attibute in the fields to tell assistive technologies which fields are in error.",
			"technicalSolution" : ""
		}
    ],
    "testID-007":[
        {
			"title" : "No error messages",
			"detail" : "Error messages are missing.",
			"solution" : "Error messages allow users to easily detect input errors. Implement a form validation system to detect and display relevant and explicit error messages",
			"technicalSolution" : ""
		},
		{
			"title" : "Error messages are not explicit enough",
			"detail" : "The error messages are not explicit enough to determine the nature of the error.",
			"solution" : "Explicit error messages allow users to easily detect and correct errors. Provide a specific message depending on the nature of the error.",
			"technicalSolution" : ""
		},
		{
			"title" : "Form with errors are not identifiable",
			"detail" : "The error messages do not identify the form in error.",
			"solution" : "The error message must make it possible to identify the field in error. The message must use the label of the form.",
			"technicalSolution" : ""
		}
    ],
    "testID-008":[
        {
			"title": "No suggestions for corrections",
			"detail": "When fields are in error, suggestions for corrections should be offered if necessary. For example:\n - Suggestion from a limited set of values\n - Additional help to correct incorrectly formatted input .",
			"solution": "Propose suggestions for corrections adapted to the field and the type of error made",
			"technicalSolution": ""
		}
    ],
    "testID-077":[
        {
			"title" : "An authentication has only a cognitive test",
			"detail" : "It is not possible to connect other than with a cognitive test",
			"solution" : "Another authentication technique must be present and not rely on a cognitive test, for example: \n- email authentication \n- login using oAuth \n- fields are properly marked up allowing them to be filled in automatically",
			"technicalSolution" : ""
		}
    ],
    "testID-009":[
        {
			"title": "Important data is submitted without the possibility of being canceled or verified",
			"detail": "Users should be in control when submitting important data (legal commitment, financial transaction, modifying or deleting important data, answers to a test or exam…).",
			"solution": "Apply one of the solutions below:\n - The action can be undone\n - a confirmation step allowing verification or modification is present before final validation",
			"technicalSolution": "Example:\n After submitting the form, a confirmation message appears in a popin.\n The message includes the data entered by the user, and gives the possibility to validate or cancel.\n If the user cancels, he is redirected to the form, his entries are still present in the fields, with the possibility of modifying them." 
		}
    ],
    "testID-017":[
        {
			"title" : "Page title not specified",
			"detail" : "Each page should have a unique title.",
			"solution" : "Fill in the <title> element, with keywords allowing to understand the role of the page. The information can be ordered from the most specific to the least specific, or vice versa (no rules).",
			"technicalSolution" : "<title>Homepage - Orange customer area</title>"
		},
		{
			"title" : "Page title irrelevant",
			"detail" : "Each page must have a unique title, making it possible to understand its role.",
			"solution" : "Fill in the <title> element, with keywords allowing to understand the role of the page. The information can be ordered from the most specific to the least specific, or vice versa (no rules).",
			"technicalSolution" : "<title>Homepage - Orange customer area</title>"
		},
		{
			"title": "Page title not modified when submitting the form",
			"detail": "Each page must have a unique title, allowing to have information on the validation or not of the form of the page when this one does not imply page change.",
			"solution": "Fill in the <title> element with keywords to understand the role of the page and, dynamically, the validation status of the form. The information must indicate if the form is in error, if it has been validated…",
			"technicalSolution": "<title>Subscribed to the newsletter - Home - Orange customer area</title>"
		} 
    ],
    "testID-010":[
        {
			"title" : "Incomplete hierarchy",
			"detail" : "The page must be structured with headings.",
			"solution" : "All content, visually treated as titles, must have heading semantics (<h1> to <h6> tags)",
			"technicalSolution" : ""
		},
		{
			"title" : "Hierarchy of heading levels not logical",
			"detail" : "Level headings should be ranked logically",
			"solution" : "",
			"technicalSolution" : ""
		}
    ],
	"testID-083":[
		{
			"title": "Level headings are irrelevant.",
			"detail": "Level headings should be relevant and accurately describe the section of content they feature.\n Headings within the same level cannot have the same name.",
			"solution" : "",
			"technicalSolution" : ""
		}
	],
	"testID-084":[
		{
			"title": "Incomplete hierarchy",
			"detail" : "The page must be structured using level headings.",
			"solution": "All the contents of the page must have a title (tags <h1> to <h6>) which describes them",
			"technicalSolution": ""
		}
	],
    "testID-068":[
        {
			"title" : "A HTML list semantic is missing",
			"detail" : "Items presented visually as lists must be structured with list semantics.",
			"solution" : "Use appropriate list semantics <ul>, <ol> or <dl>, <dt> and <dd>.",
			"technicalSolution" : ""
		},
		{
			"title" : "An HTML hyperlink semantic is missing",
			"detail" : "Interactive elements causing a URL change must use HTML an hyperlink semantics.",
			"solution" : "Use a <a> tag with a href attribute.",
			"technicalSolution" : ""
		},
		{
			"title" : "A HTML button semantic is missing",
			"detail" : "Interactive elements that trigger an action must use HTML button semantics.",
			"solution" : "Use <button> or <input type=\"button\"> semantics",
			"technicalSolution" : ""
		},
		{
			"title" : "Inversion of button/link semantics",
			"detail" : "A button is not a link and/or vice versa.",
			"solution" : "A button acts within the same page (opening a modal, sorting or filtering results, etc.) while a link changes URL (intra-page anchor, page change, etc.).\n Use <button> tags or <input type=\"button\"> for buttons and the <a> tag for links.",
			"technicalSolution" : ""
		},
		{
			"title" : "Text without semantics",
			"detail" : "Textual content is not included in a semantic tag. Without appropriate semantics, a text has no meaning in the structure of the document for technical assistance users.",
			"solution" : "Add the appropriate semantic structure to textual content, for example, a paragraph <p>, a quote <q>, <blockquote>…\n Note: <div> and <span> are not semantic tags",
			"technicalSolution" : ""
		}
    ],
    "testID-021":[
        {
			"title" : "The lang attribute is missing",
			"detail" : "A lang attribute must be present on the HTML element. In addition, the value of the attribute must correspond to the main language of the document.",
			"solution" : "",
			"technicalSolution" : "<html lang=\"en\" >"
		},
		{
			"title" : "The value of the lang attribute is wrong",
			"detail" : "The value of the attribute must match the main language of the document.",
			"solution" : "If english is the main language of the document, then the value of the attribute will be lang=\"en\"",
			"technicalSolution" : "<html lang=\"en\" >"
		}
    ],
    "testID-022":[
        {
			"title" : "Language change not indicated",
			"detail" : "Words and expressions in foreign languages ​​must be indicated to users.",
			"solution" : "Add a lang attribute to foreign language terms",
			"technicalSolution" : "<q lang=\"fr\">[…]</q>"
		}
    ],
    "testID-023":[
        {
			"title" : "Row or column headers semantics are missing",
			"detail" : "Headers are required to identify the nature of the columns and / or rows",
			"solution" : "The column header cells must have a semantics of TH + a scope=\"col\" attribute. Row header cells must have a semantics of TH + a scope=\"row\" attribute. ",
			"technicalSolution" : "<th scope=\"col\"> / <th scope=\"row\"> "
		},
		{
			"title" : "Presence of a layout table",
			"detail" : "Tables should not be used content layout",
			"solution" : "Add a role=\"presentation\" to the table",
			"technicalSolution" : "<table role=\"presentation\">"
		}
    ],
    "testID-013":[
        {
			"title" : "An ALT attribute is missing",
			"detail" : "All images must have an ALT attribute.",
			"solution" : "Add an ALT attribute to images.",
			"technicalSolution" : "<img alt=\"[…]\" […]> "
		},{
			"title" : "The ALT attribute of an image within a link is not filled in or not relevant",
			"detail" : "The content of the ALT attribute of each clickable images is relevant to its linking function.",
			"solution" : "Enter the link target in the ALT",
			"technicalSolution" : "<a href=\"http://mywebsite.com\"><img src=\"[…]\" alt=\"My website\" ></a>"
		},
		{
			"title" : "The ALT attribute of an image that carrying information is not filled in or not relevant",
			"detail" : "The alt attribute of each image is relevant to the role of the image on the page.",
			"solution" : "Enter in the ALT the information carried by the image.",
			"technicalSolution" : ""
		},
		{
			"title" : "The ALT attribute of an image containing text is not filled in or not relevant",
			"detail" : "The ALT attribute includes at least the text of the image.",
			"solution" : "Enter, at least, in the ALT the text displayed in the image.",
			"technicalSolution" : ""
		},
		{
			"title" : "The ALT attribute of a decorative image is not relevant",
			"detail" : "The ALT attribute of a decorative image must be empty, so that the image is ignored by assistive technologies.",
			"solution" : "Fill in an empty alt.",
			"technicalSolution" : "<img src=\"[…]\" alt=\"\" >"
		},
		{
			"title" : "The ALT of a complex image (diagrams, graphs, etc.) is irrelevant",
			"detail" : "",
			"solution" : "For any image description that is too long to be put in an ALT attribute, the description of the images is either present in the page, or, an adjacent link points to an html page containing the description.",
			"technicalSolution" : ""
		},
		{
			"title": "The aria-hidden attribute of a decorative SVG tag is not present",
			"detail": "A decorative SVG image (tag) must have an aria-hidden=\"true\" attribute and a focusable=\"false\" attribute",
			"solution": "Add aria-hidden and focusable attributes in the element's SVG tag.",
			"technicalSolution":
			"<svg aria-hidden=\"true\" focusable=\"false\"> … </svg>\n To know more : \n https://a11y-guidelines.orange.com/en/articles/accessible-svg/"
		},
		{
			"title": "An informative SVG image has no alternative text ",
			"detail": "In the case of an SVG tag containing an informative image, the <svg> element must have::\n - a role=\"img\"\n attribute - a title with either the aria-label attribute or a <title> element linked with the aria-labelledby attribute which takes the identifier (id) of this <title> element.\n - a focusable=\"false\" attribute.\n In the case of an <img> tag with a source image in SVG format, the element must have a role=\"img\" attribute and a relevant ALT",
			"solution": "Add either an ALT attribute or a relevant aria-label attribute to the SVG tag.",
			"technicalSolution": "Example of a <svg> tag:\n <svg role=\"img\" aria-label=\"Process in progress\" focusable=\"false\"></svg> Example of an <img> tag with an image in .svg format \n <img src=\"image.svg\" role=\"img\" alt=\"Accessible name\">\n To know more : https://a11y-guidelines.orange.com/en/articles/accessible-svg/"
		}
    ],
    "testID-062":[
        {
			"title" : "Presence of text as an image",
			"detail" : "Texts must be included in HTML and formatted via CSS.",
			"solution" : "Include texts in HTML and manage the formatting via CSS.",
			"technicalSolution" : ""
		}
    ],
    "testID-014":[
        {
			"title" : "An alternative to Captcha is missing or incorrect",
			"detail" : "An alternative to Captcha doest not tell the user it is a Captcha",
			"solution" : "Put a valid textual alternative for this image, example: \"CAPTCHA (image anti-spam)\" .",
			"technicalSolution" : "<img alt=\"CAPTCHA (image anti-spam)\" […]>"
		}
    ],
    "testID-015":[
        {
			"title" : "An alternative to Captcha is missing",
			"detail" : "Any captcha that is only visual or audio must have an accessible alternative.",
			"solution" : "Provide as an alternative: an audio and visual Captcha, or logical tests (question whose answer is obvious, simple mathematical test…).",
			"technicalSolution" : ""
		}
    ],
    "testID-065":[
        {
			"title" : "A TITLE attribute is missing",
			"detail" : "All frames must have a TITLE attribute to describe their role.",
			"solution" : "Add a TITLE attribute to frames.",
			"technicalSolution" : "<iframe title=\"[…]\">"
		},
		{
			"title": "No relevant TITLE on frames (iframe)",
			"detail": "The frame (iframe) has a TITLE attribute, but this one is not relevant",
			"solution": "Put a relevant TITLE that represents the function of the frame",
			"technicalSolution": "<iframe title=\"Orange 2023 Recap Video\">...</iframe>"
		}
    ],
    "testID-024":[
        {
			"title" : "Insufficient contrast between text and background",
			"detail" : "The contrast must be sufficient to understand the information carried by all the texts.",
			"solution" : "Ensure a contrast of 4.5:1 minimum for texts of normal sizes (less than 24px CSS and 19px CSS bold). Ensure a minimum contrast of 3:1 for large texts (greater than 24px CSS and 19px CSS bold).",
			"technicalSolution" : ""
		},
		{
			"title" : "Insufficient contrast for non-underlined links",
			"detail" : "Non-underlined links must have a sufficient contrast ratio with the surrounding text.",
			"solution" : "Ensure a minimum contrast of 4.5: 1 between an un-underlined link and the surrounding text of normal sizes (less than 24px CSS and 19px CSS in bold). Ensure a minimum 3: 1 contrast between a non-underlined link and the surrounding text of large sizes (greater than 24px CSS and 19px CSS in bold).",
			"technicalSolution" : ""
		}
    ],
	"testID-025": [
		{
			"title": "Only a background or text color is set", 
			"detail": "Either the text color and the background color are defined or none of them is defined", 
			"solution":"",
			"technicalSolution": ""
		}
	],
    "testID-026":[
        {
			"title" : "Insufficient contrast for icons carrying information",
			"detail" : "The contrast must be sufficient to convey the information.",
			"solution" : "Ensure a minimum contrast of 3:1 for icons.",
			"technicalSolution" : ""
		},
		{
			"title" : "Insufficient contrast for interactive components (buttons, radio buttons…)",
			"detail" : "The contrast must be sufficient to convey the information.",
			"solution" : "Ensure a minimum contrast of 3:1 for the different interactive components.",
			"technicalSolution" : ""
		},
		{
			"title" : "Insufficient contrast for states of interactive components (focus, hover…)",
			"detail" : "The contrast must be sufficient to convey the information.",
			"solution" : "Ensure a minimum contrast of 3:1 for the different states of interactive components.",
			"technicalSolution" : ""
		}
    ],
    "testID-027":[
        {
			"title" : "Color is the only way to convey information",
			"detail" : "Color should not be the only means of conveying information: at least one other visual means is available to obtain the same information.",
			"solution" : "Complete the color with explicit text, or other visual information (example: icons use colors, but also different shapes).",
			"technicalSolution" : ""
		}
    ],
	"testID-051":[
		{
			"title" : "Sensory information is the only way to convey information",
			"detail" : "Sensory information (eg: position, size, sound) should not be the only way to provide information.",
			"solution" : "Complete the information with a text, or an explicit message.",
			"technicalSolution" : ""
		}
	],
	"testID-011":[
		{
			"title" : "The visible text on the screen is missing in the accessible name",
			"detail" : "The text of the displayed label (the alternative text or the text of the image visible on the screen) must be present (in first position, if possible) in the name (accessible) of this component.",
			"solution" : "Modify the accessible name of the element to include visible text on the screen, if possible in first position.",
			"technicalSolution" : "Several solutions are available to redefine the accessible name: aria-labelledby, aria-label, title, hidden accessible text."
		}
	],
	"testID-028":[
		{
			"title" : "Presence of link texts that are not understandable in their context",
			"detail" : "The target of a link is not understandable even with its direct context (surrounding text).",
			"solution" : "Add discriminating information in the surrounding text.",
			"technicalSolution" : "The solution depends on the context in which the element is used: \n - element in a paragraph: complete the text of the paragraph (<p> […] </p>) \n - element in a list: complete a item from the list (<ul>, <ol>) \n - element in a table cell: complete the text of the cell (<td> […] </td>) or complete the direct header of the cell (<th> […] </th>)."
		}
	],
	"testID-070": [
		{
			"title" : "Presence of non-explicit links out of context",
			"detail" : "The accessible name of each link should make its purpose clear outside of the page context.",
			"solution" : "Fill in each link accessible name to understand its purpose without referring to the context. Several solutions exist: set up an alternative, modify the link title, add accessible masking text to the title, make the link explicit by adding the context in the link title attribute, use the aria-label or labelledby attribute...",
			"technicalSolution" : " More details&nbsp;: https://a11y-guidelines.orange.com/en/web/develop/common-navigation/#text-of-links-and-buttons-must-be-accessible"
		},
		{
			"title" : "Presence of several identical link labels with different purposes",
			"detail" : "Several links with similar accessible names point to different pages.",
			"solution" : "Set each link accessible name to make it unique and specific. Some possible solutions: set up an alternative, modify the link title, add accessible masking text to the title, make the link explicit by adding context to the link title attribute, use the aria-label or labelledby attribute...",
			"technicalSolution" : " More details&nbsp;: https://a11y-guidelines.orange.com/en/web/develop/common-navigation/#text-of-links-and-buttons-must-be-accessible"
		}
	],
	"testID-071":[
		{
			"title" : "Link title does not contain document name",
			"detail" : "User does not know the name of document he is about to open or download",
			"solution" : "Include document name in link text." ,
			"technicalSolution" : "Example: <a href=\"#\">Download the full 2020 report (PDF, 1.5 <abbr title=\"Mega octets\">Mo</abbr>)</a>.\n More details https://a11y-guidelines.orange.com/en/articles/download-links/#valid-examples"
		},
		{
			"title" : "Link title does not indicate document type",
			"detail" : "The user does not know type of document (doc, mp3, pdf, etc.) he is about to open or download.",
			"solution" : "Show document type in link label.",
			"technicalSolution" : "Example: <a href=\"#\">Download the full 2020 report (PDF, 1.5 <abbr title=\"Mega octets\">Mo</abbr>)</a>.\n More details https://a11y-guidelines.orange.com/en/articles/download-links/#valid-examples"
		},
		{
			"title" : "Link title does not indicate document size",
			"detail" : "Users don't know size of document they are about to open or download.",
			"solution" : "Show document size in link label.",
			"technicalSolution" :"Example: <a href=\"#\">Download the full 2020 report (PDF, 1.5 <abbr title=\"Mega octets\">Mo</abbr>)</a>.\n More details https://a11y-guidelines.orange.com/en/articles/download-links/#valid-examples"
		}
	],
	"testID-072":[
		{
			"title" : "User not notified when a new window or tab opens",
			"detail" : "The user is not informed that the link triggers the opening of a new window or tab.",
			"solution" : "Notify the user of the opening of any new window by indicating it in the title of the link using the words \"(new window)\", e.g., \"Go to orange.com (new window)\".",
			"technicalSolution" :"<a href=\"www.orange.com\" title=\"Go to Orange web site (New window)\">Go to Orange <span class=\"visually-hidden\">(New window)</span></a>.\n More details, see https://a11y-guidelines.orange.com/en/web/develop/common-navigation/#warn-the-user-when-opening-a-new-window"
		}
	],
	"testID-069":[
		{
			"title": "Presence of irrelevant button labels",
			"detail": "The action carried by a button is not understandable.",
				"solution": "Add discriminating information in the text of the buttons.",
		"technicalSolution": "The accessible name of the button must make it possible to understand its function, all or part of the text can be hidden in an accessible way."
		}
	],
	"testID-029":[
		{
			"title" : "No section headings",
			"detail" : "There are no section headings that would allow assistive technologies users to directly access the page content and avoid common elements (e.g., main navigation).",
			"solution" : "Use heading levels (h1…) to define the different page sections.",
			"technicalSolution" : ""
		},
		{
			"title" : "No skip links",
			"detail" : "Skip links that allow direct access to page content to avoid some page elements.",
			"solution" : "Use skip links at the start of the page (first <body> element) to quickly access certain content on your page (main content, form, etc.).",
			"technicalSolution" : ""
		},
		{
			"title" : "No landmarks to structure the page",
			"detail" : "It lacks structure landmarks that would allow users to better understand the page and to be able to skip blocks of content (e.g., going directly to main navigation).",
			"solution" : "Use structure landmarks to define the different page sections (e.g., header, nav, main, article…).",
			"technicalSolution" : ""
		}
	],   
	"testID-073":[
		{
			"title" : "Missing, incomplete and/or inconsistent global semantic structure",
			"detail" : "In order for the structure of a web page to be correctly rendered by technical assistance (e.g., screen reader) and navigation to be facilitated, the appropriate HTML semantic tags (header, footer, main, aside, etc.) must be correctly used.",
			"solution" : "Set up semantic HTML tags that have a consistent semantic meaning with their position in the HTML structure and what they contain.\n These tags must be used alone (without the corresponding ARIA roles) because their support is correctly interpreted in the vast majority of browsers and technical assistance",
			"technicalSolution" : "Structure to use for a page in HTML 5 (for more info, see https://a11y-guidelines.orange.com/en/articles/aria-live-alert/) :\n<header>\n<nav aria-label=\"Main navigation\">[…]</nav>\n</header>\n<main>\n[…]\n</main>\n<aside>\n<p>content related to the main content</p>\n[…]\n</aside>\n<footer>\n<p>footer contents : copyright…</p>\n[…]\n</footer>"
		},
		{
			"title" : "Content is placed outside of semantic HTML tags",
			"detail" : "All the content of the HTML page must be positioned in semantic tags. No element should be placed outside. Thus, technical assistance (e.g., screen reader) will be able to access the page content and render it intelligibly.",
			"solution" : "Place all the content of the page in semantic HTML tags (header, footer, main, aside, etc.)",
			"technicalSolution": "The page content must be entirely placed in a semantic structure (for more info, see https://a11y-guidelines.orange.com/en/articles/aria-live-alert/) :\n<header>\n<nav aria-label=\"Main navigation\">[…]</nav>\n</header>\n<main>\n[…]\n</main>\n<aside>\n<p>content related to the main content</p>\n[…]\n</aside>\n<footer>\n<p>footer contents : copyright…</p>\n[…]\n</footer>"
		}
		],
	"testID-074":[
		{
			"title": "No skip links (at the top of the page)",
			"detail": "The page should contain skip links (at the top of the page) if at least one of the 3 following cases is present: the page is long, the navigation contains a lot of links (several navigation menus, footers acting as a site map, etc.), the page is divided into many distinct parts (portal, dashboard, etc.)",
			"solution": "Add skip links. They are to be gathered at the top of the page and must allow to access the main regions of the page. Examples: 'Go to menu', 'Go to content', 'Go to search'",
			"technicalSolution": "(see https://a11y-guidelines.orange.com/en/articles/skip-links-best-practices/)."
		},
		{
			"title": "Skip links are present but don't work",
			"detail": "The page contains skip links, but they are not functional: they do not allow the user to skip part of the page.",
			"solution": "Make sure that each skip link works. Therefore, each link must:\n 1/ target an HTML element with an id attribute,\n 2/ this element is displayed in the viewport (visible area of the page) and take the keyboard focus.",
			"technicalSolution": "(see https://a11y-guidelines.orange.com/en/articles/skip-links-best-practices/)."
		}
		],
	"testID-030":[
		{
			"title" : "Cannot move the pointer to the content of a tooltip",
			"detail" : "After opening a tooltip, the user cannot move his pointer from the trigger element to the content of the tooltip, without the latter closing.",
			"solution" : "The user must be able to move the mouse pointer from the trigger element to the content of the tooltip without closing it.",
			"technicalSolution" : ""
		}, {
			"title" : "Cannot close additional content (tooltip, popin…) without moving the focus or the pointer",
			"detail" : "After opening additional content, the user cannot close it without having to move the focus or the mouse pointer.",
			"solution" : "Provide a mechanism for users allowing them to close additional content without moving focus or mouse (e.g. closing with the Esc. key).",
			"technicalSolution" : ""
		}
	],
	"testID-031":[
		{
			"title": "A time limit is not controllable by the user",
			"detail": "Any time limit should be user controllable.",
			"solution": "Any time limit must either be removed, or increased up to a minimum of 10 times the default time, or the user is warned at least 20 seconds before the end and can increase the duration merely.",
			"technicalSolution": ""
		}
	],
	"testID-032":[
		{
			"title": "Open popup or modal on focus of an element",
			"detail" : " On focus, no modal or popup should open.",
			"solution" : "",
			"technicalSolution": ""
			},{
			"title": "Form submitted automatically on focus of an element",
			"detail" : "A form is submitted automatically as soon as a form element takes focus (onFocus).",
			"solution" : "A form should be submitted only after activating the submit button (onClick).",
			"technicalSolution": ""
			},{
			"title": "Change of page content on focus",
			"detail" : "A content change occurs without being initiated by the user (onFocus).",
			"solution": "A content change must only take place after the user has  activated (onClick) a link or an action button.",
			"technicalSolution": ""
			},{
			"title": "Opening a new page on focus",
			"detail" : "A new page openning (or new tab) occurs without being initiated by the user (onFocus).",
			"solution": "The openning of a new page (or tab) must only take place after the user has triggered (onClick) on a link.",
			"technicalSolution": ""
		}
	],
	"testID-061": [
		{
			"title": "Form submitted automatically without explicit user validation",
			"detail" : "A form is submitted automatically without user action.",
			"solution" : "A form should be submitted only after activating the submit button (onClick).",
			"technicalSolution": ""
		}, {
			"title": "Form submitted automatically when changing parameters",
			"detail" : "A form is automatically submitted following the modification of the state of a checkbox, a radio button, a choice in a drop-down list...",
			"solution" : "A form should be submitted only after activating the submit button (onClick).",
			"technicalSolution": ""
		}, {
			"title": "Form submitted automatically during data entry",
			"detail" : "A form is automatically submitted after entering data in a field (onInput).",
			"solution" : "A form should be submitted only after activating the submit button (onClick).",
			"technicalSolution": ""
		}
	],
	"testID-033":[
		{
			"title" : "Only one navigation mechanism is present",
			"detail" : "At least 2 navigation mechanisms must be present on the pages.",
			"solution" : "Complete the existing mechanism with a solution listed below: \n - a main navigation menu \n - a table of contents \n - a sitemap \n - a search mechanism \n - a list of links to navigate to across the whole site (footer).",
			"technicalSolution" : ""
		}
	],
	"testID-075":[
		{
			"title": "No current user position system",
			"detail": "The current location of the user must be presented",
			"solution": "Set up a system allowing to locate the user on the site by one of the following means: a navigation menu presenting the current position of the user, a breadcrumb… See https://www .w3.org/TR/2016/NOTE-WCAG20-TECHS-20161007/G63",
			"technicalSolution": "For a breadcrumb solution, see: https://www.w3.org/TR/2016/NOTE-WCAG20-TECHS-20161007/G65"
		},
		{
			"title": "Visual position indication is not contrasted enough",
			"detail": "The visual position indication is not contrasted enough",
			"solution": "Adapt sufficient contrast while respecting the 3:1 ratio",
			"technicalSolution": ""
		},
		{
			"title": "Visual position indication only relies on color",
			"detail": "Visual position indication is only based on color",
			"solution": "Implement an additional means to color",
			"technicalSolution": ""
		},
		{
			"title": "No aria-current attribute",
			"detail": "A visual position indication is present but whithout the presence of an `aria-current` attribute",
			"solution": "Set up an aria-current attribute",
			"technicalSolution": ""
		}
	],
	"testID-034":[
		{
			"title" : "No ARIA roles (status, alert, alertdialog...) or dynamic aria-live regions",
			"detail" : "Alert messages cannot be read by screen readers.",
			"solution" : "Apply an ARIA role (\"status\", \"alert\", \"alertdialog\", etc...) or an attribute \"aria-live\" to the alert message to make it automatically vocalized. Examples: \"\n - <div role=\"status\"> […] </div> \n - <div aria-live=\"assertive\">[…]</div>\"",
			"technicalSolution" : ""
		},
				{ 
			"title" : "Action in progress is not returned to the user", 
			"detail" : "The progression through warning messages is not returned to screen readers.", 
			"solution" : "Apply an ARIA role (\"status\", \"alert\", \"alertdialog\", etc…) or attribute \"aria-live\" on the alert message so that it is automatically vocalized. Examples: \"\n - <div role=\"status\"> […] </div> \n - <div aria-live=\"assertive\">[…]</div>\"", 
			"technicalSolution" : "" 
		} 
	],
	"testID-035":[
		{
			"title" : "A mechanism to stop moving content is missing",
			"detail" : "User must have control of moving content.",
			"solution" : "Provide an accessible mechanism to stop or pause moving content.",
			"technicalSolution" : ""
		}
	],
	"testID-036":[
		{
			"title" : "Presence of rapid flashing",
			"detail" : "Presence of content presenting rapid flashes (more than 3 flashes per second) or the flashes are below the general threshold or red threshold.",
			"solution" : "",
			"technicalSolution" : ""
		}
	],
	"testID-038":[
		{
			"title" : "Presence of keyboard trap",
			"detail" : "Whatever the type of the component, the page or the application, users must be able to access all the content with the keyboard without being trapped.",
			"solution" : "",
			"technicalSolution" : ""
		}
	],
	"testID-039":[
		{
			"title" : "User does not have control of a single key based keyboard shortcut",
			"detail" : "The user does not have control of a keyboard shortcut based on a character : letter (lowercase or uppercase), punctuation, number, or symbol character.",
			"solution" : "The user must be able to:\n - deactivate the shortcut\n - or modify the shortcut to add an extra key to the combination\n - or ensure that the shortcut is active only when taking focus of the component of the interface.",
			"technicalSolution" : ""
		}
	],
	"testID-040":[
		{
			"title" : "Non-logical focus sequence",
			"detail" : "The movement of the focus does not follow a logical reading order.",
			"solution" : "",
			"technicalSolution" : ""
		}
	],
	"testID-041":[
		{
			"title":"Focus indicator is displayed but is not visible enough",
			"detail":"Focus indicator visibility must be sufficient (check contrast and size).",
			"solution":"To modify the focus indicator visibility, you could:\nIncrease the contrast level between the focus indicator and the background color (minimum level 3.1).\nIncrease the size of the focus indicator by changing the outline CSS properties (e.g., outline:2px).",
			"technicalSolution" : ""
		},
		{
			"title":"Focus indicator (outline CSS property) is disabled",
			"detail":"The outline must not be disabled.",
			"solution":"Check that the focus indicator visibility is not disabled in the CSS properties (e.g., outline:none;).",
			"technicalSolution" : ""
		},
		{
		"title" : "Use of color only to show focus",
		"detail" : "Color cannot be the only element to distinguish the focus.",
		"solution" : "Set up another way than changing color for the focus indicator (ex.: shape, size, outline, underline...).",
		"technicalSolution": ""
		},
		{
		"title": "Visualization of the focus is insufficient",
		"detail" : "The contrast of the focus indicator must be sufficiently contrasted (3:1) compare&d with the background of the element",
		"solution": "Ensure a minimum 3:1 contrast for the different interactive components and the focus indicator.",
		"technicalSolution": ""
		}
	],
	"testID-042":[
		{
			"title" : "Truncated or hidden texts",
			"detail" : "Information lost because of truncated or hidden texts when resizing the page (200% zoom text).",
			"solution" : "To solve these issues, it is recommended to use relative units (e.g., %, em, rem) for texts and parent containers (e.g., div, buttons...).",
			"technicalSolution" : ""
		},
		{
			"title" : "Zoom is not allowed",
			"detail" : "The enlargement of the text must be possible on mobile.",
			"solution" : "If a \"<meta name = 'viewport'>\" tag is present: \n - the user-scalable='no' parameter is not present \n - and the maximum-scale parameter is not less than 2",
			"technicalSolution" : ""
		}
	],
	"testID-043":[
		{
			"title" : "Need to scroll horizontally to access information or functions",
			"detail" : "After resizing to 320 px css width, content (informative text or functionality) is hidden and requires horizontal scrolling to be displayed.",
			"solution" : "- apply relative units (em, rem, %) to text containers \n- or use \"min-width\" and \"min-height\" properties instead of \"width\" and \"height\" properties.",
			"technicalSolution" : ""
		},
		{
			"title" : "Need to scroll vertically to access information or functions",
			"detail" : "After resizing to 256 px css height, content (informative text or functionality) is hidden and requires horizontal scrolling to be displayed.",
			"solution" : "- apply relative units (em, rem, %) to text containers \n- or use \"min-width\" and \"min-height\" properties instead of \"width\" and \"height\" properties.",
			"technicalSolution" : ""
		}
	],
	"testID-044":[
		{
			"title" : "Presence of truncated or overlapping texts",
			"detail" : "Contents are truncated or overlapped after applying text spacing properties.",
			"solution" : "Do not impose or inherit an absolute size (px…) to the spacing properties.",
			"technicalSolution" : "- apply relative units (em, rem, %…) to text spacing properties \n - apply relative units (em, rem, %…) to text containers \n - or use properties \"min-width\"and \"min-height\" instead of the \"width\"and \"height\" properties."
		}
	],
	"testID-045":[
		{
			"title" : "Components repeated on several pages, in different orders",
			"detail" : "Components repeated on several pages, do not appear in the same order on some pages.",
			"solution" : "The layout of the components must be homogeneous between all the pages of a site. Components should appear consistently, in the same relative order.",
			"technicalSolution" : ""
		}
	],
	"testID-046":[
		{
			"title" : "Components repeated on several pages, with different titles ",
			"detail" : "Components repeated on several pages, do not have the same title (accessible) name.",
			"solution" : "Components repeated on several pages must have homogeneous names.",
			"technicalSolution" : ""
		}
	],
	"testID-058":[
		{
			"title" : "Reading order is not understandable after CSS deactivation",
			"detail" : "The reading order should allow content to be understood and used when CSS is disabled on the page",
			"solution" : "The order in which elements appear in the HTML code must allow the page content to be understood and used.",
			"technicalSolution" : "https://a11y-guidelines.orange.com/en/web/develop/layout/#decoupling-content-from-interaction-and-presentation"
		}
	],
	"testID-060":[
		{
			"title": "Informational content is not preserved",
			"detail": "After disabling CSS, content carrying information should be preserved. CSS-generated content should be only decorative.",
			 "solution": "No information should be contained in CSS properties (::before, ::after, content:...)",
			 "technicalSolution": ""
		 },
		 {
			 "title": "Information-carrying images are embedded in CSS",
			 "detail": "After disabling CSS, images carrying information must be preserved (text images, button icons). CSS-generated content should be decorative only.",
			 "solution": "No information should be contained in CSS properties (::before, ::after, content:...), images carrying information should not be embedded in CSS background properties" ,
			 "technicalSolution": ""
		 }
	],
	"testID-047":[
		{
			"title" : "An action based on a complex gesture has no alternative",
			"detail" : "Any action based on complex gestures must have an alternative based on a single pointer usage.",
			"solution" : "Example: for a zoom action on a map with a finger pinch, an alternative in the form of <button> [+] and [-] is proposed.",
			"technicalSolution" : ""
		}
	],
	"testID-048":[
		{
			"title" : "An action cannot be undone",
			"detail" : "The action cannot be canceled because it was triggered on the DOWN event.",
			"solution" : "- trigger the action on the UP event\n - for complex components (eg: drag n'drop), the action on the UP is completed by a dialog box giving users the possibility to cancel their action.",
			"technicalSolution" : ""
		}
	],
	"testID-049":[
		{
			"title" : "An action based on a movement of the device or a gesture of the user has no alternative",
			"detail" : "Any action based on a movement of the device must have an alternative.",
			"solution" : "Allow this action to be triggered by another means (eg: add a button in the interface).",
			"technicalSolution" : ""
		}
	],
	"testID-050":[
		{
			"title": "Loss of information during a consultation in portrait or landscape mode",
			"detail" : "Content and functionality must be available in both orientations without loss of information.",
			"solution" : "",
			"technicalSolution": ""
		},
		{
			"title" : "Content display is limited to a single orientation (landscape or portrait)",
			"detail" : "Content cannot be displayed in both available orientations, or a message appears asking to reorient the device.",
			"solution" : "",
			"technicalSolution": ""
		}
	],
	"testID-052":[
		{
			"title" : "A complete transcript is missing",
			"detail" : "A complete transcript (text version of the speech containing all visual and auditory information) must be provided as an alternative to audio or video tracks.",
			"solution" : "Add a complete transcript (text version of the speech containing all visual and auditory information), either directly in the page, or by a link pointing to an html page containing this transcript and this, near the element to be described",
			"technicalSolution" : ""
		}
	],
	"testID-053":[
		{
			"title" : "A complete transcript is missing",
			"detail" : "A complete transcript (text version of the speech containing all visual and auditory information) must be provided as an alternative to audio or video tracks.",
			"solution" : "Add a complete transcript (text version of the speech containing all visual and auditory information), either directly in the page, or by a link pointing to an html page containing this transcript and this, near the element to be described",
			"technicalSolution" : ""
		}
	],
	"testID-057":[
		{
			"title" : "Audio description is missing",
			"detail" : "Audio description is required for videos presenting information in visual form.",
			"solution" : "Adding an audio description is present in addition to the audio track, if necessary. This presents, in text format, the information conveyed only by the image.",
			"technicalSolution" : ""
		}
	],
	"testID-054":[
		{
			"title" : "Captions are missing",
			"detail" : "For any video, captions are available",
			"solution" : "Add captions in text format for all videos. These provide all the informations of the audio track.",
			"technicalSolution" : ""
		}
	],
	"testID-056":[
		{
			"title" : "Captions are missing",
			"detail" : "For any video, captions are available",
			"solution" : "Add captions in text formats for all videos. These provide all the informations of the audio track.",
			"technicalSolution" : ""
		}
	],
	"testID-063":[
		{
			"title" : "Unable to stop an audio or video track",
			"detail" : "Audio or video tracks that autoplay on the page for longer than 3 seconds must be able to be stopped or paused.",
			"solution" : "Provide an easily reachable and accessible mechanism for users to stop or pause audio (e.g., a link placed at the beginning of the TAB position titled ‘pause video’).",
			"technicalSolution" : ""
		},
		{
			"title" : "Unable to mute an audio or video track regardless of the system volume",
			"detail" : "Audio tracks on the page that automatically play longer than 3 seconds must provide a way to mute the sound without being dependent on the system volume.",
			"solution" : "Provide an easily reachable and accessible mechanism for users to control the volume of sounds played for more than 3 seconds (e.g., a link placed at the begining of the TAB position titled 'Mute audio').",
			"technicalSolution" : ""
		}
	],
	"testID-066":[
		{
			"title" : "The state of a component is not perceived with a screen reader",
			"detail" : "The states checked / unchecked, folded / unfolded… are not seen with a screen reader",
			"solution" : "- use native components as a priority (example: use input checkboxes for checkboxes, the state will be managed natively \n - otherwise make sure to apply the ARIA patterns, to ensure correct semantics and management of the states of the components ( cf. attributes aria-expanded, aria-selected…)",
			"technicalSolution" : ""
		}, {
			"title" : "An interactive component cannot be used with a screen reader",
			"detail" : "The features of a component that cannot be used with a screen reader",
			"solution" : "- use native components as a priority (example: use input checkboxes for checkboxes, the state will be managed natively \n - otherwise make sure to apply the ARIA patterns, to ensure correct semantics",
			"technicalSolution" : ""
		}, {
			"title" : "An interactive component does not have an accessible name",
			"detail" : "An interactive component does not have an accessible name",
			"solution" : "Prefer native methods by providing a button label.\n If needed, the accessible name can be modified using the ARIA attributes aria-label and aria-labelledby.",
			"technicalSolution" : ""
		}
	]
}
