[
	{
		"themes": "Formulaire",
		"title": "Chaque élément de formulaire possède-t-il une étiquette&nbsp;?",
		"ID": "testID-001",
		"IDorigin": "testID-001",
		"wcag": [
			"3.3.2 A"
		],
	    "verifier": "<ul><li>Une étiquette est visuellement présente à proximité de chaque élément de formulaire ou sous forme de libellé pour les boutons,</li><li>ou l'élément est accompagné d'un texte qui devient visible à la prise de focus.</li></ul><p>Attention, un <code>placeholder</code> seul ne suffit pas à fournir une étiquette visible. Il doit être accompagné par un texte persistant à proximité de l'élément de formulaire.</p><p>Lorsque l'élément de formulaire n'a pas de libellé visible mais que son rôle est évident (exemple : champ de recherche accompagné d'un bouton en forme de loupe, case à cocher pour sélectionner une ligne dans un tableau de données), c'est une exception et le critère est conforme, sous réserve que l'élément qui tient lieu d'étiquette visible soit lui-même accessible. Par exemple, un bouton loupe doit avoir une alternative textuelle.</p>",
		"complement": "<h5>Complément d'information</h5><ul><li>La pertinence de l'étiquette et du message d'erreur (<abbr>WCAG</abbr> 2.4.6 Headings and Labels) est à évaluer à la question&nbsp;: <a href=#headingtestID-071>Chaque étiquette et légende de formulaire est-elle pertinente&nbsp;</a></li><li>Le lien sémantique entre élément de formulaire et étiquette/message d'erreur (<abbr>WCAG</abbr>  1.3.1 Info and Relationships) est à évaluer à la question <a href=#headingtestID-072>Chaque élément de formulaire a-t-il un nom accessible ?</a></li><li>La présence d'un nom ou d'une description accessible (<abbr>WCAG</abbr>4.1.2 Name, Role, Value) est à évaluer à la question <a href=#headingtestID-072>Chaque élément de formulaire a-t-il un nom accessible ?</a></li></ul>",
		"group": "Elément de formulaire",
		"resultatTest": "nt",
		"priority": "P0",
		"goodPractice": false,
		"moreInfo": "https://a11y-guidelines.orange.com/fr/mobile/ios/conception/#formulaire"
	},
    {
		"themes": "Formulaire",
		"title": "Chaque étiquette et légende de formulaire est-elle pertinente&nbsp;?",
		"ID": "testID-071",
		"IDorigin": "testID-071",
		"wcag": [
			"2.4.6 AA"
		],
		"verifier": "<ul><li>L'étiquette de chaque élément de formulaire doit être pertinente.</li><li>Si un format de donnée est indiqué, il doit être pertinent.</li><li>Si des éléments de formulaire sont regroupés, vérifier également que la légende est pertinente.</li><li>Si l'étiquette visible est doublée par un nom accessible, alors le nom accessible doit contenir au moins l'intitulé visible</li></ul>",
		"complement": "<h5>Complément d'information</h5><p>Ce test concerne la pertinence de l'<strong>étiquette visible</strong> et non celle du nom accessible de l'élément, qui sera évalué à la question <a href=#headingtestID-072>Chaque élément de formulaire a-t-il un nom accessible ?</a></p>",
		"exception": "<p>La présence d'une étiquette ou d'une légende visible n'est pas obligatoire (exemple&nbsp;: un champ de recherche unique avec un bouton en forme de loupe). En cas d'absence, c'est une exception et le critère est non-applicable.</p>",
		"group": "Elément de formulaire",
		"resultatTest": "nt",
		"priority": "P0",
		"goodPractice": false,
		"moreInfo": "https://a11y-guidelines.orange.com/fr/mobile/ios/conception/#formulaire"
	},
    {
		"themes": "Formulaire",
		"title": "Chaque élément de formulaire a-t-il un nom accessible&nbsp;?",
		"ID": "testID-072",
		"IDorigin": "testID-072",
		"wcag": [
			"1.3.1 A",
			"4.1.2 A"
		],
		"verifier": "<p>À l'aide du lecteur d'écran ou du contrôle vocal, vérifier que le nom accessible de chaque élément de formulaire est cohérent avec son étiquette visible.</p>",
		"complement": "<h5>Complément d'information</h5><p>Un <code>placeholder</code> seul ne suffit pas à fournir une étiquette visible, il doit être accompagné par un texte persistant à proximité de l'élément de formulaire.</p>",
		"group": "Elément de formulaire",
		"resultatTest": "nt",
		"priority": "P0",
		"goodPractice": false,
		"moreInfo": "https://a11y-guidelines.orange.com/fr/mobile/ios/developpement/#grouper-des-elements"
	},
	{
		"themes": "Formulaire",
		"title": "Les éléments de formulaire sont-ils regroupés lorsque nécessaire&nbsp;?",
		"ID": "testID-002",
		"IDorigin": "testID-002",
		"wcag": [
			"1.3.1 A"
		],
		"verifier": "<p>Les champs liés doivent être regroupés lorsque nécessaire.</p><p>A l'aide du lecteur d'écran, vérifier que le nom du groupe est restitué au moins sur le premier élément du regroupement.</p>",
		"complement": "<h5>Complément d'information</h5><p>Exemple de regroupement : une liste de boutons radio associés à une même question et regroupés à l'aide de <code>.accessibilityElement(children: .contain)</code>.</p><p><strong>Attention&nbsp;:</strong> La pertinence du nom du groupe (<abbr>WCAG</abbr> 2.4.6 Headings and Labels) est à évaluer au niveau de la question&nbsp;: <a href=#headingtestID-071>Chaque étiquette et légende de formulaire est-elle pertinente&nbsp;</a></p>",
		"group": "Elément de formulaire",
		"resultatTest": "nt",
		"priority": "P2",
		"goodPractice": false,
		"moreInfo": "https://a11y-guidelines.orange.com/fr/mobile/ios/developpement/#grouper-des-elements"
	},
	{
		"themes": "Formulaire",
		"title": "Les éléments de formulaire obligatoires sont-ils visuellement identifiables&nbsp;?",
		"ID": "testID-003",
		"IDorigin": "testID-003",
		"wcag": [
			"3.3.2 A"
		],
		"verifier": "<ul><li>Un texte ou un élément graphique (autre que la couleur) doit être présent pour indiquer qu'un élément de formulaire est obligatoire.</li><li>Un texte, situé en début de formulaire, doit expliciter l'élément visuel de champ obligatoire.</li><li>Vérifier que l'obligation du champ est bien vocalisée avec la navigation vocale.</li></ul><p>Le critère est également applicable si la majorité des champs d'un formulaire est obligatoire, à l'exception de quelques champs optionnels. Il est alors possible d'identifier visuellement les champs optionnels.</p>",
		"group": "Elément de formulaire",
		"complement":"<p><strong>Attention&nbsp;:</strong> La pertinence de la mention obligatoire (<abbr>WCAG</abbr> 2.4.6 Headings and Labels) est à évaluer au niveau de la question&nbsp;: <a href=#headingtestID-071>Chaque étiquette et légende de formulaire est-elle pertinente&nbsp;</a></p>",
		"exception":"<p>Le critère est non-applicable si le caractère obligatoire d'un champ est évident et pour lequel l'élément visuel devient donc facultatif (ex: champ de recherche, inscription à une newsletter, identifiant / mot de passe).</p>",
		"resultatTest": "nt",
		"priority": "P1",
		"goodPractice": false,
		"moreInfo": "https://a11y-guidelines.orange.com/fr/web/developper/formulaires/"
	},
		{
		"themes": "Formulaire",
		"title": "Les éléments de formulaire obligatoires sont-ils programmatiquement identifiables&nbsp;?",
		"ID": "testID-078",
		"IDorigin": "testID-078",
		"wcag": [
			"1.3.1 A"
		],
		"verifier": "<p>L'aspect obligatoire de l'élément de formulaire est présent dans le nom accessible.</p>",
		"group": "Elément de formulaire",
		"complement":"<p><strong>Attention&nbsp;:</strong> La pertinence de la mention obligatoire (<abbr>WCAG</abbr> 2.4.6 Headings and Labels) est à évaluer au niveau de la question&nbsp;: <a href=#headingtestID-071>Chaque étiquette et légende de formulaire est-elle pertinente&nbsp;</a></p>",
		"exception":"<p>Le critère est non-applicable si le caractère obligatoire d'un élément est évident et pour lequel l'identification programmatique devient donc facultative (ex: champ de recherche, inscription à une newsletter, identifiant / mot de passe).</p>",
		"resultatTest": "nt",
		"priority": "P1",
		"goodPractice": false,
		"moreInfo": "https://a11y-guidelines.orange.com/fr/web/developper/formulaires/"
	},
	{
		"themes": "Formulaire",
		"title": "Pour les champs nécessitant un type ou un format de données précis, ce format de données est-il indiqué&nbsp;?",
		"ID": "testID-004",
		"IDorigin": "testID-004",
		"wcag": {
			"0": "3.3.2 A"
		},
		"verifier": "<ul><li>Le format de saisie est présent visuellement, et son positionnement permet de l'associer au champ concerné.</li><li>Le format de saisie reste visible pendant la saisie (ne pas afficher le format attendu dans le <code>placeholder</code>).</li><li>Le format de saisie est présent dans la vocalisation du champ.</li></ul>",
		"group": "Elément de formulaire",
		"complement": "<p><strong>Attention&nbsp;:</strong> La pertinence du format (<abbr>WCAG</abbr> 2.4.6 Headings and Labels) est à évaluer au niveau de la question&nbsp;: <a href=#headingtestID-071>Chaque étiquette et légende de formulaire est-elle pertinente&nbsp;</a></p>",
		"resultatTest": "nt",
		"priority": "P0",
		"goodPractice": false,
		"moreInfo": "https://a11y-guidelines.orange.com/en/web/develop/forms/"
	},
	{
        "themes": "Formulaire",
        "title": "Un remplissage automatique est-il présent pour les champs de saisie destinés à contenir des informations sur l'utilisateur&nbsp;?",
        "ID": "testID-005",
        "IDorigin": "testID-005",
        "wcag": [
            "1.3.5 AA"
        ],
        "verifier": "<ul><li>Pour les champs de saisie destinés à contenir une information sur l'utilisateur (nom, adresse…), vérifier la présence de la propriété <code>textContentType</code>.</li><li>La valeur indiquée pour la propriété <code>textContentType</code> est pertinente au regard du type d'information attendue.</li></ul>",
        "group": "Elément de formulaire",
        "resultatTest": "nt",
        "priority": "P3",
        "goodPractice": false
    },
	{
		"themes": "Formulaire",
		"title": " L'utilisateur peut-il s'authentifier sans utiliser un test s'appuyant sur des fonctions cognitives&nbsp;?",
		"ID": "testID-063",
		"IDorigin": "testID-063",
		"wcag": {
			"0": "3.3.8 AA"
		},
		"verifier": "<p><p>Vérifier qu'aucune étape d'un processus d'authentification par un nom d'utilisateur et un mot de passe ne repose sur un test cognitif, sauf si cette étape fournit :</p><ul><li>une autre méthode d'authentification</li><li>une aide pour effectuer le test cognitif</li><li>un test cognitif qui consiste à reconnaitre des objets (images, vidéo, audio)</li><li>un test cognitif qui consiste à identifier le contenu personnel non textuel (images, vidéo, audio) que l'utilisateur a fourni préalablement au site Web</li></ul><p>La mémorisation d'un nom utilisateur et d'un mot de passe étant un test cognitif, il faut pour satisfaire le critère que la fonction de copier/coller soit autorisée sur ces champs ou que le nom d'utilisateur et le mot de passe soient remplis automatiquement (exemple : gestionnaire de mot de passe).</p><p><strong>Présence d'un système à 2FA</strong>&nbsp;: le code reçu doit pouvoir être copié-collé par l'utilisateur ou bien être rempli automatiquement.</p><p><strong>Présence d'un CAPTCHA</strong>&nbsp;: le mécanisme ne doit pas reposer sur un test cognitif, sauf reconnaissance d'objet et identification d'un contenu personnel non textuel.</p>",		
		"complement":"<h5>Complément d'information</h5><p>Un test cognitif est une tâche qui oblige l'utilisateur à mémoriser, manipuler ou transcrire des informations.</p><p>Dans le cas d'un mot de passe masqué, offrir la possibilité d'afficher en clair les caractères saisis.</p>",
		"group": "Elément de formulaire",
		"resultatTest": "nt",
		"priority": "P1",
		"wcag22" : true,
		"goodPractice": false
	},
	{
		"themes": "Formulaire",  
		"title": "Les éléments en erreur sont-ils identifiables et l'erreur est-elle décrite sous forme de texte et l'erreur est-elle décrite sous forme de texte&nbsp;",
		"ID": "testID-006",
		"IDorigin": "testID-006",
		"wcag": {
			"0": "3.3.1 A"
		},
		"verifier": "<p>Un message d'erreur sous forme de texte visible est présent et identifie spécifiquement chaque champ en erreur</p>",
 		"complement": "<p><strong>Attention&nbsp;:</strong> La pertinence du texte de l'erreur (<abbr>WCAG</abbr> 3.3.3 Error suggestion) est à évaluer au niveau de la question&nbsp;: <a href=#headingtestID-008>Les messages d'erreur et les suggestions sont-ils explicites&nbsp;?</a>.</p><p>Ce critère n'impose aucune méthode particulière d'affichage des erreurs. Selon la situation, il peut être plus judicieux d'indiquer toutes les erreurs au début ou avant un formulaire. Dans d'autres cas, il peut être plus judicieux d'afficher les erreurs directement, avec des messages d'erreur à côté des champs concernés. Les erreurs peuvent également être répertoriées dans une alerte ou une boîte de dialogue.</p>",
		"exception":"Le critère est non-applicable si cela constitue une risque potentiel de sécurité.", 
		"group": "Elément de formulaire",
		"resultatTest": "nt",
		"priority": "P1",
		"goodPractice": false,
		"moreInfo": "https://a11y-guidelines.orange.com/fr/web/developper/formulaires/#detecter-identifier-les-erreurs-et-suggerer-des-corrections"
	},
	{
		"themes": "Formulaire",
		"title": "Les messages d'erreur et les suggestions sont-ils explicites&nbsp;?",
		"ID": "testID-008",
		"IDorigin": "testID-008",
		"wcag": {
			"0": "3.3.3 AA"
		},
        "verifier": "<ul><li>Les messages d'erreur énoncent clairement la nature de l'erreur (exemple&nbsp;: champ téléphone obligatoire, format de l'email invalide…).</li><li>Si besoin, les suggestions de correction aident à la correction des erreurs.</li></ul>",
		"exception": "Le critère est non applicable lorsqu'il est impossible de faire une suggestion ou que l'on ne peut donner de suggestion pour des raisons de sécurité ou parce qu'il s'agit d'une fonctionnalité essentielle.",
		"group": "Elément de formulaire",
		"resultatTest": "nt",
		"priority": "P3",
		"goodPractice": false,
		"moreInfo": "https://a11y-guidelines.orange.com/fr/web/developper/formulaires/#detecter-identifier-les-erreurs-et-suggerer-des-corrections"
	},
	{
		"themes": "Formulaire",
		"title": "Si une information est demandé plusieurs fois à l'utilisateur dans un même processus ou session, sa saisie n'est-elle pas redondante&nbsp;?",
		"ID": "testID-064",
		"IDorigin": "testID-064",
		"wcag": {
			"0": "3.3.7 A"
		},
		"verifier": "<p>Le critère est conforme pour des champs demandant une nouvelle saisie d'une même donnée avec les exceptions suivantes :</p><ul><li>Le format des informations était différent (PDF, Word…)</li><li>Une activité essentielle (exemple : jeu de mémoire) où saisir à nouveau une information est essentiel</li><li>Des informations de sécurité comme la double saisie d'un mot de passe créé par l'utilisateur</li><li>Des informations préalablement renseignées qui ne sont plus valides</li></ul><p>Le critère est non applicable quand aucun champ ne doit être rerempli avec une même donnée préalablement saisie.</p>",
		"complement":"<h5>Complément d'information</h5><p>Exemples de mécanismes valides : alimentation automatique, choix dans un sélecteur déroulant, copier-coller depuis une zone, case à cocher pour reprendre des données préalablement saisies (adresse de facturation égale adresse de livraison)</p>",
		"group": "Elément de formulaire",
		"resultatTest": "nt",
		"priority": "P3",
		"wcag22" : true,
		"goodPractice": false
	},
	{
		"themes": "Formulaire",
		"title": "Pour chaque formulaire sensible, l'utilisateur a-t-il le contrôle de ses données&nbsp;?",
		"ID": "testID-009",
		"IDorigin": "testID-009",
		"wcag": {
			"0": "3.3.4 AA"
		},
		"verifier": "<p>Pour les formulaires avec&nbsp;:<ul><li>modification ou suppression de données propres à l'utilisateur</li><li>transmission de réponse à un test ou un examen</li><li>conséquences financières (achat en ligne) ou juridiques (validation de conditions générales d'utilisation)</li></ul></p><p>Vérifier qu'une de ces conditions est vraie&nbsp;:<ul><li>La soumission de données est réversible.</li><li>Les données saisies par l'utilisateur sont vérifiées afin de détecter d'éventuelles erreurs de saisie et l'utilisateur a la possibilité de les corriger.</li><li>Un mécanisme est disponible pour vérifier, confirmer et corriger les informations avant de finaliser la soumission (par exemple, la validation est explicite avec une case à cocher).</li></ul></p>",
		"group": "Elément de formulaire",
		"resultatTest": "nt",
		"priority": "P0",
		"goodPractice": false
	},
	{
		"themes": "En-têtes",
		"title": "Le titre de la page est-il unique et pertinent&nbsp;?",
		"ID": "testID-010",
		"IDorigin": "testID-010",
		"wcag": {
			"0": "2.4.2 A"
		},
        "verifier": "<ul><li>Le titre de la page est visible.</li><li>Le titre de la page est unique. Une erreur courante est d'utiliser un même titre pour l'ensemble de l'application.</li><li>Le titre de la page permet à l'utilisateur de comprendre le contexte de la page.</li><li>Lorsque le contexte de la page est modifié de manière asynchrone (sans recharger la page&nbsp;: résultats de recherche, validation ou erreur de formulaire, modification dynamique du contenu…), l'utilisateur est notifié de ce changement par modification du titre</li></ul>",
		"resultatTest": "nt",
		"priority": "P0",
		"goodPractice": false,
		"moreInfo": "https://a11y-guidelines.orange.com/fr/mobile/ios/conception/#titre-et-en-tete"
	},
    {
		"themes": "En-têtes",
		"title": "L'information est-elle structurée par l'utilisation d'en-têtes pertinents&nbsp;?",
		"ID": "testID-076",
		"IDorigin": "testID-076",
		"wcag": [
			"2.4.6 AA"
		],
		"verifier": "<p>Les en-têtes doivent être pertinents, aider à comprendre le contenu de la page et décrire précisement la section de contenu qu'elles présentent.</p>",
		"exception":"Le critère est non-applicable si aucun en-tête n'est présent.",
		"priority": "P1",
		"resultatTest": "nt",
		"goodPractice": false,
		"moreInfo": "https://a11y-guidelines.orange.com/fr/web/developper/navigation-generale/#rendre-les-intitules-des-liens-et-des-boutons-accessibles"
	},
	{
		"themes": "Couleurs et contrastes",
		"title": "Le contraste entre la couleur du texte et la couleur de son arrière-plan est-il suffisamment élevé&nbsp;?",
		"ID": "testID-013",
		"IDorigin": "testID-013",
		"wcag": {
			"0": "1.4.3 AA"
		},
		"verifier": "<p>Le contraste est suffisant pour comprendre l'information portée par tous les textes et les textes sous forme d'image.</p><ul><li><strong>Pour les textes non gras :</strong><ul><li>Taille inférieure à <code>18pt</code>&nbsp;: contraste de 4,5:1</li><li>Taille supérieure ou égale à <code>18pt</code>&nbsp;: contraste de 3:1</li></ul></li><li><strong>Pour les textes gras :</strong><ul><li>Taille inférieure à <code>14pt</code>&nbsp;: contraste de 4,5:1</li><li>Taille supérieure ou égale à <code>14pt</code>&nbsp;: contraste de 3:1</li></ul></li><br><li>Vérifier que les états de tous les composants ont un rapport de contraste suffisant, notamment au focus clavier.</li><li>Vérifier le contraste également pour les <code>placeholder</code> informatifs.</li><li>Vérifier en mode clair et en mode sombre.</li></ul>",
		"exception": "<p>Ce critère est non-applicable pour les logos, textes décoratifs et les éléments inactifs.</p>",
		"resultatTest": "nt",
		"priority": "P1",
		"goodPractice": false,
		"moreInfo": "https://a11y-guidelines.orange.com/fr/mobile/ios/conception/#couleurs"
		},
	{
		"themes": "Couleurs et contrastes",
		"title": "Les couleurs utilisées dans les composants d'interface ou dans les éléments graphiques porteurs d'informations sont-elles suffisamment contrastées&nbsp;?",
		"ID": "testID-014",
		"IDorigin": "testID-014",
		"wcag": {
			"0": "1.4.11 AA"
		},
		"verifier": "<p>Les textes sous forme d'images, les graphiques, les icônes, les composants interactifs (ainsi que leurs états focus/hover) et les éléments de formulaire ont un contraste minimum de 3:1 pour transmettre l'information.</p>",
		"exception": "Le critère n'est pas applicable pour les cas suivants&nbsp;:<ul><li>les logos, photos de scènes de la vie réelle (paysages, personnes, etc.), drapeaux, captures d'écran, etc.</li><li>si une alternative (texte de remplacement, une étiquette, une longue description ou un tableau de données), apporte la même information que l'icône ou le graphique</li><li>si le manque de contraste de l'image n'empêche pas la compréhension du contenu ou de sa fonction (liens d'une barre de navigation)</li><li>le manque de contraste est nécessaire pour convoyer l'information</li><li>les composants interactifs inactifs (pas d'action possible)</li><li>les logos, les marques</li><li>éléments dynamiques dont le contraste au survol / focus est suffisant</li><li>les composants dont l'apparence est déterminée par le navigateur et non modifiée par l'applicatif.</li></ul>",
		"resultatTest": "nt",
		"priority": "P1",
		"goodPractice": false,
		"moreInfo": "https://a11y-guidelines.orange.com/fr/mobile/ios/conception/#couleurs"
	},
	{
		"themes": "Couleurs et contrastes",
		"title": "L'information est-elle également transmise à l'utilisateur par un autre moyen que par la couleur&nbsp;?",
		"ID": "testID-015",
		"IDorigin": "testID-015",
		"wcag": {
			"0": "1.4.1 A"
		},
		"verifier": "<p>La couleur n'est pas le seul moyen de convoyer une information&nbsp;:</p><ul><li>l'information peut également être obtenue par un texte</li><li>au moins un autre moyen visuel est disponible pour obtenir la même information (exemple&nbsp;: des icônes qui utilisent des couleurs, mais également des formes différentes)</li><li>si le contenu est transmis par l'utilisation de couleurs qui diffèrent non seulement par leur teinte, mais qui présentent également une différence significative en termes de luminosité (par exemple vert clair et rouge foncé), cela constitue alors une distinction visuelle supplémentaire.</li></ul><p>Cas particulier d'un lien ou bouton sans mise en forme dans du texte :</p><ul><li>le lien ou bouton doit avoir un contraste de 3:1 avec le texte environnant</li><li>et un indicateur, ne reposant pas sur la couleur, doit permettre de le distinguer lors de la prise de focus (ex : souligné)</li></ul>",
		"exception": "<p>Le critère est non-applicable pour les cas suivants :</p><ul><li>les liens dont la nature est explicite, exemple des liens présent dans les zones de navigation (en-tête et pied de page, menu ou liste de liens…)</li><li>si aucune information n'est portée par de la couleur</li></ul>",
		"resultatTest": "nt",
		"priority": "P2",
		"goodPractice": false
	},
	{
		"themes": "Couleurs et contrastes",
		"title": "L'information est-elle également transmise à l'utilisateur par un autre moyen qu'une caractéristique sensorielle&nbsp;?",
		"ID": "testID-016",
		"IDorigin": "testID-016",
		"wcag": {
			"0": "1.3.3 A"
		},
		"verifier": "<p>L'information transmise par une caractéristique sensorielle (forme, taille, position, orientation, son) doit également être obtenue par un texte ou un message explicite.</p><p><strong>Exemples de non conformités :</strong></p><ul> <li>Identification d'une information uniquement par sa position : \" pour aller à l'écran suivant appuyez sur le bouton à droite \", ou \" choisissez un des boutons affichés au-dessus de l'image pour en savoir plus \"</li> <li>Identification d'une information uniquement par sa forme visuelle ou un symbole graphique : \" Appuyez sur le bouton rond pour quitter \"</li></ul>",
		"exception": "<p>Le critère est non-applicable si aucune information n'est portée par le son, l'orientation, la taille, la forme ou la position</p>",
		"resultatTest": "nt",
		"priority": "P2",
		"goodPractice": false,
		"moreInfo": "https://a11y-guidelines.orange.com/fr/mobile/ios/conception/#alternative-textuelle"
	},
	{
		"themes": "Agrandissement de texte",
		"title": "Le texte peut-il être agrandi sans perte de contenu ou de fonctionnalité&nbsp? ",
		"ID": "testID-017",
		"IDorigin": "testID-017",
		"wcag": {
			"0": "1.4.4 AA"
		},
		"verifier": "<ul><li>Sur iOS, après agrandissement du texte à 235%, les textes de taille \"standard\" doivent s'agrandir conformément aux réglages natifs (ex. texte 17pt agrandi à 40pt d'après les spécifications Apple).</li><li>Le contenu est présenté sans perte d'information ni de fonctionnalité (contenu tronqué, masqué ou superposé) et sans nécessité de défilement dans les deux dimensions.</li></ul>",
		"complement": "<h5>Complément d'information</h5><ul><li>Certains textes comme les titres peuvent être agrandis de moins de 200% en fonction de leur taille d'origine (ex. titre 28pt agrandi à 48pt d'après les spécifications Apple)</li><li>De même, certains éléments natifs tels que la barre d'onglets peuvent ne pas s'agrandir (limitation de l'OS).</li></ul>",
		"resultatTest": "nt",
		"priority": "P2",
		"exception": "<p>Critère non-applicable pour les sous-titres et textes sous forme d'image.</p>",
		"goodPractice": false,
		"moreInfo": "https://a11y-guidelines.orange.com/fr/mobile/ios/developpement/#taille-des-textes"
	},
	{
		"themes": "Navigation vocale",
		"title": "Les éléments non-textuels signifiants sont-ils tous vocalisés et pertinents&nbsp;? ",
		"ID": "testID-018",
		"IDorigin": "testID-018",
		"wcag": {
			"0": "1.1.1 A"
		},
		"verifier": "<p>Tous les éléments non-textuels signifiants sont vocalisés et accessibles en utilisant la navigation vocale : </p><ul><li>Chaque élément non-textuel porteur d'information est vocalisé de façon pertinente.</li><li>Les images contenant du texte ont une alternative reprenant au moins le texte visible.</li><li>Les images complexes ont une alternative détaillée fournie par un contenu adjacent.</li><li>Chaque élément non-textuel interactif est restitué au moins par un nom pertinent.</li><li>Les contenus multimédias pré-enregistrés sont facilement identifiables (par une alternative pertinente ou un contenu textuel adjacent).</li></ul>",
		"complement": "<h5>Complément d'information</h5><ul><li>Si le contenu non textuel est un test ou un exercice qui serait invalide s'il était présenté sous forme de texte, alors l'alternative fournit au moins une description succinte de ce contenu.</li><li>Si le contenu non textuel est principalement destiné à créer une expérience sensorielle spécifique, alors l'alternative textuelle fournit au moins une description succinte de ce contenu.</li></ul>",
		"resultatTest": "nt",
		"priority": "P0",
		"goodPractice": false,
		"moreInfo": "https://a11y-guidelines.orange.com/fr/mobile/ios/developpement/#nature-des-elements"
	},
		{
		"themes": "Navigation vocale",
		"title": "Les éléments décoratifs sont-ils ignorés par la navigation vocale&nbsp;? ",
		"ID": "testID-026",
		"IDorigin": "testID-026",
		"wcag": {
			"0": "1.1.1 A"
		},
		"verifier": "<p>Les éléments graphiques décoratifs ne sont pas vocalisés.</p>",
		"resultatTest": "nt",
		"priority": "P0",
		"goodPractice": false,
		"moreInfo": "https://a11y-guidelines.orange.com/fr/mobile/ios/conception/#images"
	},
	{
		"themes": "Navigation vocale",
		"title": "Le nom, le rôle et l'état de chaque composant d'interface sont-ils vocalisés&nbsp;?",
		"ID": "testID-024",
		"IDorigin": "testID-024",
		"wcag": {
			"0": "4.1.2 A"
		},
		"verifier": "<ul><li>Le nom et le rôle de chaque composant d'interface (bouton, lien, case à cocher, élément de formulaire, etc.) est correctement restitué.</li><li>L'état ou la valeur de chaque composant d'interface est vocalisé (\"sélectionné\", \"coché\", etc).</li><li>Chaque composant d'interface est vocalisé avec l'action associée.</li></ul>",
		"resultatTest": "nt",
		"priority": "P0",
		"goodPractice": false,
		"moreInfo": "https://a11y-guidelines.orange.com/fr/mobile/ios/developpement/#nature-des-elements"
	},
	{
		"themes": "Navigation vocale",
		"title": "Le nom accessible de chaque composant contient-il au minimum le libellé visible à l'écran&nbsp;?",
		"ID": "testID-051",
		"IDorigin": "testID-051",
		"wcag": {
			"0": "2.5.3 A"
		},
		"verifier": "<p>Le libellé visible de l'élément est présent dans la vocalisation de ce composant.</p>",
		"complement": "<h5>Complément</h5><p>Il est recommandé de restituer le contenu du libellé visible en premier dans le nom accessible. Exemple : pour un lien \"démarrer\", mettre une alternative \"démarrer la lecture\", mais pas \"lancer la lecture\"</p>",
        "resultatTest": "nt",
		"priority": "P1",
		"goodPractice": false,
		"exception": "<p>Le critère est non-applicable si l'élément n'a pas de libellé visible (icône sans texte par exemple).</p>"
	},
	{
		"themes": "Navigation vocale",
		"title": "Les éléments visibles sont-ils les seuls à être vocalisés&nbsp;? ",
		"ID": "testID-025",
		"IDorigin": "testID-025",
		"wcag": {
			"0": "1.1.1 A"
		},
		"verifier": "<p>Il n'y a aucun élément invisible restitué par le lecteur d'écran.</p>",
		"resultatTest": "nt",
		"priority": "P1",
		"goodPractice": false,
		"moreInfo": "https://a11y-guidelines.orange.com/fr/mobile/ios/developpement/#vue-modale"
	},
	{
		"themes": "Navigation vocale",
		"title": "L'ordre de vocalisation des éléments est-il logique et compréhensible&nbsp;? ",
		"ID": "testID-019",
		"IDorigin": "testID-019",
		"wcag": {
			"0": "1.3.2 A"
		},
		"verifier": "<p>Les éléments doivent suivre un ordre logique et compréhensible en utilisant la navigation vocale. L'organisation des informations et en particulier le regroupement visuel d'éléments doivent être restitués de manière cohérente et compréhensible.</p><p>La disposition spécifique d'un contenu est traitée par le critère 1.3.1.</p>",
		"resultatTest": "nt",
		"priority": "P1",
		"goodPractice": false,
		"moreInfo": "https://a11y-guidelines.orange.com/fr/mobile/ios/developpement/#ordre-de-lecture"
	},
	{
		"themes": "Navigation vocale",
		"title": "Les titres ou en-têtes sont-ils exploités lors de la navigation vocale par en-têtes&nbsp;? ",
		"ID": "testID-022",
		"IDorigin": "testID-022",
		"wcag": {
			"0": "1.3.1 A"
		},
		"verifier": "<p>À l'aide du lecteur d'écran et en mode de navigation par en-tête :</p><ul><li>tous les titres ou en-têtes sont navigables et vocalisés.</li><li>seuls les titres ou en-têtes sont navigables et vocalisés.</li></ul>",
		"resultatTest": "nt",
		"priority": "P3",
		"goodPractice": false,
		"moreInfo": "https://a11y-guidelines.orange.com/fr/mobile/ios/developpement/#nature-des-elements"
	},
	{
		"themes": "Navigation vocale",
		"title": "Les messages d'état ou contextuels sont-ils correctement restitués&nbsp;?",
		"ID": "testID-049",
		"IDorigin": "testID-049",
		"wcag": {
			"0": "4.1.3 AA"
		},
		"verifier": "<ul><li>Chaque message d'état sans déplacement du focus (voir les exemples ci-dessous) est restitué par le lecteur d'écran (mécanisme reposant sur les annonces ou les <span lang=\"en\">live regions</span>).</li><li>Chaque message d'état est restitué de façon pertinente.</li><li>Dans le cas d'un message d'état non permanent et dont la disparition apporte une information (par exemple un état 'occupé' ou 'en attente' qui disparait dès la disponibilité du service), cet état doit également être restitué.</li></ul>",
        "complement": "<h4>Exemples de message d'état</h4><ul><li>résultat d'une recherche</li><li>état de l'application (par ex. hors-ligne)</li><li>message d'erreur</li><li>message indiquant la progression</li><li>notification</li><li>message suite à l'ajout d'un produit dans un panier</li></ul>",
        "resultatTest": "nt",
		"priority": "P2",
		"goodPractice": false,
		"moreInfo": "https://a11y-guidelines.orange.com/fr/mobile/ios/developpement/#declencher-une-vocalisation"
	},
	{
		"themes": "Navigation vocale",
		"title": "Les éléments présentés sous forme de liste sont-ils correctement restitués&nbsp;?",
		"ID": "testID-021",
		"IDorigin": "testID-021",
		"wcag": {
			"0": "1.3.1 A"
		},
		"verifier": "<p>Les éléments présentés sous forme de liste sont restitués en tant que liste ou de manière à comprendre une structure de liste.</p>",
		"complement": "<h5>Complément d'information</h5><p>Une liste peut-être utilisée pour présenter des éléments non-ordonnés (par exemple une liste d'ingrédients pour une recette de cuisine) ou ordonnés (par exemple une succession d'étapes précises à suivre)</p>",
		"resultatTest": "nt",
		"priority": "P2",
		"goodPractice": false
	},
	{
		"themes": "Navigation vocale",
		"title": "Les tableaux sont-ils correctement structurés&nbsp;?",
		"ID": "testID-070",
		"IDorigin": "testID-070",
		"wcag": [
			"1.3.1 A"
		],
		"verifier": "<p>Pour les tableaux de données :</p><ul><li>Si un titre est présent, vérifier que celui-ci est restitué au lecteur d'écran et est pertinent (permet d'identifier la nature des données présentées dans le tableau).</li><li>Si le tableau est complexe, un résumé doit être présent et pertinent (permet de comprendre la nature des données et la construction du tableau).</li><li>Les en-têtes ne doivent pas être vides.</li><li>Les en-têtes de lignes et de colonnes doivent être correctement restitués et reliés aux cellules de données.</li></ul>",
		"priority": "P2",
		"resultatTest": "nt",
		"goodPractice": false,
		"moreInfo": "https://a11y-guidelines.orange.com/fr/mobile/ios/developpement/#ordre-de-lecture"
	},
	{
		"themes": "Navigation vocale",
		"title": "Le contenu de la page est-il restitué dans la langue principale de la page&nbsp;?",
		"ID": "testID-060",
		"IDorigin": "testID-060",
		"wcag": {
			"0": "3.1.1 A"
		},
		"verifier": "<p>Le lecteur d'écran restitue les contenus textuels dans la langue principale de la page.</p>",
		"group": "Navigation vocale",
		"resultatTest": "nt",
		"priority": "P3",
		"goodPractice": false
	},
    {
		"themes": "Navigation vocale",
		"title": "Les changements de langues sont-ils indiqués&nbsp;?",
		"ID": "testID-058",
		"IDorigin": "testID-058",
		"wcag": {
			"0": "3.1.2 AA"
		},
		"verifier": "<p>Le lecteur d'écran change de langue pour les contenus textuels dont la langue ne correspond pas à la langue principale de la page</p>",
		"exception": "<p>Il n'est pas nécessaire d'indiquer de changement de langue pour les mots ou expressions en langue étrangère passés dans l'usage courant (newsletter, week-end, etc.) ou les noms propres (Google, Apple, etc.)</p>",
		"group": "Navigation vocale",
		"resultatTest": "nt",
		"priority": "P3",
		"goodPractice": false
	},
	{
		"themes": "Navigation vocale",
		"title": "Les changements de sens de lecture sont-ils signalés&nbsp;?",
		"ID": "testID-020",
		"IDorigin": "testID-020",
		"wcag": {
			"0": "1.3.2 A"
		},
		"verifier": "<p>Vérifier que les changements de sens de lecture (RTL : <span lang=\"en\">Right-To-Left</span>) sont restitués correctement par le lecteur d'écran.</p>",
		"priority": "P3",
		"resultatTest": "nt",
		"goodPractice": false
	},
	{
		"themes": "Navigation vocale",
		"title": "Un mécanisme pour naviguer rapidement au sein de la page est-il présent&nbsp;?",
		"ID": "testID-059",
		"IDorigin": "testID-059",
		"wcag": {
			"0": "2.4.1 A"
		},
		"verifier": "<p>Si cela est jugé nécessaire, l'application doit proposer une navigation rapide à l'aide de la fonction Rotor de Voice Over, par exemple : </p><ul><li>navigation par en-têtes</li><li>navigation par liens</li><li>navigation par conteneur</li><li>navigation par champs de formulaire</li><li>ou tout autre moyen de navigation spécifique</li></ul>",
		"group": "Navigation vocale",
		"resultatTest": "nt",
		"priority": "P1",
		"goodPractice": false
	},
	{
		"themes": "Contrôle de sélection et navigation clavier",
		"title": "Les fonctionnalités de l'écran sont-elles utilisables avec le contrôle de selection ou avec un clavier externe&nbsp;?",
		"ID": "testID-027",
		"IDorigin": "testID-027",
		"wcag": {
			"0": "2.1.1 A"
		},
		"verifier": "<ul><li>Toutes les fonctionnalités disponibles en tactile le sont aussi avec le Contrôle de Sélection et avec l'Accès Complet au Clavier (directement ou au travers une alternative)</li><li>Il est possible de faire défiler le contenu dans une vue de défilement (<span lang=\"en\">ScrollView)</span></li></ul>",
		"resultatTest": "nt",
		"priority": "P0",
		"goodPractice": false,
		"moreInfo": "https://a11y-guidelines.orange.com/fr/mobile/ios/developpement/#controle-de-selection"
	},
	{
		"themes": "Contrôle de sélection et navigation clavier",
		"title": "L'écran ne contient pas de piège clavier&nbsp;?",
		"ID": "testID-028",
		"IDorigin": "testID-028",
		"wcag": {
			"0": "2.1.2 A"
		},
		"verifier": "<p>L'écran ne contient aucun piège :</p><ul><li>en navigation au clavier si le focus arrive sur un élément, l'utilisateur doit pouvoir sortir de cet élément en utilisant les touches standards (échap, entrée, flèches...).</li><li>avec le contrôle de selection, le focus ne doit pas rester bloqué au sein d'un conteneur.</li></ul><p>Si le focus semble piégé dans un composant, il doit y avoir une information expliquant la procédure pour sortir (avec clavier et contrôle de sélection)</p>",
		"resultatTest": "nt",
		"priority": "P0",
		"goodPractice": false
	},
	{
		"themes": "Contrôle de sélection et navigation clavier",
		"title": "Si un raccourci clavier utilisant un seul caractère imprimable est disponible, celui-ci est-il contrôlable par l'utilisateur&nbsp;?",
		"ID": "testID-075",
		"IDorigin": "testID-075",
		"wcag": {
			"0": "2.1.4 A"
		},
		"verifier": "<p>Au moins une des conditions ci-dessous est respectée :</p><ul><li>le raccourci peut être désactivé par l'utilisateur</li><li>le raccourci est actif uniquement à la prise de focus du composant de l'interface</li><li>le raccourci peut être modifié, avec la possibilité d'ajouter un ou plusieurs caractères non-imprimables (<kbd>Ctrl</kbd>, <kbd>Alt</kbd>, <kbd>Maj</kbd>,…) à la combinaison</li></ul>",
		"exception": "<p>Le critère n'est pas applicable aux raccourcis clavier utilisant une touche de modification (touche de caractère non imprimables, exemple : <kbd>Ctrl</kbd>, <kbd>Alt</kbd> ou <kbd>Shift</kbd>).</p>",
		"resultatTest": "nt",
		"priority": "P0",
		"goodPractice": false
	},
	{
		"themes": "Contrôle de sélection et navigation clavier",
		"title": "L'ordre de prise de focus des éléments est-il logique et cohérent&nbsp;?",
		"ID": "testID-029",
		"IDorigin": "testID-029",
		"wcag": {
			"0": "2.4.3 A"
		},
		"verifier": "<p>L'ordre de prise de focus des éléments (boutons, liens, champs de formulaires) est cohérent et logique (souvent équivalent à l'ordre visuel) avec le contrôle de selection et avec un clavier externe.</p>",
		"moreInfo": "https://a11y-guidelines.orange.com/fr/mobile/ios/developpement/#ordre-de-lecture",
		"resultatTest": "nt",
		"priority": "P3",
		"goodPractice": false
	},
	{
		"themes": "Contrôle de sélection et navigation clavier",
		"title": "Le focus est-il présent et suffisamment visible&nbsp;?",
		"ID": "testID-030",
		"IDorigin": "testID-030",
		"wcag": {
			"0": "2.4.7 AA"
		},
		"verifier": "<ul><li>Le focus est visible d'un coup d'oeil et il se distingue bien du reste de l'écran.</li><li>Si besoin, vérifier le ratio de contraste du focus qui doit être au moins de 3:1 par rapport à la couleur environnante. Si besoin, modifier l'aspect du focus via les paramètres de réglages du clavier.</li></ul>",
		"complement": "<h5>Complément</h5><p>Sur iOS, il n'est pas possible de modifier programmatiquement l'aspect du focus mais il est possible de modifier la couleur d'un composant recevant le focus, en utilisant la méthode Swift <a href='https://developer.apple.com/documentation/objectivec/nsobject-swift.class/accessibilityelementdidbecomefocused()/'>accessibilityElementDidBecomeFocused</a> ou la propriété SwiftUI <a href='https://developer.apple.com/documentation/swiftui/accessibilityfocusstate'>accessibilityfocusstate</a>.</p>",
		"resultatTest": "nt",
		"priority": "P1",
		"goodPractice": false
	},
	{
		"themes": "Contrôle de sélection et navigation clavier",
		"title": "Le focus est-il visible sur tous les éléments&nbsp;?",
		"ID": "testID-061",
		"IDorigin": "testID-061",
		"wcag": {
			"0": "2.4.11 AA"
		},
		"verifier": "<p>Le composant recevant le focus n'est pas complètement masqué par du contenu de la page lors de la navigation clavier.</p>",
		"complement": "<h5>Complément</h5><ul><li>Lorsque le contenu d'une interface configurable peut être repositionné par l'utilisateur, seules les positions initiales du contenu déplaçable par l'utilisateur sont prises en compte pour les tests et la conformité à ce critère de réussite.</li><li>Le contenu ouvert par l'utilisateur peut masquer le composant recevant le focus. Si l'utilisateur peut révéler le composant ciblé sans déplacer le focus, le composant avec le focus n'est pas considéré comme masqué en raison du contenu créé par l'auteur.</li><li>Si le composant qui reçoit le focus est recouvert par un autre élément dont l'opacité est inférieure à 100 % alors l'élément qui reçoit le focus n'est pas totalement masqué et le critère est validé.</li></ul>",
		"resultatTest": "nt",
		"priority": "P1",
		"wcag22" : true,
		"goodPractice": false
	},
	{
		"themes": "Navigation générale",
		"title": "L'utilisateur a-t-il le contrôle des changements de contexte lors de la prise de focus ?",
		"ID": "testID-038",
		"IDorigin": "testID-038",
		"wcag": {
			"0": "3.2.1 A"
		},
		"verifier": "<p>Lors de la prise de focus d'un élément, vérifier l'absence de changement de contexte sans avertissement de l'utilisateur.</p>",
		"complement": "<h5>Changement de contexte</h5><p>Changement majeur dans le contenu de l'écran qui, lorsqu'il est effectué à l'insu de l'utilisateur, peut désorienter.</p><p>Les changements de contexte incluent les changements de&nbsp;:</p><ul><li>agent utilisateur (ouverture d'une autre application)</li><li><span lang=\"en\">viewport</span>(ouverture d'un nouvel écran, autre partie de l'écran affiché)</li><li>focus (déplacement du focus)</li><li>contenu qui modifie le sens de l'écran</li></ul>",
		"exception": "<p>Le critère est non-applicable si, à la prise de focus, le contexte ne change pas. Par exemple, l'apparition d'un menu ou encore la modification visuelle lors du survol d'un lien ne sont pas des changements de contexte.</p>",
		"resultatTest": "nt",
		"priority": "P3",
		"goodPractice": false,
		"moreInfo": "https://a11y-guidelines.orange.com/fr/mobile/ios/conception/#controle-de-contenu"
	},
    {
		"themes": "Navigation générale",
		"title": "Les étiquettes visibles et les noms des boutons sont-ils présents et pertinents&nbsp;?",
		"ID": "testID-068",
		"IDorigin": "testID-068",
		"wcag": [
			"2.4.6 AA"
		],
		"verifier": "<ul><li><strong>Si le bouton est dans un formulaire :</strong> ne vérifier que la pertinence de l'étiquette et du nom (la présence étant évaluée au <a href=#headingtestID-001>test du critère WCAG 3.3.2</a></li><li><strong>Si le bouton est hors d'un formulaire :</strong> évaluer présence ET pertinence de l'étiquette et du nom.</li></ul><p>Pour chaque bouton possédant une étiquette visible, vérifier que son étiquette visible et son nom accessible sont pertinents au regard de la fonction du composant.</p>",
		"complement": "<p>En cas d'absence de nom accessible, invalider le critère <a href=#headingtestID-024>4.1.2 A \"Le nom, le rôle et l'état de chaque composant d'interface sont-ils vocalisés&nbsp;?</a></p><p>Vérifier également que le nom accessible contienne bien l'étiquette visible. Si ce n'est pas le cas, invalider le critère <a href=#headingtestID-051>2.5.3 A \"Le nom accessible de chaque composant contient-il au minimum le libellé visible à l'écran&nbsp;?</p>",
		"priority": "P1",
		"resultatTest": "nt",
		"goodPractice": false,
		"moreInfo": "https://a11y-guidelines.orange.com/fr/web/developper/navigation-generale/#rendre-les-intitules-des-liens-et-des-boutons-accessibles"
	},
	{
		"themes": "Navigation générale",
		"title": "Les actions déclenchées par un mouvement de l'appareil ou un geste de l'utilisateur disposent-elles d'une alternative&nbsp;?",
		"ID": "testID-031",
		"IDorigin": "testID-031",
		"wcag": {
			"0": "2.5.4 A"
		},
		"verifier": "<ul><li>Les actions déclenchées par un mouvement de l'appareil ou un geste de l'utilisateur ont des alternatives disponibles depuis un composant d'interface (ex.&nbsp;: un bouton).</li><li>Il est possible de désactiver la détection de mouvement.</li></ul>",
		"resultatTest": "nt",
		"priority": "P2",
		"goodPractice": false,
		"exception": "<p>Le critère n'est pas applicable si le mouvement est essentiel à l'accomplissement de la fonctionnalité (ex.&nbsp;: podomètre)</p>"
	},
	{
		"themes": "Navigation générale",
		"title": "Les gestes multipoints ou basés sur une trajectoire disposent-ils d'une alternative nécessitant un seul pointeur sans trajectoire&nbsp;?",
		"ID": "testID-032",
		"IDorigin": "testID-032",
		"wcag": {
			"0": "2.5.1 A"
		},
		"verifier": "<p>Pour tout geste multipoints (nécessitant plusieurs doigts) et/ou nécessitant une trajectoire gestuelle, une alternative nécessitant un seul pointeur (un seul doigt) et sans trajectoire gestuelle est disponible (exemple : simple tap, double tap, tap prolongé)</p>",		
		"complement": "<h5>Exemple</h5><p><stong>Zoom sur une carte&nbsp;: </strong>des boutons (+ / -) sont disponibles, en alternative au pincé.</p>",
		"resultatTest": "nt",
		"exception": "<p>Le critère est non-applicable dans les cas suivants :</p><ul><li>Le geste complexe est essentiel à la fonctionnalité (par exemple : saisir une signature)</li><li>Le geste est défini par le système d'exploitation, l'agent utilisateur ou la technologie d'assistance.</li></ul>",
		"priority": "P3",
		"goodPractice": false

	},
	{
		"themes": "Navigation générale",
		"title": "Les fonctionnalités utilisant l'action de glisser et déposer ont-elles une alternative&nbsp;?",
		"ID": "testID-074",
		"IDorigin": "testID-074",
		"wcag": {
			"0": "2.5.7 AA"
		},
		"verifier": "<p>Les fonctionnalités de type glisser-déposer, doivent avoir une alternative ne nécessitant pas une dextérité propre à ce type de mouvement (action à pointage unique).</p>",
		"complement": "<h5>Complément d'information</h5><p>Ce critère ne vise que les actions dont seuls les points de départ et d'arrivée sont pris en compte, (glisser puis déposer un ticket dans un tableau Kanban par exemple) et ne tient pas compte des actions dit de \"multi-points\", couvertes par le critère WCAG 2.5.1 - <a href=#headingtestID-032>\"Les gestes multipoints ou basés sur une trajectoire disposent-ils d'une alternative nécessitant un seul pointeur sans trajectoire&nbsp;?\"</a></p>",
		"exception":"<p>Le critère est non-applicable si :</p><ul><li>L'action de glisser/déposer est essentielle (jeu de dexterité par exemple)</li><li>La fonctionalité est native et non modifiée</li></ul>",
		"resultatTest": "nt",
		"priority": "P3",
		"wcag22" : true,
		"goodPractice": false
	},
	{
		"themes": "Navigation générale",
		"title": "Les erreurs de toucher ou de clic peuvent-elles être annulées&nbsp;?",
		"ID": "testID-033",
		"IDorigin": "testID-033",
		"wcag": {
			"0": "2.5.2 A"
		},
		"verifier": "<p>Les actions déclenchées au moyen d'un dispositif de pointage sur un point unique de l'écran doivent pouvoir être annulées&nbsp;:</p><ul><li>Aucune action n'est déclenchée sur le <span lang=\"en\">'down event'</span> (dès qu'on touche ou qu'on presse un élément), vérifier qu'il est possible d'annuler en relâchant le pointeur en dehors de l'élément déclencheur</li><li>Si une action est déclenchée lors de l'appui, vérifier que celle-ci est annulée dès le relâchement du pointeur</li><li>Pour des actions complexes (ex&nbsp;: <span lang=\"en\">drag n'drop</span>), vérifier que l'utilisateur peut annuler l'action avant la fin de son exécution à travers une modale de confirmation par exemple.</li></ul>",
		"resultatTest": "nt",
		"priority": "P1",
		"goodPractice": false
	},
	{
		"themes": "Navigation générale",
		"title": "L'écran est-il consultable quelle que soit l'orientation (portrait ou paysage)&nbsp;?",
		"ID": "testID-034",
		"IDorigin": "testID-034",
		"wcag": {
			"0": "1.3.4 AA"
		},
		"verifier": "<p>Le contenu et les fonctionnalités sont disponibles dans les deux orientations (pas de perte d'information, pas d'élément tronqué).</p>",
		"resultatTest": "nt",
		"priority": "P2",
		"exception": "<p>Si une orientation est jugée essentielle, le critère est non-applicable. Exemples : </p><ul><li>application de jeu vidéo</li><li>application pour jouer du piano</li><li>application pour scanner un chèque bancaire</li></ul>",
		"goodPractice": false,
		"moreInfo": "https://a11y-guidelines.orange.com/fr/mobile/ios/conception/#orientation-de-lecran"
	},
	{
		"themes": "Navigation générale",
		"title": "La taille des éléments interactifs est-elle suffisante&nbsp;?",
		"ID": "testID-050",
		"IDorigin": "testID-050",
		"wcag": {
			"0": "2.5.8 AA"
		},
		"verifier": "<p>Vérifier que chaque élément interactif respecte la surface minimale de 44pt (recommandations Apple) dans toutes les conditions d'affichage (zoom, orientation).</p><p>Le critère est également conforme pour les exceptions suivantes :</p><ul><li>Si l'élément interactif a une surface inférieure à la surface minimale de 44pt mais est placé de manière à ce qu'un cercle de 44pt de diamètre centré sur l'élément ne chevauche pas un autre élément interactif ou le cercle d'un élément sous-dimensionné.</li><li>Si la surface de l'élément interactif est inférieure à 44pt mais qu'il existe dans la page une alternative conforme permettant de réaliser la même action.</li><li>Si l'élément interactif est intégré dans une phrase ou si sa taille est contrainte par la hauteur de ligne du texte non interactif environnant.</li></ul>",
		"exception":"<p>Critère non-applicable si :</p><ul><li>Le rendu des éléments interactifs est le rendu par défaut de l'agent utilisateur.</li><li>La taille et la position des éléments interactifs sont cruciales pour le contenu (exemple : des repères sur une carte) ou contraintes par une obligation légale. Dans ce cas il est toutefois recommandé de fournir des alternatives lorsque cela est possible.</li></ul>",
		"resultatTest": "nt",
		"priority": "P2",
		"wcag22" : true,
		"goodPractice": false,
		"moreInfo": "https://a11y-guidelines.orange.com/fr/mobile/ios/conception/#zone-de-clic"
	},
	{
		"themes": "Navigation générale",
		"title": "Les éléments qui ont la même fonction sont-ils nommés de manière identique d'un écran à l'autre&nbsp;?",
		"ID": "testID-035",
		"IDorigin": "testID-035",
		"wcag": {
			"0": "3.2.4 AA"
		},
		"verifier": "<p>Les composants qui ont la même fonction ont un nom accessible similaire (identique ou verbe d'action commun) d'un écran à l'autre, et au sein d'un même écran si un composant est répété.</p>",
		"resultatTest": "nt",
		"priority": "P1",
		"goodPractice": false
	},
	{
		"themes": "Navigation générale",
		"title": "Si un mécanisme d'aide est proposé et répété sur plusieurs pages, celui-ci est-il présenté de manière cohérente&nbsp;?",
		"ID": "testID-073",
		"IDorigin": "testID-073",
		"wcag": {
			"0": "3.2.6 A"
		},
		"verifier": "<p>Pour chaque mode d'affichage ou orientation (portrait/paysage), si un ou plusieurs dispositifs d'aide sont proposés, ceux-ci doivent toujours être localisés au même endroit, présentés de la même manière et dans le même ordre relatif (même ordre avec Voice Over et Contrôle de Sélection).</p><p>Le critère est également conforme dans les cas suivants :</p><ul><li>Un élément n'est pas positionné visuellement au même endroit mais pourtant dans le même ordre (selon le code source) par rapport aux autres éléments communs de la page.</li><li>Le repositionnement des éléments d'aide est engendré par un changement d'affichage à l'initiative de l'utilisateur (changement d'orientation, agrandissement, etc.).</li><li>Un élément comme un lien promotionnel ad-hoc, qui n'apparaît que sur une seule page et modifie l'ordre relatif du mécanisme d'aide sur cette seule page, peut être ignoré.</li></ul>",
		"complement": "<h5>Complément d'information</h5><ul><li>Les mécanismes d'aide peuvent être une adresse mail, un numéro de téléphone, un formulaire de contact, un chat, une FAQ, etc.</li><li>Ce critère n'impose pas la présence de mécanismes d'aide. S'ils sont présents, vérifier que leur positionnement relatif est le même sur les différents pages du site ou de l'application.<li>Si la structure des pages est modifiée selon les profils d'utilisation (exemple : profil visiteur ou profil connecté), il convient de faire la vérification indépendamment pour chaque profil.</li></ul>",
		"exception": "Le critère n'est pas applicable dans les cas suivants :<ul><li>des pages qui n'auraient rien à voir d'un point de vue visuel et fonctionnel (exemples : sur un site de e-commerce, lors du processus de paiement, le template peut changer et la page de paiement est fonctionnellement et visuellement totalement différente).</li><li>le mécanisme d'aide n'est présent que sur une seule page OU le mécanisme d'aide est absent de la page en cours.</li></ul>",
		"resultatTest": "nt",
		"priority": "P1",
		"wcag22" : true,
		"goodPractice": false
	},
	{
		"themes": "Navigation générale",
		"title": "Les limites de temps sont-elles contrôlables par l'utilisateur&nbsp;?",
		"ID": "testID-036",
		"IDorigin": "testID-036",
		"wcag": {
			"0": "2.2.1 A"
		},
		"verifier": "<p>Vérifier qu'une des conditions ci-dessous est respectée&nbsp;:</p><ul><li>possibilité de supprimer la limite de temps</li><li>possibilité d'augmenter jusqu'à 10 fois minimum le temps par défaut</li><li>l'utilisateur est prévenu au minimum 20 secondes avant la fin et peut augmenter la durée simplement</li><li>la limite de temps est supérieure à 20 heures.</li></ul>",
		"exception": "<p>Le critère est non-applicable dans les cas suivants :</p><ul><li>l'exception du temps réel&nbsp;: la limite de temps est une partie constitutive d'un évènement en temps réel (par exemple, une enchère) et aucune alternative n'est possible&nbsp;;</li><li>l'exception de la limite essentielle&nbsp;: la limite de temps est essentielle et l'étendre invaliderait alors l'activité&nbsp;;</li></ul>",
		"resultatTest": "nt",
		"priority": "P1",
		"goodPractice": false
	},
	{
		"themes": "Navigation générale",
		"title": "Les propriétés d'espacement du texte peuvent-elles être redéfinies par l'utilisateur sans perte de contenu ou de fonctionnalité&nbsp;?",
		"ID": "testID-037",
		"IDorigin": "testID-037",
		"wcag": [
			"1.4.12 AA"
		],
		"verifier": "<p>Si le système d'exploitation ou l'application permettent à l'utilisateur de redéfinir les propriétés d'espacement du texte, vérifier que :</p><ul><li>Les propriétés définies sont correctement appliquées dans l'application.</li><li>Il n'y a pas de perte de contenu ou de fonctionnalité liée à cette modification.</li></ul>",
		"moreInfo": "https://a11y-guidelines.orange.com/fr/mobile/android/developpement/navigation-generale/#proposer-des-textes-lisibles",
		"resultatTest": "nt",
		"priority": "P1",
		"goodPractice": false
	},
	{
		"themes": "Navigation générale",
		"title": "L'utilisateur a-t-il le contrôle des changements de contexte lors de la saisie ?",
		"ID": "testID-077",
		"IDorigin": "testID-077",
		"wcag": {
			"0": "3.2.2 A"
		},
		"verifier": "<p>Lors de la modification de paramètre, vérifier l'absence de changement de contexte, sans avertissement préalable de l'utilisateur.</p><p>La modification d'un paramètre peut être, par exemple, cocher une case, saisir du contenu dans un champ de texte, sélectionner une option dans un contrôle de formulaire, tout cela doit avoir des résultats prédictibles (comportement attendu par l'utilisateur)</p><p>Le changement de contexte est conforme si l'utilisateur est averti par un texte avant son déclenchement</p><p>L'activation d'un lien ou d'un bouton n'est pas une modification de paramètre donc non-applicable dans ce cas.</p>",
		"complement": "<h5>Changement de contexte</h5><p>Changement majeur dans le contenu de l'écran qui, lorsqu'il est effectué à l'insu de l'utilisateur, peut désorienter.</p><p>Les changements de contexte incluent les changements de&nbsp;:</p><ul><li>agent utilisateur (ouverture d'une autre application)</li><li><span lang=\"en\">viewport</span>(ouverture d'un nouvel écran, autre partie de l'écran affiché)</li><li>focus (déplacement du focus)</li><li>contenu qui modifie le sens de l'écran</li></ul>",
		"resultatTest": "nt",
		"priority": "P3",
		"goodPractice": false,
		"moreInfo": "https://a11y-guidelines.orange.com/fr/mobile/ios/conception/#controle-de-contenu"
	},
	{
		"themes": "Navigation générale",
		"title": "L'utilisateur a-t-il le contrôle d'un contenu en mouvement, défilant, clignotant ou se mettant à jour durant plus de 5 secondes et démarrant automatiquement&nbsp;?",
		"ID": "testID-039",
		"IDorigin": "testID-039",
		"wcag": {
			"0": "2.2.2 A"
		},
		"verifier": "<p>Si un contenu d'une partie de la page, présenté en parallèle d'autres contenus, démarrant automatiquement&nbsp;:<ul><li>durant plus de 5 secondes, en mouvement, défile, clignote, il doit exister un moyen de l'arrêter, le mettre en pause ou le masquer.</li><li>se met à jour ou est rafraichi automatiquement, il doit exister un moyen de l'arrêter, le mettre en pause, le masquer ou jouer sur sa fréquence de mise à jour.</li></ul>",
		"complement": "<h5>Complément d'information</h5><p>Le fait que l'animation s'arrête uniquement à la prise de focus ou au toucher n'est pas considéré comme un mécanisme permettant à l'utilisateur de faire une pause.</p>",
		"exception": "<p>Le critère est non-applicable pour les cas suivants :</p><ul><li>Aucun mouvement, défilement, clignotement, mise à jour ou rafraichissement automatique durant plus de 5 secondes et démarrant automatiquement.</li><li>Le mouvement, défilement, clignotement ou rafraichissement est essentiel au service.</li></ul>",
		"resultatTest": "nt",
		"priority": "P2",
		"goodPractice": false
	},
	{
		"themes": "Navigation générale",
		"title": "Il n'y a aucun clignotement perturbant pour l'utilisateur",
		"ID": "testID-040",
		"IDorigin": "testID-040",
		"wcag": {
			"0": "2.3.1 A"
		},
		"verifier": "S'il y a des flashs (clignotements ou changements brusques de luminosité), le critère est conforme si l'une des conditions est valide&nbsp;: <ul><li>Il y a moins de 3 flashs dans un intervalle d'une seconde</li><li>La zone de totale de flash contient moins de 21 824 px</li></ul><p>Si aucune des deux conditions précédentes n'est vérifiable facilement ou en cas de doute, vérifier avec l'outil <a href=https://trace.umd.edu/peat/>PEAT (Photosensitive Epilepsy Analysis Tool)</a>.</p>",
		"resultatTest": "nt",
		"priority": "P3",
		"goodPractice": false,
		"moreInfo": "https://a11y-guidelines.orange.com/fr/web/designer/navigation-generale/#permettre-le-controle-des-animations"
	},
	{
		"themes": "Navigation générale",
		"title": "Le positionnement des mécanismes de navigation est-il cohérent avec les autres écrans de l'application",
		"ID": "testID-056",
		"IDorigin": "testID-056",
		"wcag": {
			"0": "3.2.3 AA"
		},
		"verifier": "<p>Les mécanismes de navigation sont toujours situés au même endroit dans un ensemble d'écrans (visuellement et programmatiquement).</p>",
		"resultatTest": "nt",
		"priority": "P2",
		"goodPractice": false
	},
	{
		"themes": "Navigation générale",
		"title": "Aucune image porteuse d'information n'est utilisée pour présenter du texte&nbsp;?",
		"ID": "testID-052",
		"IDorigin": "testID-052",
		"wcag": {
			"0": "1.4.5 AA"
		},
		"verifier": "<p>Les images ne doivent pas être utilisées pour présenter de l'information sous forme de texte.</p><p>Le critère est conforme pour les exceptions suivantes&nbsp;:</p><ul><li>SVG (vrai texte)</li><li>cas particuliers (ex. logo, captcha, dénomination commerciale)</li><li>l'élément est nécessaire</li><li>l'image est visuellement modifiable par l'utilisateur</li></ul>",
		"exception": "Critère non-applicable si&nbsp;:<ul><li>aucune image ne contient de texte,</li><li>l'image ne porte pas d'information,</li><li>l'image est essentielle (logo, marque, CAPTCHA, image de test dans un jeu ou un quiz par exemple,…).</li>",
        "resultatTest": "nt",
		"priority": "P1",
		"goodPractice": false,
		"moreInfo": "https://a11y-guidelines.orange.com/fr/web/designer/contenu-non-textuel/#cas-particulier-mise-en-forme-via-une-image"
	},
	{
		"themes": "Navigation générale",
		"title": "L'étiquette et le nom accessible de chaque élément interactif est-il explicite, au minimum dans son contexte&nbsp;?",
		"ID": "testID-054",
		"IDorigin": "testID-054",
		"wcag": {
			"0": "2.4.4 A"
		},
		"verifier": "<p>L'utilisateur doit être capable de comprendre l'objectif d'un lien ou d'un bouton sans avoir à se déplacer dans la page pour comprendre de quoi il s'agit.</p><ul><li>Vérifier qu'il n'y a pas d'étiquettes identiques pointant vers des destinations différentes</li><li>Vérifier qu'il est possible de déterminer la destination d'un lien ou l'action d'un bouton uniquement à partir de son nom accessible</li><li>Si les vérifications précédentes sont non concluantes, vérifier que la cible d'un lien ou l'action portée par un bouton est au moins compréhensible grâce à son contexte (phrase, paragraphe, cellule...)</li></ul>",
		"complement": "<h5>Comment déterminer le contexte de lien&nbsp;: </h5><p>Le contexte du lien représente les informations supplémentaires qui permettent de comprendre son intitulé. Vérifier que ces informations supplémentaires sont positionnées soit :</p><ul><li>dans la même phrase</li><li>dans le même paragraphe</li><li>dans le même élément de liste</li><li>dans la même cellule de tableau</li><li>dans la cellule d'en-tête du tableau, associée à la cellule du lien</li></ul>",
		"resultatTest": "nt",
		"priority": "P3",
		"goodPractice": false
	},
	{
		"themes": "Navigation générale",
		"title": "L'application dispose-t-elle d'au moins deux mécanismes de navigation&nbsp;?",
		"ID": "testID-069",
		"IDorigin": "testID-069",
		"wcag": [
			"2.4.5 AA"
		],
		"verifier": "<p>Il existe plusieurs mécanismes pour atteindre un contenu souhaité et permettre à un utilisateur de se situer au sein de l'application&nbsp;:</p> <ul><li>un menu de navigation principal</li><li>une <code>tab bar</code></li><li>un mécanisme de recherche indexant la totalité du site.</li><li>...</li></ul><p>Attention, le critère est conforme si le nombre de pages est inférieur à 3 ou 4 et/ou le contenu est succinct mais que des liens (navigation) existent pour toutes les pages.</p>", 
		"exception": "<p>La page est indépendante et hébergée en dehors de l'application</li><li>Pour un écran résultat ou étape d'un processus à étapes.</li></ul>",
		"priority": "P3",
		"resultatTest": "nt",
		"goodPractice": false
	},
	{
		"themes": "Multimédia",
		"title": "Contenu préenregistré seulement audio&nbsp;: une transcription textuelle équivalente au contenu de l'audio est-elle présente&nbsp;?",
		"ID": "testID-041",
		"IDorigin": "testID-041",
		"wcag": {
			"0": "1.2.1 A"
		},
		"verifier": "<p>Pour toute contenu préenregistré seulement audio, un transcrit complet (texte contenant l'ensemble des informations auditives) est fourni sous forme de texte.<br>Cette transcription textuelle est alors&nbsp;:</p><ul><li>présente dans l'écran</li><li>ou disponible via un lien positionné à proximité de la piste audio</li></ul>",
		"complement": "<h5>Sous-titres transcrits</h5><p>Les sous-titres ne communiquent pas uniquement les dialogues, mais également toutes les autres informations audio nécessaires à la compréhension du contenu (ex&nbsp;: identifications des interlocuteurs, effets sonores…).</p>",
		"group": "Multimédia",
		"resultatTest": "nt",
		"priority": "P3",
		"goodPractice": false,
		"moreInfo": "https://a11y-guidelines.orange.com/fr/web/designer/contenu-non-textuel/#cas-particuliers-des-animations-contenus-video-et-audio"
	},
	{
		"themes": "Multimédia",
		"title": "Vidéo préenregistrée sans audio&nbsp;: une transcription textuelle ou une piste audio équivalente au contenu de la vidéo sont-elles présentes&nbsp;?",
		"ID": "testID-042",
		"IDorigin": "testID-042",
		"wcag": {
			"0": "1.2.1 A"
		},
		"verifier": "<p>Pour toute vidéo préenregistrée sans audio, un transcrit complet (texte contenant l'ensemble des informations visuelles) est fourni sous forme de texte.<br>Cette transcription textuelle est alors&nbsp;: </p><ul><li>présente dans l'écran</li><li>ou disponible via un lien positionné à proximité de la vidéo</li><li>ou vérifier la présence d'une piste audio fournissant les informations présentées visuellement</li></ul>",
		"group": "Multimédia",
		"resultatTest": "nt",
		"priority": "P3",
		"goodPractice": false,
		"moreInfo": "https://a11y-guidelines.orange.com/fr/web/designer/contenu-non-textuel/#cas-particuliers-des-animations-contenus-video-et-audio"
	},
	{
		"themes": "Multimédia",
		"title": "Vidéo préenregistrée (avec ou sans audio)&nbsp;: une transcription textuelle ou une audiodescription sont-elles présentes&nbsp;?",
		"ID": "testID-043",
		"IDorigin": "testID-043",
		"wcag": {
			"0": "1.2.3 A"
		},
		"verifier": "<p>Pour toute vidéo préenregistrée (avec ou sans audio) :</p><ul><li>Soit un transcrit complet (texte contenant l'ensemble des informations auditives et visuelles) est fourni sous forme de texte : cette transcription textuelle doit alors être présente dans l'écran ou disponible via un lien positionné à proximité de la vidéo</li><li>Soit, une audiodescription est disponible, vérifier alors que : <ul><li>l'audiodescription est correctement synchronisée</li><li>l'audiodescription n'entre pas en conflit avec la piste audio de la vidéo (pas de perte d'information)</li><li>l'audiodescription est pertinente</li></ul></li></ul>",
		"group": "Multimédia",
		"resultatTest": "nt",
		"priority": "P3",
		"goodPractice": false,
		"moreInfo": "https://a11y-guidelines.orange.com/fr/web/designer/contenu-non-textuel/#cas-particuliers-des-animations-contenus-video-et-audio"
	},
	{
		"themes": "Multimédia",
		"title": "Vidéo préenregistrée (avec ou sans audio)&nbsp;: une audiodescription est-elle présente&nbsp;?",
		"ID": "testID-044",
		"IDorigin": "testID-044",
		"wcag": {
			"0": "1.2.5 AA"
		},
		"verifier": "<p>Pour toute vidéo :</p><ul><li>Une audiodescription est disponible.</li><li>L'audiodescription est correctement synchronisée.</li><li>L'audiodescription n'entre pas en conflit avec la piste audio de la vidéo (pas de perte d'information).</li><li>L'audiodescription est pertinente.</li></ul>",
		"group": "Multimédia",
		"resultatTest": "nt",
		"priority": "P3",
		"goodPractice": false,
		"moreInfo": "https://a11y-guidelines.orange.com/fr/web/designer/contenu-non-textuel/#cas-particuliers-des-animations-contenus-video-et-audio"
	},
	{
		"themes": "Multimédia",
		"title": "Vidéo préenregistrée avec audio&nbsp;: des sous-titres transcrits sont-ils fournis pour tout le contenu&nbsp;?",
		"ID": "testID-045",
		"IDorigin": "testID-045",
		"wcag": {
			"0": "1.2.2 A"
		},
		"verifier": "<p>Pour toute vidéo avec audio :</p><ul><li>Des sous-titres sont disponibles.</li><li>Les sous-titres sont pertinents (restitution de toutes les informations nécessaires à la compréhension, comme l'identité des orateurs).</li><li>Les sous-titres ne masquent pas des informations importantes de la vidéo.</li></ul>",
		"exception": "<p>Les sous-titres ne sont pas nécessaires lorsque les informations présentes dans la vidéo sont également présentées sous forme de texte ou d'alternative textuelle sur la même page.</p>",
		"group": "Multimédia",
		"resultatTest": "nt",
		"priority": "P3",
		"goodPractice": false,
		"moreInfo": "https://a11y-guidelines.orange.com/fr/web/designer/contenu-non-textuel/#cas-particuliers-des-animations-contenus-video-et-audio"
	},
	{
		"themes": "Multimédia",
		"title": "Vidéo en direct avec audio&nbsp;: des sous-titres transcrits sont-ils fournis pour tout le contenu&nbsp;?",
		"ID": "testID-046",
		"IDorigin": "testID-046",
		"wcag": {
			"0": "1.2.4 AA"
		},
		"verifier": "<p>Pour toute vidéo en direct avec audio :</p><ul><li>Des sous-titres sont disponibles.</li><li>Les sous-titres sont pertinents (restitution de toutes les informations nécessaires à la compréhension, comme l'identité des orateurs).</li></ul>",
		"group": "Multimédia",
		"resultatTest": "nt",
		"priority": "P3",
		"goodPractice": false,
		"moreInfo": "https://a11y-guidelines.orange.com/fr/web/designer/contenu-non-textuel/#cas-particuliers-des-animations-contenus-video-et-audio"
	},
	{
		"themes": "Multimédia",
		"title": "Si du son est lu automatiquement pendant plus de 3 secondes, l'utilisateur dispose-t-il d'un mécanisme pour le contrôler&nbsp;?",
		"ID": "testID-047",
		"IDorigin": "testID-047",
		"wcag": {
			"0": "1.4.2 A"
		},
		"verifier": "<ul><li>Possibilité de mettre en pause ou d'arrêter le son.</li><li>Ou possibilité de régler le volume indépendamment du volume système.</li></ul><p>Le mécanisme doit être facilement atteignable.</p>",
		"group": "Multimédia",
		"resultatTest": "nt",
		"priority": "P3",
		"goodPractice": false
	},
	{
		"themes": "Multimédia",
		"title": "Des contrôles sont-ils présents pour interagir avec un média temporel&nbsp?",
		"ID": "testID-048",
		"IDorigin": "testID-048",
		"wcag": [
			"2.2.2 A"
		],
		"verifier": "<p>Si un contenu d'une partie de la page, démarrant automatiquement et durant plus de 5 secondes, est en mouvement, défile, clignote, il existe un moyen de l'arrêter, le mettre en pause ou le cacher.</p><p>Pour du contenu d'une partie de la page qui se met à jour qui ou est rafraichi automatiquement, il existe un moyen de l'arrêter, le mettre en pause masquer ou jouer sur sa fréquence de mise à jour.</p>",
		"exception": "<p>Le critère est non-applicable si aucun mouvement, défilement, clignotement, mise à jour ou rafraichissement automatique durant plus de 5 secondes et démarrant automatiquement.</p>",
		"group": "Multimédia",
		"moreInfo": "https://a11y-guidelines.orange.com/fr/mobile/android/conception/multimedia/#controler-le-contenu-multimedia",
		"resultatTest": "nt",
		"priority": "P3",
		"goodPractice": false
	},
    {
		"themes": "CAPTCHA",
		"title": "Chaque image CAPTCHA a-t-elle une alternative&nbsp;?",
		"ID": "testID-065",
		"IDorigin": "testID-065",
		"wcag": [
			"1.1.1 A"
		],
		"verifier": "<p>L'alternative à chaque image CAPTCHA communique l'objectif de l'image et non son contenu (ex&nbsp;: «&nbsp;CAPTCHA (image anti-spam)&nbsp;» ).</p>",
		"group": "CAPTCHA",
		"priority": "P2",
		"resultatTest": "nt",
		"goodPractice": false,
		"moreInfo": "https://a11y-guidelines.orange.com/fr/web/developper/contenu-non-textuel/#eviter-les-captcha"
	},
	{
		"themes": "CAPTCHA",
		"title": "Si un CAPTCHA est utilisé, une alternative est-elle prévue pour les utilisateurs malvoyants, non-voyants et malentendants&nbsp;?",
		"ID": "testID-066",
		"IDorigin": "testID-066",
		"wcag": [
			"1.1.1 A"
		],
		"verifier": "<p>Pour tout CAPTCHA uniquement visuel ou sonore, l'une des alternatives ci-dessous est proposée en complément&nbsp;: </p><ul><li>CAPTCHA audio et visuel</li><li>tests logiques (question dont la réponse est évidente, test mathématique simple…)</li><li>il existe une autre solution d'accès à la fonctionnalité sécurisée par le CAPTCHA</li></ul>",
		"group": "CAPTCHA",
		"priority": "P2",
		"resultatTest": "nt",
		"goodPractice": false,
		"moreInfo": "https://a11y-guidelines.orange.com/fr/web/developper/contenu-non-textuel/#eviter-les-captcha"
	},
	{
		"themes": "Contenu cryptique",
		"title": "Chaque contenu cryptique (art ASCII, émoticon, syntaxe cryptique) possède-t-il une alternative pertinente&nbsp;?",
		"ID": "testID-067",
		"IDorigin": "testID-067",
		"wcag": [
			"1.1.1 A"
		],
		"verifier": "<ul><li>Une alternative est fournie sous forme de texte</li><li>L'alternative est pertinente</li></ul>",
		"priority": "P3",
		"resultatTest": "nt",
		"goodPractice": false
	}
]
