{
	"testWebID-0": [
		{
			"title" : "Page title not specified",
			"detail" : "Each page should have a unique title.",
			"solution" : "Fill in the <title> element, with keywords allowing to understand the role of the page. The information can be ordered from the most specific to the least specific, or vice versa (no rules).",
			"technicalSolution" : "<title>Homepage - Orange customer area</title>"
		},
		{
			"title" : "Page title irrelevant",
			"detail" : "Each page must have a unique title, making it possible to understand its role.",
			"solution" : "Fill in the <title> element, with keywords allowing to understand the role of the page. The information can be ordered from the most specific to the least specific, or vice versa (no rules).",
			"technicalSolution" : "<title>Homepage - Orange customer area</title>"
		}
		
	],
	"testWebID-1": [
		{
			"title" : "Incomplete hierarchy",
			"detail" : "The page must be structured with headings.",
			"solution" : "All content, visually treated as titles, must have heading semantics (<h1> to <h6> tags)",
			"technicalSolution" : ""
		},
		{
			"title" : "Hierarchy of heading levels not logical",
			"detail" : "Level headings should be structured logically",
			"solution" : "",
			"technicalSolution" : ""
		}	
	],
	"testWebID-2": [
		{
			"title" : "A HTML list semantic is missing",
			"detail" : "Items presented visually as lists must be structured with list semantics.",
			"solution" : "Use appropriate list semantics <ul>, <ol> or <dl>, <dt> and <dd>.",
			"technicalSolution" : ""
		},
		{
			"title" : "An HTML hyperlink semantic is missing",
			"detail" : "Interactive elements causing a URL change must use HTML an hyperlink semantics.",
			"solution" : "Use a <a> tag with a href attribute.",
			"technicalSolution" : ""
		},
		{
			"title" : "A HTML button semantic is missing",
			"detail" : "Interactive elements that trigger an action must use HTML button semantics.",
			"solution" : "Use <button> or <input type=\"button\"> semantics",
			"technicalSolution" : ""
		}
	],
	"testWebID-3": [
		{
			"title" : "Incomplete element",
			"detail" : "Start or end tags are missing for one or more items.",
			"solution" : "",
			"technicalSolution" : ""
		
		},
		{
			"title" : "Nesting error",
			"detail" : "Elements do not respect nesting rules (HTML conformance).",
			"solution" : "",
			"technicalSolution" : ""
		
		},
		{
			"title" : "Duplicate attributes",
			"detail" : "Presence of duplicate attributes on the same element.",
			"solution" : "",
			"technicalSolution" : ""
		
		},
		{
			"title" : "Presence of duplicate IDs",
			"detail" : "The page should not have duplicate IDs.",
			"solution" : "",
			"technicalSolution" : ""
		}
		
	],
	"testWebID-4": [
		{
			"title" : "The lang attribute is missing",
			"detail" : "A lang attribute must be present on the HTML element. In addition, the value of the attribute must correspond to the main language of the document.",
			"solution" : "",
			"technicalSolution" : "<html lang=\"en\" >"
		},
		{
			"title" : "The value of the lang attribute is wrong",
			"detail" : "The value of the attribute must match the main language of the document.",
			"solution" : "If english is the main language of the document, then the value of the attribute will be lang=\"en\"",
			"technicalSolution" : "<html lang=\"en\" >"
		}
	],
	"testWebID-5": [
		{
			"title" : "Language change not indicated",
			"detail" : "Words and expressions in foreign languages ​​must be indicated to users.",
			"solution" : "Add a lang attribute to foreign language terms",
			"technicalSolution" : "<q lang=\"fr\">[…]</q>"
		}
	],
	"testWebID-6": [
		{
			"title" : "Row or column headers semantics are missing",
			"detail" : "Headers are required to identify the nature of the columns and / or rows",
			"solution" : "The column header cells must have a semantics of TH + a scope=\"col\" attribute. Row header cells must have a semantics of TH + a scope=\"row\" attribute. ",
			"technicalSolution" : "<th scope=\"col\"> / <th scope=\"row\"> "
		},
		{
			"title" : "Presence of a layout table",
			"detail" : "Tables should not be used content layout",
			"solution" : "Add a role=\"presentation\" to the table",
			"technicalSolution" : "<table role=\"presentation\">"
		}
	],
	"testWebID-7": [
		{
			"title" : "An ALT attribute is missing",
			"detail" : "All images must have an ALT attribute.",
			"solution" : "Add an ALT attribute to images.",
			"technicalSolution" : "<img alt=\"[...]\" [...]> "
		},
		{
			"title" : "A TITLE attribute is missing",
			"detail" : "All frames must have a TITLE attribute.",
			"solution" : "Add a TITLE attribute to frames.",
			"technicalSolution" : "<iframe title=\"[...]\">"
		}
	],
	"testWebID-8": [
		{
			"title" : "An image carrying information is integrated in the background (CSS)",
			"detail" : "Images integrated by CSS must not carry information.",
			"solution" : "Images carrying information must be embedded in HTML.",
			"technicalSolution" : ""
		}
	],
	"testWebID-9": [
		{
			"title" : "The ALT attribute of an image within a link is not filled in or not relevant",
			"detail" : "The content of the alt attribute of each clickable images is relevant to its linking function.",
			"solution" : "Enter the link target in the ALT",
			"technicalSolution" : "<a href=\"http://mywebsite.com\"><img src=\"[...]\" alt=\"My website\" ></a>"
		},
		{
			"title" : "The ALT attribute of an image that carrying information is not filled in or not relevant",
			"detail" : "The alt attribute of each image is relevant to the role of the image on the page.",
			"solution" : "Enter in the ALT the information carried by the image.",
			"technicalSolution" : ""
		},
		{
			"title" : "The ALT attribute of an image containing text is not filled in or not relevant",
			"detail" : "The alt attribute includes at least the text of the image.",
			"solution" : "Enter in the ALT the text presented by the image.",
			"technicalSolution" : ""
		},
		{
			"title" : "The ALT attribute of a decorative image is not relevant",
			"detail" : "The alt attribute of a decorative image must be empty, so that the image is ignored, especially by assistive technology.",
			"solution" : "Fill in an empty alt.",
			"technicalSolution" : "<img src=\"[...]\" alt=\"\" >"
		},
		{
			"title" : "The ALT of a complex image (diagrams, graphs, etc.) is irrelevant",
			"detail" : "",
			"solution" : "For any image description that is too long to be put in an alt attribute, the description of the images is either present in the page, or, an adjacent link points to an html page containing the description.",
			"technicalSolution" : ""
		}
	],
	"testWebID-10": [
		{
			"title" : "TITLE attribute not relevant",
			"detail" : "The value of the attribute should allow users to understand the purpose of the frame or iframe.",
			"solution" : "Add a TITLE attribute, the value of the attribute describes the content of the frame or iframe.",
			"technicalSolution" : ""
		}
		
	],
	"testWebID-11": [
		{
			"title" : "Presence of text as an image",
			"detail" : "Texts must be included in HTML and formatted via CSS.",
			"solution" : "Include texts in HTML and manage the formatting via CSS.",
			"technicalSolution" : ""
		}
	],
	"testWebID-12": [
		{
			"title" : "A complete transcript is missing",
			"detail" : "A complete transcript (text version of the speech containing all visual and auditory information) must be provided as an alternative to audio or video tracks.",
			"solution" : "Add a complete transcript (text version of the speech), either directly in the page, or by a link pointing to an html page containing this transcript and this, near the element to be described",
			"technicalSolution" : ""
		},
		{
			"title" : "Captions are missing",
			"detail" : "For any video, captions are available",
			"solution" : "Add subtitles in text formats for all videos. These provide all the informations of the audio track.",
			"technicalSolution" : ""
		},
		{
			"title" : "Audio description is missing",
			"detail" : "Audio description is required for videos presenting information in visual form.",
			"solution" : "Adding an audio description is present in addition to the audio track, if necessary. This presents, in text format, the information conveyed only by the image.",
			"technicalSolution" : ""
		}
	],
	"testWebID-13": [
		{
			"title" : "Cannot stop an audio or video track",
			"detail" : "Page audio tracks that are automatically played longer than 3 seconds can be stopped, paused or their volume can be controlled independently.",
			"solution" : "Provide an accessible mechanism, allowing users to control sounds played over 3 seconds.",
			"technicalSolution" : ""
		}
	],
	"testWebID-14": [
		{
			"title" : "Presence of rapid flashing",
			"detail" : "Presence of content presenting rapid flashes (more than 3 flashes per second) or the flashes are below the general threshold or red threshold.",
			"solution" : "",
			"technicalSolution" : ""
		}
	],
	"testWebID-15": [
		{
			"title" : "An alternative to captcha is missing",
			"detail" : "Any captcha that is only visual or audio must have an accessible alternative.",
			"solution" : "Provide as an alternative: an audio + visual captcha, or logical tests (question whose answer is obvious, simple mathematical test ...).",
			"technicalSolution" : ""
		}
	],
	"testWebID-16": [
		{
			"title" : "Insufficient contrast between text and background",
			"detail" : "The contrast must be sufficient to understand the information carried by all the texts.",
			"solution" : "Ensure a contrast of 4.5: 1 minimum for texts of normal sizes (less than 24px CSS and 19px CSS in bold). Ensure a minimum contrast of 3: 1 for large texts (greater than 24px CSS and 19px CSS in bold).",
			"technicalSolution" : ""
		},
		{
			"title" : "Insufficient contrast for non-underlined links",
			"detail" : "Non-underlined links must have a sufficient contrast ratio with the surrounding text.",
			"solution" : "Ensure a minimum contrast of 4.5: 1 between an un-underlined link and the surrounding text of normal sizes (less than 24px CSS and 19px CSS in bold). Ensure a minimum 3: 1 contrast between a non-underlined link and the surrounding text of large sizes (greater than 24px CSS and 19px CSS in bold).",
			"technicalSolution" : ""
		}
	],
	"testWebID-17": [
		{
			"title" : "Insufficient contrast for icons carrying information",
			"detail" : "The contrast must be sufficient to convey the information.",
			"solution" : "Ensure a minimum contrast of 3: 1 for icons.",
			"technicalSolution" : ""
		},
		{
			"title" : "Insufficient contrast for interactive components (buttons, radio buttons, ...)",
			"detail" : "The contrast must be sufficient to convey the information.",
			"solution" : "Ensure a minimum contrast of 3: 1 for the different states of interactive components.",
			"technicalSolution" : ""
		},
		{
			"title" : "Insufficient contrast for states of interactive components (focus, hover, ...)",
			"detail" : "The contrast must be sufficient to convey the information.",
			"solution" : "Ensure a minimum contrast of 3: 1 for the different states of interactive components.",
			"technicalSolution" : ""
		}
	],
	"testWebID-18": [
		{
			"title" : "Color is the only way to convey information",
			"detail" : "Color should not be the only means of conveying information: at least one other visual means is available to obtain the same information.",
			"solution" : "Complete the color with explicit text, or other visual information (example: icons use colors, but also different shapes).",
			"technicalSolution" : ""
		}
	],
	"testWebID-19": [
		{
			"title" : "Unidentifiable link in a body of text",
			"detail" : "Links in the body of the text must be easily identifiable visually by a means other than color (underlined, bold, etc.).",
			"solution" : "Apply a visually identifiable medium (underlined, bold, etc.). Make sure there is a 3: 1 contrast between text, background and links and that there is another way than color to identify them when hovering and focusing.",
			"technicalSolution" : ""
		}
	],
	"testWebID-20": [
		{
			"title" : "Sensory information is the only way to convey information",
			"detail" : "Sensory information (eg: position, size, sound) should not be the only way to provide information.",
			"solution" : "Complete the information with a text, or an explicit message.",
			"technicalSolution" : ""
		}
	],
	"testWebID-22": [
		{
			"title" : "Presence of identical labels",
			"detail" : "Interactive elements with identical labels but different targets are present in the page.",
			"solution" : "Add discriminating information to each label in order to differentiate them.",
			"technicalSolution" : "Several solutions are available to complete a link or button label: sr-only, aria-labelledby, aria-label."
		}
	],
	"testWebID-23": [
		{
			"title" : "Presence of wording that is not understandable in their context",
			"detail" : "The target of a link or the action carried by a button is not understandable thanks to its direct context (surrounding text).",
			"solution" : "Add discriminating information in the surrounding text.",
			"technicalSolution" : "The solution depends on the context in which the element is used: \n- element in a paragraph: complete the text of the paragraph (<p> [...] </p>) \n- element in a list: complete a item from the list (<ul>, <ol>) \n- element in a table cell: complete the text of the cell (<td> [...] </td>) or complete the direct header of the cell (<th> [...] </th>)."
		}
	],
	"testWebID-24": [
		{
			"title" : "Presence of identical text labels",
			"detail" : "Interactive elements with identical text labels, but different targets are present in the page.",
			"solution" : "Add discriminating information to each label in order to differentiate them.",
			"technicalSolution" : "Several solutions are available to complete a link or button label: sr-only, aria-labelledby, aria-label."
		}
	],
	"testWebID-25": [
		{
			"title" : "The visible text on the screen is missing in the accessible name",
			"detail" : "The text of the displayed label (the textual caption or the text of the image visible on the screen) must be present (in first position, if possible) in the name (accessible) of this component.",
			"solution" : "Modify the accessible name of the element to include visible text on the screen, if possible in first position.",
			"technicalSolution" : "Several solutions are available to redefine the accessible name: aria-labelledby, aria-label, title, sr-only."
		}
	],
	"testWebID-26": [
		{
			"title" : "The wording of the link text is not understandable",
			"detail" : "The link text is based on the name of the file.",
			"solution" : "The link text should be based on the document title.",
			"technicalSolution" : ""
		},
		{
			"title" : "The document format is missing",
			"detail" : "The format of the document is not specified in the wording of the link.",
			"solution" : "Add the file format in the link text.",
			"technicalSolution" : ""
		},
		{
			"title" : "The document language is missing",
			"detail" : "The document being downloaded is in a different language from the current page.",
			"solution" : "Specify the language of the document being downloaded in the link text.",
			"technicalSolution" : ""
		},
		{
			"title" : "The document weight is missing",
			"detail" : "The weight of the document is not specified.",
			"solution" : "Specify the weight of the document for downloading in the link text.",
			"technicalSolution" : ""
		}
	],
	"testWebID-27": [
		{
			"title" : "The mention \"new window\" is missing",
			"detail" : "Opening in a new window is not announced to users.",
			"solution" : "Add the mention \"new window\" to the link.",
			"technicalSolution" : "- Add the mention in a \"title\" attribute positioned on the link.\n- The attribute uses the text label visible on the screen, followed by the mention \"(new window)\".\n- In order to improve the robustness of the solution for screen reader users, the \"title\" attribute is doubled by an \"aria-label\" attribute also positioned on the link.\n- The \"aria-label\" attribute contains the same information as the title."
		}
	],
	"testWebID-28": [
		{
			"title" : "A \"main\" region is missing",
			"detail" : "The page must contain at least one \"main\" region.",
			"solution" : "Main content must be wrapped in a \"main\" region.",
			"technicalSolution" : "- The main content must be encapsulated in a \"main\" region.\n- The \"main\" region must not contain any element repeated elsewhere in the page (eg: navigation)."
		}
	],
	"testWebID-29": [
		{
			"title" : "Skip links are missing",
			"detail" : "Skip links are necessary in order to access the main areas of the pages (main menu, main content, search engine, etc ...",
			"solution" : "Add skip links at the top of the page. These are the first elements of the page. Links can be masked (in an accessible manner, cf. accessible hidden) only if the constraint is strong. They are then displayed only as soon as keyboard focus is taken.",
			"technicalSolution" : ""
		}
	],
	"testWebID-30": [
		{
			"title" : "Form automatically submitted when taking focus of an element",
			"detail" : "A form is automatically submitted as soon as a form element takes focus (onFocus).",
			"solution" : "A form should be submitted only after activating the submit button (onClick).",
			"technicalSolution" : ""
		},{
			"title" : "Form automatically submitted during data entry",
			"detail" : "A form is automatically submitted after entering data in a field (onInput).",
			"solution" : "A form should be submitted only after activating the submit button (onClick).",
			"technicalSolution" : ""
		},{
			"title" : "Change of the content of the current page as soon as the focus is taken",
			"detail" : "A change of content takes place without being initiated voluntarily by the user (onFocus).",
			"solution" : "A change of content must take place only after voluntary triggering of the user (onClick) on a link or an action button.",
			"technicalSolution" : ""
		},{
			"title" : "Opening of a new page as soon as focus is taken",
			"detail" : "A page change takes place without being initiated voluntarily by the user (onFocus).",
			"solution" : "A change of content must take place only after voluntary triggering of the user (onClick) on a link.",
			"technicalSolution" : ""
		}
	],
	"testWebID-31": [
		{
			"title" : "Cannot move the pointer to the content of a tooltip",
			"detail" : "After opening a tooltip, the user cannot move his pointer from the trigger element to the content of the tooltip, without the latter closing.",
			"solution" : "The user must be able to move the mouse pointer from the trigger element to the content of the tooltip without closing it.",
			"technicalSolution" : ""
		}, {
			"title" : "Cannot close additional content (tooltip, popin, etc ...) without moving the focus or the pointer",
			"detail" : "After opening additional content, the user cannot close it without having to move the focus or the mouse pointer.",
			"solution" : "After opening additional content, the user cannot close it without having to move the focus or the mouse pointer.",
			"technicalSolution" : ""
		}
	],
	"testWebID-32": [
		{
			"title" : "User does not have control of a time limit",
			"detail" : "There is a time limit for performing an action, and the user has no control over it.",
			"solution" : "The user should be able to remove the limit or adjust it.",
			"technicalSolution" : ""
		}
	],
	"testWebID-33": [
		{
			"title" : "User does not have control of a single key based keyboard shortcut",
			"detail" : "The user does not have control of a keyboard shortcut based on a single key: letter (lowercase or uppercase), punctuation, number, or symbol.",
			"solution" : "The user must be able to:\n- deactivate the shortcut\n- or modify the shortcut to add an extra key to the combination\n- or ensure that the shortcut is active only when taking focus of the component of the interface.",
			"technicalSolution" : ""
		}
	],
	"testWebID-34": [
		{
			"title" : "Only one navigation mechanism is present",
			"detail" : "At least 2 navigation mechanisms must be present on the interface.",
			"solution" : "Complete the existing mechanism with a solution listed below: \n - a main navigation menu \n - a table of contents \n - a sitemap \n - a search mechanism \n - a list of links to navigate to across the whole site (footer).",
			"technicalSolution" : ""
		}
	],
	"testWebID-35": [
		{
			"title" : "A visual information on the user's current position within the hierarchy is missing",
			"detail" : "The current position within the hierarchy of a site cannot be determined visually.",
			"solution" : "- add a breadcrumb \n - main navigation: add a visual indication, not depending only on the color (ex: underline the active item)",
			"technicalSolution" : ""
		}, {
			"title" : "The current position within the hierarchy cannot be determined programmatically",
			"detail" : "The current position within the hierarchy cannot be determined programmatically (from an assistive technology such as a screen reader for example).",
			"solution" : "- breadcrumbs: apply an aria-current=\"location\" attribute on the active element \n- main navigation: add an aria-current=\"page\" attribute on the active item.",
			"technicalSolution" : "- breadcrumbs: <li aria-current=\"location\"> [...] </li> \n- main navigation: <a [...] aria-current=\"page\"> [...] </a> \n- procedure, multiple steps: <a [...] aria-current=\"step\"> [...] </a>"
		}
	],
	"testWebID-36": [
		{
			"title" : "A ARIA role (status, alert, alertdialog ...) or dynamic aria-live regions is missing",
			"detail" : "Alert messages are not heard from a screen reader.",
			"solution" : "Apply an ARIA role (\"status\", \"alert\", \"alertdialog\", etc ...) or an \"aria-live\" attribute to the alert message so that it is automatically vocalized from the onset.",
			"technicalSolution" : "examples: \n- <div role =\"status\"> [...] </div> \n- <div aria-live=\"assertive\"> [...] </div>"
		}
	],
	"testWebID-37": [
		{
			"title" : "A mechanism to stop moving content is missing",
			"detail" : "User must have control of moving content.",
			"solution" : "Provide an accessible mechanism to stop or pause moving content.",
			"technicalSolution" : ""
		}
	],
	"testWebID-38": [
		{
			"title" : "Item not usable on keyboard",
			"detail" : "An element cannot be used from keyboard navigation.",
			"solution" : "",
			"technicalSolution" : ""
		}
	],
	"testWebID-39": [
		{
			"title" : "Non-logical focus sequence",
			"detail" : "The movement of the focus does not follow a logical order (reading direction).",
			"solution" : "",
			"technicalSolution" : ""
		}
	],
	"testWebID-40": [
		{
			"title" : "Focus visualization (outline) is disabled",
			"detail" : "The outline must not be deactivated.",
			"solution" : "Check that the outline is not deleted from a css property (ex: \"outline: none;\").",
			"technicalSolution" : ""
		}
	],
	"testWebID-41": [
		{
			"title" : "The visualization of the focus (outline) does not have sufficient contrast",
			"detail" : "The outline must have sufficient contrast with the background color whatever the context.",
			"solution" : "- preserve the default outline \n- if the outline color is customized, ensure that the color respects a ratio of 3:1 with the background color whatever the context.",
			"technicalSolution" : ""
		}
	],
	"testWebID-42": [
		{
			"title" : "Presence of truncated or overlapping texts",
			"detail" : "Content is truncated or overlapped after zooming to 200% of the text.",
			"solution" : "- apply relative units (em, rem, %) to text containers \n- or use \"min-width\" and \"min-height\" properties instead of \"width\" and \"height \" properties.",
			"technicalSolution" : ""
		}
	],
	"testWebID-43": [
		{
			"title" : "Presence of a horizontal scroll bar",
			"detail" : "A horizontal scroll bar appears after resizing the interface to 320px css wide.",
			"solution" : "- apply relative units (em, rem,%) to text containers \n- or use \"min-width\" and \"min-height\" properties instead of \"width\" and \"height\" properties.",
			"technicalSolution" : ""
		}
	],
	"testWebID-44": [
		{
			"title" : "Presence of truncated or overlapping texts",
			"detail" : "Contents are truncated or overlapped after applying text spacing properties.",
			"solution" : "Do not impose or inherit an absolute size (px, ...) to the spacing properties.",
			"technicalSolution" : "- apply relative units (em, rem,%) to text spacing properties \n- apply relative units (em, rem, %) to text containers \n- or use properties \"min-width\"and \"min-height\" instead of the \"width\"and \"height\" properties."
		}
	],
	"testWebID-45": [
		{
			"title" : "Components repeated on several pages, in different orders",
			"detail" : "Components repeated on several pages, do not appear in the same order on some pages.",
			"solution" : "The layout of the components must be homogeneous between all the pages of a site. Components should appear consistently, in the same relative order.",
			"technicalSolution" : ""
		}
	],
	"testWebID-46": [
		{
			"title" : "The clickable surface of some interactive elements is not sufficient.",
			"detail" : "The clickable area of ​​interactive elements must exceed 44 by 44 CSS pixels.",
			"solution" : "- enlarge the clickable surface to reach at least 44 by 44 CSS pixels \ n- propose a mechanism in the page allowing to enlarge the size without resorting to the zoom",
			"technicalSolution" : ""
		}
	],
	"testWebID-47": [
		{
			"title" : "Presence of non-labeled fields",
			"detail" : "All form elements must have a label.",
			"solution" : "Apply one of the solutions below: \n- addition of a \"label\" element, in accessible masking if necessary, programmatically linked to the field \n- use of an aria-labelledby pointing to relevant information for understand the nature of the field \n- adding an aria-label attribute \n- adding a title attribute",
			"technicalSolution" : "Examples: \ n-<label for=\"idInput\"> [...] </label> <input id=\"idInput\" type=\"[...]\"> \n- <h2 id=\"idHeading\"> [...] </h2> <input aria-labelledby=\"idHeading\" type=\"[...]\"> \n- <input aria-label=\"[...]\" type=\"[...]\"> \n- <input title=\"[...]\" type=\"[...]\">"
		}
	],
	"testWebID-48": [
		{
			"title" : "Présence de champs non-pertinents",
			"detail" : "Tous les éléments de formulaire doivent posséder un label pertinent, permettant de comprendre la nature du champ.",
			"solution" : "Compléter le libellé texte du label.",
			"technicalSolution" : ""
		}
	],
	"testWebID-49": [
		{
			"title" : "Absence de format de données",
			"detail" : "Un format de données est nécessaire pour permettre à tous les utilisateurs de renseigner correctement une information.",
			"solution" : "Ajouter un format de données. Ce format est lié de manière programmatique au champ.",
			"technicalSolution" : "Appliquer une des solutions ci-dessous :\n- intégrer le format de donnée dans l'élément label\nexemple : <label for=\"idInput\">Date JJ/MM/AAAA</label>\n- lier le format au champ via un attribut aria-describedby\nexemeple : <input aria-describedby=\"idDesc\" [...]><p id=\"idDesc\">Format de saisie : JJ/MM/AAAA</p>"
		},{
			"title" : "Le format de données n'est pas lié de manière programmatique au champ",
			"detail" : "Dans le cas le format de données ne sera pas perçu depuis une aide technique (exemple : lecteur d'écran).",
			"solution" : "Ajouter un format de données. Ce format est lié de manière programmatique au champ.",
			"technicalSolution" : "Appliquer une des solutions ci-dessous :\n- intégrer le format de donnée dans l'élément label\nexemple : <label for=\"idInput\">Date JJ/MM/AAAA</label>\n- lier le format au champ via un attribut aria-describedby\nexemeple : <input aria-describedby=\"idDesc\" [...]><p id=\"idDesc\">Format de saisie : JJ/MM/AAAA</p>"
		}
	],
	"testWebID-50": [
		{
			"title" : "Champ obligatoire non identifiable visuellement",
			"detail" : "L'identification visuelle du champ obligatoire ne repose pas uniquement sur la couleur.",
			"solution" : "Ajouter une information visuelle ne reposant pas uniquement sur la couleur, exemple : astérisque, icône, etc...",
			"technicalSolution" : ""
		},
		{
			"title" : "Champ obligatoire non identifiable ne manière programmatique",
			"detail" : "L'identification d'un champ obligatoire n'est pas possible depuis une aide technique (ex: lecteur d'écran), si elle n'est pas donner de manière programmatique.",
			"solution" : "Utiliser une des techniques ci-dessous :\n- information visuelle intégrée dans le label\n- ajout d'un attribut \"required\" sur l'input \n- ajout d'un attribut \"aria-required\" sur l'input",
			"technicalSolution" : ""
		}
	],
	"testWebID-51": [
		{
			"title" : "Présence de champs non-groupés",
			"detail" : "Lorque nécessaire les champs ne même natures doivent être groupés",
			"solution" : "- appliquer un \"fieldset\" complété par un élément \"legend\"\n- appliquer un role \"group\" sur l'élément parent encapsulant les champs, et compléter par une légende basée sur un aria-labelledby",
			"technicalSolution" : ""
		}
	],
	"testWebID-52": [
		{
			"title" : "Présence de messages d'erreurs non-pertinents",
			"detail" : "Des messages d'erreurs sont absents ou non pertinents.",
			"solution" : "Les messages d'erreurs doivent permettre aux utilisateurs de corriger facilement leurs erreurs de saisie.",
			"technicalSolution" : ""
		}
	],
	"testWebID-53": [
		{
			"title" : "Des messages d'erreurs ne sont pas perçus par les utilisateurs",
			"detail" : "Les messages d'erreurs doivent être perçus par tous les utilisateurs, quelques-soit leur équipement.",
			"solution" : "Appliquer une des techniques ci-dessous :\n- Le message d'erreur est présent avant le formulaire.\nLe message liste les champs en erreur.\nLe focus est positionné sur le message d'erreur.\nDes ancres permettent à l'utilisateur de se positionner sur les champs en erreurs.\n-Les messages d'erreurs sont ajoutés dans les labels des champs.\n- Les messages d'erreurs ne sont pas intégrés dans les labels, mais un mécanisme est présent afin de lier les champs et les erreurs de manière programmatique : voir aria-describedby ",
			"technicalSolution" : ""
		}
	],
	"testWebID-54": [
		{
			"title" : "Des données importantes sont soumises sans possibilité d'être annuler ou vérifier",
			"detail" : "Les utilisateurs doivent avoir le contrôle lors de la soumission de données importantes (engagement juridique, transaction financière, modification ou effacement de données importantes, réponse à un test ou examen...).",
			"solution" : "Appliquer une des solutions ci-dessous :\n- L'action peut être annulée\n- une étape de confirmation permettant la vérification ou la modification est présente avant validation ",
			"technicalSolution" : "Exemple :\nAprès soumission du formulaire, un message de confirmation apparaît dans une popin.\nLe message reprend les données saisies par l'utilisateur, et donne la possibilité de valider ou annuler.\nSi l'utilisateur annule, il est redirigé vers le formulaire, ses saisies sont toujours présentes dans les champs, avec la possibilité de les modifier."
		}
	],
	"testWebID-55": [
		{
			"title" : "Absence d'attribut autocomplete pour des champs présentant des données personnelles",
			"detail" : "Tout champ permettant de collecter des données spécifiques sur l'utilisateur, doit posséder un attribut \"autocomplete\".",
			"solution" : "Ajouter un attribut \"autocomplete\" sur l'input. La valeur de l'autocomplete dépend de la nature de l'information collectée dans le champ.",
			"technicalSolution" : "exemples : autocomplete=\"username\", autocomplete=\"new-password\", autocomplete=\"postal-code\", etc... "
		}
	],
	"testWebID-56": [
		{
			"title" : "Le zoom n'est pas autorisé",
			"detail" : "L'agrandissement du texte à 200% doit être possible.",
			"solution" : "Si une balise \"<meta name= 'viewport'>\" est présente :\n- le paramètre user-scalable='no' n’est pas présent\n- et le paramètre maximum-scale n’est pas inférieur à 2 ",
			"technicalSolution" : ""
		}
	],
	"testWebID-57": [
		{
			"title" : "Une action ne peut être annulée",
			"detail" : "L'action ne peut être annulée car déclenchée sur l'évènement DOWN.",
			"solution" : "- déclencher l'action sur l'évènement UP\n- pour des composants complexes (ex : drag n'drop), l'action sur le UP est complétée par une boîte de dialogue donnant la possibilité aux utilisateurs d'annuler leur action.",
			"technicalSolution" : ""
		}
	],
	"testWebID-58": [
		{
			"title" : "Une action basée sur une gestuelle complexe ne possède pas d'alternative",
			"detail" : "Toute action basée sur une gestuelle complexe doit posséder une alternative basée sur un seul pointeur.",
			"solution" : "Exemple : pour une action de zoom sur une carte au pincement de doigt, une alternative sous forme de <button> [+] et [-] est proposée",
			"technicalSolution" : ""
		}
	],
	"testWebID-59": [
		{
			"title" : "Perte d'information lors d'une consultation en mode portrait ou paysage",
			"detail" : "Le contenu et les fonctionnalités doivent être disponibles dans les 2 orientations sans pertes d'informations.",
			"solution" : "",
			"technicalSolution" : ""
		}
	],
	"testWebID-60": [
		{
			"title" : "L'état d'un composant n'est pas perçue depuis un lecteur d'écran",
			"detail" : "Les états coché/décochés, plié/déplié, etc... ne sont pas percue depuis un lecteur d'écran",
			"solution" : "- utiliser en priorité des composants natifs (exemple : utiliser des input checkbox pour des cases à cocher, l'état sera géré nativement\n- sinon veiller à appliquer les patterns ARIA, pour assurer une sémantique correcte et une gestion des états des composants (cf. attributs aria-expanded, aria-selected, etc...)",
			"technicalSolution" : ""
		}, {
			"title" : "Un composant interactifs n'est pas utilisable depuis un lecteur d'écran",
			"detail" : "Les fonctionnalités d'un composant ne pas utilisables depuis un lecteur d'écran",
			"solution" : "- utiliser en priorité des composants natifs (exemple : utiliser des input checkbox pour des cases à cocher, l'état sera géré nativement\n- sinon veiller à appliquer les patterns ARIA, pour assurer une sémantique correcte",
			"technicalSolution" : ""
		}
	]
}
