{
    "testID-001": [
        {
            "title": "Presence of visually unlabeled fields",
            "detail": "All form elements must have a visible label.",
            "solution": "Provide a relevant label, visible near each form field.",
            "technicalSolution": ""
        }
    ],
    "testID-004": [
        {
            "title": "Absence of data format",
            "detail": "A data format is necessary to allow all users to correctly enter information.",
            "solution": "Add a data format. This format is programmatically linked to the field.",
            "technicalSolution": "Display the data format in the label element, for example: 'Date in the format 'MM//DD/YYYY'"
        }
    ],
    "testID-072": [
        {
            "title": "Presence of form fields not linked to the label",
            "detail": "One or more form fields have an accessible name different from the visible label.",
            "solution": "Group the form fields with their visible label. To associate a form field with its visible label, use .accessibilityElement(children: .combine)",
            "technicalSolution": ""
        },
        {
            "title": "Presence of unlabeled fields",
            "detail": "All form fields must have an accessible name, especially those without a visible label.",
            "solution": "For elements without a visible label, apply an accessible name using the accessibilityLabel(_:) method.",
            "technicalSolution": ""
        }
    ],
    "testID-071": [
        {
            "title": "Presence of irrelevant field labels",
            "detail": "All form fields must have a relevant label that helps understand the nature of the field.",
            "solution": "Complete the text label of the label to understand the function of the field and/or the expected data.",
            "technicalSolution": ""
        }
    ],
    "testID-002": [
        {
            "title": "Presence of ungrouped fields",
            "detail": "When necessary, fields of the same nature must be grouped.",
            "solution": "Group the fields using .accessibilityElement(children: .contain) labeled with the accessibilityLabel(_:) method.",
            "technicalSolution": ""
        }
    ],
    "testID-003": [
        {
            "title": "Mandatory field not visually identifiable",
            "detail": "The visual identification of the mandatory field does not rely solely on color.",
            "solution": "Add visual information that does not rely solely on color, e.g., an asterisk, icon…",
            "technicalSolution": ""
        },
        {
            "title": "Mandatory field not programmatically identifiable",
            "detail": "The identification of a mandatory field is not possible from assistive technology (e.g., screen reader) if it is not provided programmatically.",
            "solution": "Add the textual information in the label (e.g., 'Date of birth (required)') or add accessibilityLabel(_:) to the visual element.",
            "technicalSolution": ""
        }
    ],
    "testID-005": [
        {
            "title": "Absence of autocomplete attribute for fields collecting personal data",
            "detail": "Any field that collects specific data about the user must have an \"autocomplete\" attribute.",
            "solution": "Add the 'textContentType' property to fields requesting personal data. The list of possible values is available at [Apple Developer Documentation](https://developer.apple.com/documentation/uikit/uitextcontenttype).",
            "technicalSolution": "example : .textContentType(.emailAddress)"
        }
    ],
    "testID-006": [
        {
            "title": "Error messages are not perceived by users",
            "detail": "Error messages must be perceived by all users, regardless of their equipment.",
            "solution": "Apply one of the following techniques:\n- The error message is displayed before the form, listing the fields with errors.\n- The focus is positioned on the error message.\n- Error messages are added to the labels of the fields.",
            "technicalSolution": "It is recommended to pair the display with an announcement method for error messages to be automatically conveyed by assistive technologies such as VoiceOver."
        }
    ],
    "testID-007": [
        {
            "title": "Absence of error messages",
            "detail": "Error messages are missing.",
            "solution": "Error messages allow users to easily detect input errors. Implement a form validation system to detect and display relevant and explicit error messages.",
            "technicalSolution": ""
        },
        {
            "title": "Presence of non-explicit error messages",
            "detail": "Error messages are not explicit enough to determine the nature of the error.",
            "solution": "Explicit error messages allow users to easily detect and correct errors. Therefore, plan for a specific message depending on the nature of the error.",
            "technicalSolution": ""
        },
        {
            "title": "Presence of error messages that do not identify the field in error",
            "detail": "The text of the error messages does not allow identifying the field in error.",
            "solution": "The text of the error message must allow identifying the field in error. The message must repeat the label of the field.",
            "technicalSolution": ""
        }
    ],
    "testID-008": [
        {
            "title": "Absence of correction suggestions",
            "detail": "When fields are in error, correction suggestions must be provided if necessary. For example:\n - Suggestion from a limited set of values\n - Additional help to correct an incorrectly formatted entry.",
            "solution": "Provide appropriate correction suggestions for the field and the type of error made.",
            "technicalSolution": ""
        }
    ],
    "testID-063": [
        {
            "title": "Authentication has only a cognitive test",
            "detail": "It is not possible to log in other than with a cognitive test.",
            "solution": "Another authentication technique must be present and not rely on a cognitive test, for example:\n- email authentication\n- login using OAuth\n- fields are correctly labeled to allow automatic filling.",
            "technicalSolution": ""
        }
    ],
    "testID-009": [
        {
            "title": "Important data is submitted without the possibility of being canceled or verified",
            "detail": "Users must have control when submitting important data (legal commitment, financial transaction, modification or deletion of important data, response to a test or exam…).",
            "solution": "Apply one of the solutions below:\n - The action can be canceled\n - a confirmation step allowing verification or modification is present before final validation.",
            "technicalSolution": "Example:\n After submitting the form, a confirmation message appears in a pop-up.\n The message repeats the data entered by the user and gives the option to validate or cancel.\n If the user cancels, they are redirected to the form, their entries are still present in the fields, with the possibility to modify them."
        }
    ],
    "testID-010": [
        {
            "title": "Page title not provided",
            "detail": "Each page must have a unique title.",
            "solution": "Use <code>navigationTitle</code> method in a <code>NavigationStack</code> view.",
            "technicalSolution": ".navigationTitle(\"Page title\")"
        },
        {
            "title": "Page title not relevant",
            "detail": "Each page must have a unique title and allowing to understand its role.",
            "solution": "Fill in the <code>navigationTitle</code> element with keywords that help understand the role of the page.",
            "technicalSolution": ".navigationTitle(\"Home-Orange Customer Space\")"
        }
    ],
    "testID-076": [
        {
            "title": "Level titles are not relevant.",
            "detail": "Level titles must be relevant and accurately describe the section of content they present.\n Titles of the same level cannot have the same wording.",
            "solution": "",
            "technicalSolution": ""
        }
    ],
    "testID-013": [
        {
            "title": "Insufficient contrast between text and background",
            "detail": "The contrast must be sufficient to understand the information conveyed by all texts.",
            "solution": "Ensure a contrast of at least 4.5:1 for normal-sized texts (smaller or equal to 18pt or 14pt bold). Ensure a contrast of at least 3:1 for large-sized texts (greater than 18pt or 14pt bold).",
            "technicalSolution": ""
        },
        {
            "title": "Insufficient contrast for ununderlined links",
            "detail": "Ununderlined links must have sufficient contrast with the surrounding text.",
            "solution": "Ensure a contrast of at least 4.5:1 between an ununderlined link and the surrounding normal-sized text (smaller or equal to 18pt or 14pt bold). Ensure a contrast of at least 3:1 between an ununderlined link and the surrounding large-sized text (greater than 18pt or 14pt bold).",
            "technicalSolution": ""
        }
    ],
    "testID-014": [
        {
            "title": "Insufficient contrast for icons conveying information",
            "detail": "The contrast must be sufficient to convey the information.",
            "solution": "Ensure a contrast of at least 3:1 for icons.",
            "technicalSolution": ""
        },
        {
            "title": "Insufficient contrast for interactive components (buttons, radio button, etc.) or states of components (hover, focus, etc.)",
            "detail": "The contrast must be sufficient to convey the information.",
            "solution": "Ensure a contrast of at least 3:1 for all interactive components and their different states (except for inactive components).",
            "technicalSolution": ""
        }
    ],
    "testID-015": [
        {
            "title": "Color is the only means of conveying information",
            "detail": "Color must not be the only means of conveying information: at least one other visual means is available to obtain the same information.",
            "solution": "Complement the color with explicit text or another visual information (e.g., icons use colors but also different shapes).",
            "technicalSolution": ""
        }
    ],
    "testID-016": [
        {
            "title": "Sensory information is the only means of conveying information",
            "detail": "Sensory information (e.g., position, size, sound) must not be the only means of transmitting information.",
            "solution": "Complement the information with text or an explicit message.",
            "technicalSolution": ""
        }
    ],
    "testID-017": [
        {
            "title": "Truncated or hidden texts",
            "detail": "Loss of information due to the presence of truncated or hidden texts when resizing the page (zoom-level at 200%).",
            "solution": "To solve this kind of issues, use DynamicType on texts and containers of the application.",
            "technicalSolution": ""
        },
        {
            "title": "Zoom is not allowed",
            "detail": "Text enlargement must be possible for all pages.",
            "solution": "",
            "technicalSolution": ""
        }
    ],
    "testID-018": [
        {
            "title": "Missing text alternative on informative graphic element",
            "detail": "Each informative graphic element (images, icons, etc.) must have a text alternative.",
            "solution": "Add an accessibilityLabel(_:) on graphic elements",
            "technicalSolution": "Image(\"oem_logo\") \n .accessibilityLabel(\"Orange et Moi logo\")"
        },
        {
            "title": "The text alternative of an image containing text is not provided or is not relevant",
            "detail": "The text alternative does not include the text presented in the image.",
            "solution": "The text alternative must include at least the text from the image.",
            "technicalSolution": ""
        },
        {
            "title": "The text alternative of a complex image (diagram, graph…) is not relevant",
            "detail": "The text alternative of a complex image (diagram, graph…) is not relevant",
            "solution": "For any image description too long to be placed in an .accessibilityLabel, the detailed description shall be available near the image to be described: either on the same page or via a link/button opening the page with the description.",
            "technicalSolution": ""
        }
    ],
    "testID-019": [
        {
            "title": "Non-logical focus movement",
            "detail": "The focus movement does not follow a logical reading order.",
            "solution": "Use the .accessibilitySortPriority method to fix the order.",
            "technicalSolution": ""
        }
    ],
    "testID-020": [
        {
            "title": "Presence of ungrouped linked elements ungrouped",
            "detail": "Visually linked elements are not programmatically grouped",
            "solution": "Use .accessibilityElement(children: .combine) to group elements. If needed, modify the group accessible name with the .accessibilityLabel(_:).",
            "technicalSolution": ""
        }
    ],
    "testID-021": [
        {
            "title": "Absence of list structure",
            "detail": "Elements visually presented as a list must be rendered as a list.",
            "solution": "List items should be separated from each other to be read individually by the screen reader. For example, one `Text()` per item.",
            "technicalSolution": ""
        }
    ],
    "testID-022": [
        {
            "title": "Headers not rendered to the screen reader",
            "detail": "Elements visually presented as headers are not rendered as such to the screen reader.",
            "solution": "Apply the attribute `.accessibilityAddTraits(.isHeader)` to the headers.",
            "technicalSolution": ""
        }
    ],
    "testID-049": [
        {
            "title": "Lack of notifications for status or contextual messages",
            "detail": "Status or contextual messages (alert, result, or progress of an action) are not perceived by a screen reader.",
            "solution": "Use the announcement system UIAccessibility.post(notification: .announcement, argument: message) or AccessibilityNotification.Announcement.",
            "technicalSolution": ""
        }
    ],
    "testID-024": [
        {
            "title": "The state of a component is not perceived from a screen reader",
            "detail": "Checked/unchecked, collapsed/expanded states are not perceived by a screen reader.",
            "solution": "Use native components as much as possible (Button, Disclosure, Toggle, TabView, etc.).",
            "technicalSolution": ""
        },
        {
            "title": "An interactive component is not usable with a screen reader",
            "detail": "The functionalities of a component are not usable with a screen reader.",
            "solution": "Use native components as much as possible (Button, Disclosure, Toggle, TabView, etc.).",
            "technicalSolution": ""
        },
        {
            "title": "An interactive component has no accessible name",
            "detail": "An interactive component has no accessible name.",
            "solution": "Give an accessible name with accessibilityLabel(_:) method",
            "technicalSolution": ""
        }
    ],
    "testID-025": [
        {
            "title": "Non-visible elements on the screen are conveyed by the screen reader",
            "detail": "Non-visible elements on the screen are conveyed by the screen reader.",
            "solution": "In the case of opening a modal, use .accessibilityAddTraits(.isModal) to automatically hide the elements behind the modal.",
            "technicalSolution": ""
        }
    ],
    "testID-026": [
        {
            "title": "The ALT of a decorative image is not relevant",
            "detail": "The ALT attribute of a decorative image must be empty so that the image is ignored by assistive technologies.",
            "solution": "Hide elements from assistive technologies using the accessibilityHidden(_:) method or specifically for images: Image(decorative:).",
            "technicalSolution": ""
        }
    ],
    "testID-051": [
        {
            "title": "Absence of visible text in the accessible name",
            "detail": "The visible label (the textual label or the text of the visible image on the screen) must be present (first, if possible) in the accessible name of the component.",
            "solution": "Modify the accessible name of the element to include the visible text on the screen, if possible first.",
            "technicalSolution": "Use .accessibilityLabel"
        }
    ],
    "testID-070": [
        {
            "title": "Absence of row or column header semantics",
            "detail": "Headers are mandatory to identify the nature of the columns and/or rows.",
            "solution": "Use the Table component to structure data tables",
            "technicalSolution": ""
        },
        {
            "title": "Presence of a formatting table",
            "detail": "Tables must not be used for formatting.",
            "solution": "Use VStack and HStack views for layout.",
            "technicalSolution": ""
        }
    ],
    "testID-058": [
        {
            "title": "Language change not indicated",
            "detail": "Words and expressions in a foreign language must be indicated to users.",
            "solution": "Use the .accessibilitySpeechLanguage property to set the speech language. It's also possible to use .accessibilityLabel based on a translation file, see https://developer.apple.com/documentation/swiftui/localizedstringkey.",
            "technicalSolution": "<q lang=\"en\">[…]</q>"
        }
    ],
    "testID-059": [
        {
            "title": "Absence of headers",
            "detail": "There are missing headers that would allow assistive technology users to directly access content on the page.",
            "solution": "Use headers to define the different sections of your page.",
            "technicalSolution": "Declare headers with .accessibilityAddTraits(.isHeader)"
        },
        {
            "title": "Absence navigation mechanism",
            "detail": "The structure of the page and displayed informations require the ability to navigate quickly through a specific means other than headers (links, containers, etc.)",
            "solution": "Use .accessibilityAddTraits for instance",
            "technicalSolution": ""
        }
    ],
    "testID-027": [
        {
            "title": "Element not usable via keyboard",
            "detail": "An element is not usable from keyboard navigation.",
            "solution": "If an element is not reachable, it can be made accessible using the accessibilityRespondsToUserInteraction(_:) method.",
            "technicalSolution": ""
        }
    ],
    "testID-028": [
        {
            "title": "Presence of keyboard traps on the page",
            "detail": "Regardless of the type of component, the page or application, the user must be able to exit via keyboard navigation only without getting stuck.",
            "solution": "Allow the exit of the component (modal, popup, etc.) through a close button.",
            "technicalSolution": ""
        }
    ],
    "testID-075": [
        {
            "title": "User has no control over a keyboard shortcut",
            "detail": "The user has no control over a keyboard shortcut based on a printable character: letter (lowercase or uppercase), punctuation, number, or symbol character.",
            "solution": "The user must be able to:\n - disable the shortcut\n - or modify the shortcut to add an additional key to the combination\n - or ensure that the shortcut is active only when focusing on the interface component.",
            "technicalSolution": ""
        }
    ],
    "testID-029": [
        {
            "title": "Non-logical focus movement",
            "detail": "The focus movement does not follow a logical reading order.",
            "solution": "It's possible to modify focus order thanks to accessibilitySortPriority",
            "technicalSolution": ""
        }
    ],
    "testID-030": [
        {
            "title": "Focus is displayed but poorly visible",
            "detail": "The visibility of the focus must be sufficient (check contrast and size).",
            "solution": "To enhance the visibility of the focus, if possible you can:\nProvide a sufficient contrast between the focus and the background color (minimum ratio 3:1).\n- Add a focus outline.",
            "technicalSolution": ""
        }
    ],
    "testID-061": [
        {
            "title": "Focus is completely obscured by content",
            "detail": "The focus is completely obscured by an element on the page that appears during keyboard navigation or with selection control.",
            "solution": ".",
            "technicalSolution": ""
        }
    ],
    "testID-031": [
        {
            "title": "An action based on device movement or user gesture has no alternative",
            "detail": "Any action based on device movement or gesture must have an alternative.",
            "solution": "Allow triggering this action by another means (e.g., add a button in the interface).",
            "technicalSolution": ""
        }
    ],
    "testID-032": [
        {
            "title": "An action based on complex gestures has no alternative",
            "detail": "Any action based on a complex gesture must have an alternative based on the use of a single pointer.",
            "solution": "Example: for a zoom action on a map with a pinch gesture, an alternative in with [+] and [-] buttons is provided.",
            "technicalSolution": ""
        }
    ],
    "testID-074": [
        {
            "title": "A drag-and-drop action has no alternative",
            "detail": "A drag-and-drop action cannot be performed by another means",
            "solution": "Drag-and-drop features should have an alternative that does not require dexterity specific to this type of movement (single-point action).",
            "technicalSolution": ""
        }
    ],
    "testID-033": [
        {
            "title": "An action cannot be cancelled",
            "detail": "The action cannot be cancelled as it is triggered on the touchDown event.",
            "solution": "Use native gestures as much as possible: https://developer.apple.com/design/human-interface-guidelines/gestures#Standard-gestures.\nFor a non-native gesture, define activation only at the end of the gesture using the onEnded method.",
            "technicalSolution": ""
          }
    ],
    "testID-034": [
        {
            "title": "Loss of information when viewing in portrait or landscape mode",
            "detail": "Content and functionalities must be available in both orientations without loss of information.",
            "solution": "",
            "technicalSolution": ""
        },
        {
            "title": "Content display is limited to a single orientation (landscape or portrait)",
            "detail": "It is impossible to display content in both available orientations, or a message appears asking to reorient the device.",
            "solution": "",
            "technicalSolution": ""
        }
    ],
    "testID-050": [
        {
            "title": "Clickable elements have a too small touch target",
            "detail": "Clickable elements have a too small touch target.",
            "solution": "The touch area should be at least 44pt (height AND width).",
            "technicalSolution": ""
        }
    ],
    "testID-035": [
        {
            "title": "Repeated components on multiple pages, in different orders",
            "detail": "Repeated components on multiple pages do not appear in the same order on some pages.",
            "solution": "The layout of components must be consistent across all pages of a site. Components must appear uniformly, in the same relative order.",
            "technicalSolution": ""
        }
    ],
    "testID-073": [
        {
            "title": "Help presented inconsistently across multiple pages",
            "detail":"A repeated help mechanism across multiple pages is not presented consistently on each page.",
            "solution": "If one or more help devices are provided, they should always be located in the same place, presented in the same manner, and in the same order on all screens.",          
            "technicalSolution": ""
        }
    ],
    "testID-036": [
        {
            "title": "A time limit is not controllable by the user",
            "detail": "Any time limit must be controllable by the user.",
            "solution": "Any time limit must either be removed, or increased to at least 10 times the default time, or the user is warned at least 20 seconds before the end and can easily extend the duration.",
            "technicalSolution": ""
        }
    ],
    "testID-038": [
        {
            "title": "Opening of a popup or modal when focusing on an element or loading the page",
            "detail": "Upon loading the page or focusing, no modal or popup should open.",
            "solution": "",
            "technicalSolution": ""
        },
        {
            "title": "Form submitted automatically when focusing on an element",
            "detail": "A form is submitted automatically as soon as an element of the form is focused.",
            "solution": "A form must be submitted only after activating the submit button.",
            "technicalSolution": ""
        },
        {
            "title": "Content change occurs when focusing",
            "detail": "A content change occurs without being voluntarily initiated by the user.",
            "solution": "A content change must occur only after voluntary triggering by the user on a link or action button.",
            "technicalSolution": ""
        },
        {
            "title": "Opening a new page when focusing",
            "detail": "A page (or tab) change occurs without being voluntarily initiated by the user.",
            "solution": "A content change must occur only after voluntary triggering by the user on a link.",
            "technicalSolution": ""
        }
    ],
    "testID-039": [
        {
            "title": "Absence of a mechanism to stop moving content",
            "detail": "The user must have control over moving content.",
            "solution": "Provide an accessible mechanism to stop or pause moving content.",
            "technicalSolution": ""
        }
    ],
    "testID-040": [
        {
            "title": "Presence of rapid flickering",
            "detail": "Presence of content showing rapid flickering (more than 3 flashes per second) or flashes are below the general threshold or red threshold.",
            "solution": "",
            "technicalSolution": ""
        }
    ],
    "testID-056": [
        {
            "title": "Repeated components on multiple pages, with different labels",
            "detail": "Repeated components on multiple pages do not have the same name (accessible).",
            "solution": "Repeated components on multiple pages must have homogeneous labels.",
            "technicalSolution": ""
        }
    ],
    "testID-052": [
        {
            "title": "Presence of image of text",
            "detail": "Images should not be used to display text.",
            "solution": "If some text is presented on an image, a text alternative should be displayed nearby.",
            "technicalSolution": ""
        }
    ],
    "testID-054": [
        {
            "title": "Presence of link or button labels that are not understandable in their context",
            "detail": "The target of a link or button is not understandable even with the help of its direct context (surrounding text).",
            "solution": "Add distinguishing information in the surrounding text.",
            "technicalSolution": ""
          }
    ],
    "testID-068": [
        {
            "title": "Presence of button labels that are not understandable",
            "detail": "The action conveyed by a button is not understandable.",
            "solution": "Add discriminating information in the button labels.",
            "technicalSolution": "The accessible name of the button must allow understanding its function; all or part of the text can be hidden in an accessible manner."
        }
    ],
    "testID-069": [
        {
            "title": "Only one navigation mechanism is present",
            "detail": "At least 2 navigation mechanisms must be present on the pages.",
            "solution": "Complete the existing mechanism with a solution listed below:\n - a main navigation menu\n - a tab bar\n - a search mechanism.",
            "technicalSolution": ""
        }
    ],
    "testID-041": [
        {
            "title": "Absence of complete transcript",
            "detail": "A complete transcript (text containing all visual and auditory information) must be provided as an alternative to audio or video tracks.",
            "solution": "Add a complete transcript in text, either directly on the page or via a link pointing to another page (in-app or external) containing this transcript, and this, near the element to be described.",
            "technicalSolution": ""
        }
    ],
    "testID-042": [
        {
            "title": "Absence of complete transcript",
            "detail": "A complete transcript (text containing all visual and auditory information) must be provided as an alternative to audio or video tracks.",
            "solution": "Add a complete transcript in text, either directly on the page or via a link pointing to another page (in-app or external) containing this transcript, and this, near the element to be described.",
            "technicalSolution": ""
        }
    ],
    "testID-043": [
        {
            "title": "Absence of complete transcript",
            "detail": "A complete transcript (text containing all visual and auditory information) must be provided as an alternative to audio or video tracks.",
            "solution": "Add a complete transcript in text, either directly on the page or via a link pointing to another page (in-app or external) containing this transcript, and this, near the element to be described.",
            "technicalSolution": ""
        }
    ],
    "testID-044": [
        {
            "title": "Absence of audio description",
            "detail": "An audio description is necessary for videos presenting information visually.",
            "solution": "Add an audio description in addition to the audio track if needed. This presents, in text format, the information conveyed solely by the image.",
            "technicalSolution": ""
        }
    ],
    "testID-045": [
        {
            "title": "Absence of subtitles",
            "detail": "For any video, subtitles must be available.",
            "solution": "Add subtitles in text format for all videos. These convey all information from the audio track.",
            "technicalSolution": ""
        }
    ],
    "testID-046": [
        {
            "title": "Absence of subtitles",
            "detail": "For any video, subtitles must be available.",
            "solution": "Add subtitles in text format for all videos. These convey all information from the audio track.",
            "technicalSolution": ""
        }
    ],
    "testID-047": [
        {
            "title": "Unable to stop an audio or video track",
            "detail": "Audio tracks on the page that play automatically for more than 3 seconds can be stopped or paused.",
            "solution": "Provide an easily reachable and accessible mechanism allowing users to stop or pause an audio (e.g., a link at the beginning of the tabbing 'pause the video').",
            "technicalSolution": ""
        },
        {
            "title": "Unable to mute an audio or video track independently of system volume",
            "detail": "Audio tracks on the page that play automatically for more than 3 seconds must provide a way to mute the sound, without being dependent on system volume.",
            "solution": "Provide an easily reachable and accessible mechanism allowing users to control the volume of sounds played for more than 3 seconds (e.g., a link at the beginning of the tabbing 'mute the audio').",
            "technicalSolution": ""
        }
    ],
    "testID-065": [
        {
            "title": "Textual alternative of CAPTCHA absent or incorrect.",
            "detail": "The textual alternative of the CAPTCHA image does not indicate to the user that it is a CAPTCHA.",
            "solution": "Provide a valid textual alternative for this image, example: \"CAPTCHA (anti-spam image)\".",
            "technicalSolution": "<img alt=\"CAPTCHA (anti-spam image)\" […]>"
        }
    ],
    "testID-066": [
        {
            "title": "Absence of alternative to CAPTCHA",
            "detail": "Any purely visual or auditory CAPTCHA must have an accessible alternative.",
            "solution": "Provide as an alternative: an audio + visual CAPTCHA, or logical tests (questions with obvious answers, simple math test…).",
            "technicalSolution": ""
        }
    ],
    "testID-067": [
        {
            "title": "Absence of alternative to cryptic content",
            "detail": "Any cryptic content must have a relevant textual alternative.",
            "solution": "Provide a relevant textual alternative",
            "technicalSolution": ""
        }
    ]
}